{
  "source_file": "/home/content/books/science/jesc104.pdf",
  "filename": "jesc104.pdf",
  "subject": "science",
  "conversion_timestamp": "2025-07-18T12:08:08.797478",
  "processing_time_seconds": 35.47,
  "metadata": "md",
  "content": {
    "markdown_text": "![](_page_0_Picture_0.jpeg)\n\nI n the last Chapter, we came to know many compounds of importance to us. In this Chapter we will study about some more interesting compounds and their properties. Also, we shall be learning about carbon, an element which is of immense significance to us in both its elemental form and in the combined form.\n\n- n Make a list of ten things you have used or consumed since the morning.\n- n Compile this list with the lists made by your classmates and then sort the items into the adjacent Table.\n- n If there are items which are made up of more than one material, put them into both the relevant columns of the table.\n\n| Activity 4.1                                                                                                                                                                                                                                                                                                                | Things made<br>of metal | Things made<br>of glass/clay | Others |\n|-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|-------------------------|------------------------------|--------|\n| Make a list of ten things you have used<br>or consumed since the morning.<br>Compile this list with the lists made by<br>your classmates and then sort the items<br>into the adjacent Table.<br>If there are items which are made up of<br>more than one material, put them into<br>both the relevant columns of the table. |                         |                              |        |\n\nLook at the items that come in the last column of the above table filled by you – your teacher will be able to tell you that most of them are made up of compounds of carbon. Can you think of a method to test this? What would be the product if a compound containing carbon is burnt? Do you know of any test to confirm this?\n\nFood, clothes, medicines, books, or many of the things that you listed are all based on this versatile element carbon. In addition, all living structures are carbon based. The amount of carbon present in the earth's crust and in the atmosphere is quite meagre. The earth's crust has only 0.02% carbon in the form of minerals (like carbonates, hydrogencarbonates, coal and petroleum) and the atmosphere has 0.03% of carbon dioxide. In spite of this small amount of carbon available in nature, the importance of carbon seems to be immense. In this Chapter, we will know about the properties of carbon which make carbon so important to us.\n\n### 4.1 BONDING IN CARBON – THE COVALENT BOND\n\nIn the previous Chapter, we have studied the properties of ionic compounds. We saw that ionic compounds have high melting and boiling points and conduct electricity in solution or in the molten state. We also saw how the nature of bonding in ionic compounds explains these properties. Let us now study the properties of some carbon compounds.\n\nMost carbon compounds are poor conductors of electricity as we\n\nhave seen in Chapter 2. From the data given in Table 4.1 on the boiling and melting points of the carbon compounds, we find that these compounds have low melting and boiling points as compared to ionic compounds (Chapter 3). We can conclude that the forces of attraction between the molecules are not very strong. Since these compounds are largely non-conductors of electricity, we can conclude that the bonding in these compounds does not give rise to any ions.\n\n| Compound               | Melting<br>point (K) | Boiling<br>point (K) |\n|------------------------|----------------------|----------------------|\n| Acetic acid (CH3COOH)  | 290                  | 391                  |\n| Chloroform (CHCl3<br>) | 209                  | 334                  |\n| Ethanol (CH3CH2OH)     | 156                  | 351                  |\n| Methane (CH4<br>)      | 90                   | 111                  |\n\nTable 4.1 Melting points and boiling points of some compounds of carbon\n\nIn Class IX, we learnt about the combining capacity of various elements and how it depends on the number of valence electrons. Let us now look at the electronic configuration of carbon. The atomic number of carbon is 6. What would be the distribution of electrons in various shells of carbon? How many valence electrons will carbon have?\n\nWe know that the reactivity of elements is explained as their tendency to attain a completely filled outer shell, that is, attain noble gas configuration. Elements forming ionic compounds achieve this by either gaining or losing electrons from the outermost shell. In the case of carbon, it has four electrons in its outermost shell and needs to gain or lose four electrons to attain noble gas configuration. If it were to gain or lose electrons –\n\n- (i) It could gain four electrons forming C4– anion. But it would be difficult for the nucleus with six protons to hold on to ten electrons, that is, four extra electrons.\n- (ii) It could lose four electrons forming C4+ cation. But it would require a large amount of energy to remove four electrons leaving behind a carbon cation with six protons in its nucleus holding on to just two electrons.\n\nCarbon overcomes this problem by sharing its valence electrons with other atoms of carbon or with atoms of other elements. Not just carbon, but many other elements form molecules by sharing electrons in this manner. The shared electrons 'belong' to the outermost shells of both the atoms and lead to both atoms attaining the noble gas configuration. Before going on to compounds of carbon, let us look at some simple molecules formed by the sharing of valence electrons.\n\nThe simplest molecule formed in this manner is that of hydrogen. As you have learnt earlier, the atomic number of hydrogen is 1. Hence hydrogen has one electron in its K shell and it requires one more electron to fill the K shell. So two hydrogen atoms share their electrons to form a molecule of hydrogen, H<sup>2</sup> . This allows each hydrogen atom to attain the\n\n![](_page_2_Figure_0.jpeg)\n\n*Figure 4.1 A molecule of hydrogen*\n\n![](_page_2_Figure_2.jpeg)\n\n*Figure 4.2 Single bond between two hydrogen atoms*\n\n![](_page_2_Figure_4.jpeg)\n\n*Figure 4.3 Double bond between two oxygen atoms*\n\n![](_page_2_Figure_6.jpeg)\n\n*Figure 4.4 Triple bond between two nitrogen atoms*\n\nelectronic configuration of the nearest noble gas, helium, which has two electrons in its K shell. We can depict this using dots or crosses to represent valence electrons (Fig. 4.1).\n\nThe shared pair of electrons is said to constitute a single covalent bond between the two hydrogen atoms. A single covalent bond is also represented by a line between the two atoms, as shown in Fig. 4.2.\n\nThe atomic number of chlorine is 17. What would be its electronic configuration and its valency? Chlorine forms a diatomic molecule, Cl<sup>2</sup> . Can you draw the electron dot structure for this molecule? Note that only the valence shell electrons need to be depicted.\n\nIn the case of oxygen, we see the formation of a double bond between two oxygen atoms. This is because an atom of oxygen has six electrons in its L shell (the atomic number of oxygen is eight) and it requires two more electrons to complete its octet. So each atom of oxygen shares two electrons with another atom of oxygen to give us the structure shown in Fig. 4.3. The two electrons contributed by each oxygen atom give rise to two shared pairs of electrons. This is said to constitute a double bond between the two atoms.\n\n> Can you now depict a molecule of water showing the nature of bonding between one oxygen atom and two hydrogen atoms? Does the molecule have single bonds or double bonds?\n\n> What would happen in the case of a diatomic molecule of nitrogen? Nitrogen has the atomic number 7. What would be its electronic configuration and its combining capacity? In order to attain an octet, each nitrogen atom in a molecule of nitrogen contributes three electrons giving rise to three shared pairs of electrons. This is said to constitute a triple bond between the two atoms. The electron dot structure of N<sup>2</sup> and its triple bond can be depicted as in Fig. 4.4.\n\n> A molecule of ammonia has the formula NH<sup>3</sup> . Can you draw the electron dot structure for this molecule showing how all four atoms achieve noble gas configuration? Will the molecule have single, double or triple bonds?\n\n> Let us now take a look at methane, which is a compound of carbon. Methane is widely used as a fuel and is a major component of bio-gas and Compressed Natural Gas (CNG). It is also one of the simplest compounds formed by carbon. Methane has a formula CH<sup>4</sup> . Hydrogen, as you know, has a valency of 1. Carbon is tetravalent because it has four valence electrons. In order to achieve noble gas configuration, carbon shares these electrons with four atoms of hydrogen as shown in Fig. 4.5.\n\nSuch bonds which are formed by the sharing of an electron pair between two atoms are known as covalent bonds. Covalently bonded molecules are seen to have strong bonds within the molecule, but intermolecular forces are weak. This gives rise to the low melting and boiling points of these compounds. Since the electrons are shared between atoms and no charged particles are formed, such covalent compounds are generally poor conductors of electricity.\n\n# Allotropes of carbon\n\nThe element carbon occurs in different forms in nature with widely varying physical properties. Both diamond and graphite are formed by carbon atoms, the difference lies in the manner in which the carbon atoms are bonded to one another. In diamond, each carbon atom is bonded to four other carbon atoms forming a rigid three-dimensional structure. In graphite, each carbon atom is bonded to three other carbon atoms in the same plane giving a hexagonal array. One of these bonds is a double-bond, and thus the valency of carbon is satisfied. Graphite structure is formed by the hexagonal arrays being placed in layers one above the other.\n\n![](_page_3_Picture_3.jpeg)\n\n*Figure 4.5 Electron dot structure for methane*\n\n![](_page_3_Figure_5.jpeg)\n\n*The structure of graphite*\n\n*Buckminsterfullerene*\n\nThese two different structures result in diamond and graphite having very different physical properties even though their chemical properties are the same. Diamond is the hardest substance known while graphite is smooth and slippery. Graphite is also a very good conductor of electricity unlike other non-metals that you studied in the previous Chapter.\n\nDiamonds can be synthesised by subjecting pure carbon to very high pressure and temperature. These synthetic diamonds are small but are otherwise indistinguishable from natural diamonds.\n\nFullerenes form another class of carbon allotropes. The first one to be identified was C-60 which has carbon atoms arranged in the shape of a football. Since this looked like the geodesic dome designed by the US architect Buckminster Fuller, the molecule was named fullerene.\n\n# QUESTIONS\n\n- 1. What would be the electron dot structure of carbon dioxide which has the formula CO<sup>2</sup> ?\n- 2. What would be the electron dot structure of a molecule of sulphur which is made up of eight atoms of sulphur? (Hint – The eight atoms of sulphur are joined together in the form of a ring.)\n\n?\n\n#### 4.2 VERSATILE NATURE OF CARBON\n\nWe have seen the formation of covalent bonds by the sharing of electrons in various elements and compounds. We have also seen the structure of a simple carbon compound, methane. In the beginning of the Chapter, we saw how many things we use contain carbon. In fact, we ourselves are made up of carbon compounds. The numbers of carbon compounds whose formulae are known to chemists was recently estimated to be in millions! This outnumbers by a large margin the compounds formed by all the other elements put together. Why is it that this property is seen in carbon and no other element? The nature of the covalent bond enables carbon to form a large number of compounds. Two factors noticed in the case of carbon are –\n\n(i) Carbon has the unique ability to form bonds with other atoms of carbon, giving rise to large molecules. This property is called catenation. These compounds may have long chains of carbon, branched chains of carbon or even carbon atoms arranged in rings. In addition, carbon atoms may be linked by single, double or triple bonds. Compounds of carbon, which are linked by only single bonds between the carbon atoms are called saturated compounds. Compounds of carbon having double or triple bonds between their carbon atoms are called unsaturated compounds.\n\nNo other element exhibits the property of catenation to the extent seen in carbon compounds. Silicon forms compounds with hydrogen which have chains of upto seven or eight atoms, but these compounds are very reactive. The carbon-carbon bond is very strong and hence stable. This gives us the large number of compounds with many carbon atoms linked to each other.\n\n(ii) Since carbon has a valency of four, it is capable of bonding with four other atoms of carbon or atoms of some other mono-valent element. Compounds of carbon are formed with oxygen, hydrogen, nitrogen, sulphur, chlorine and many other elements giving rise to compounds with specific properties which depend on the elements other than carbon present in the molecule.\n\nAgain the bonds that carbon forms with most other elements are very strong making these compounds exceptionally stable. One reason for the formation of strong bonds by carbon is its small size. This enables the nucleus to hold on to the shared pairs of electrons strongly. The bonds formed by elements having bigger atoms are much weaker.\n\n#### Organic compounds\n\nThe two characteristic features seen in carbon, that is, tetravalency and catenation, put together give rise to a large number of compounds. Many have the same non-carbon atom or group of atoms attached to different carbon chains. These compounds were initially extracted from natural substances and it was thought that these carbon compounds or organic compounds could only be formed within a living system. That is, it was postulated that a 'vital force' was necessary for their synthesis. Friedrich Wöhler disproved this in 1828 by preparing urea from ammonium cyanate. But carbon compounds, except for carbides, oxides of carbon, carbonate and hydrogencarbonate salts continue to be studied under organic chemistry.\n\n#### 4.2.1 Saturated and Unsaturated Carbon Compounds\n\nWe have already seen the structure of methane. Another compound formed between carbon and hydrogen is ethane with a formula of C2H<sup>6</sup> .\n\nIn order to arrive at the structure of simple carbon compounds, the first step is to link the carbon atoms together with a single bond (Fig. 4.6a) and then use the hydrogen atoms to satisfy the remaining valencies of carbon (Fig. 4.6b). For example, the structure of ethane is arrived in the following steps –\n\n#### C—C Step 1\n\n![](_page_5_Figure_9.jpeg)\n\nThree valencies of each carbon atom remain unsatisfied, so each is bonded to three hydrogen atoms giving:\n\n![](_page_5_Figure_11.jpeg)\n\nStep 2\n\n*Figure 4.6 (b) Each carbon atom bonded to three hydrogen atoms*\n\nThe electron dot structure of ethane is shown in Fig. 4.6(c).\n\nCan you draw the structure of propane, which has the molecular formula C3H8 in a similar manner? You will see that the valencies of all the atoms are satisfied by single bonds between them. Such carbon compounds are called saturated compounds. These compounds are normally not very reactive.\n\nHowever, another compound of carbon and hydrogen has the formula C2H<sup>4</sup> and is called ethene. How can this molecule be depicted? We follow the same step-wise approach as above.\n\nCarbon-carbon atoms linked together with a single bond (Step 1).\n\nWe see that one valency per carbon atom remains unsatisfied (Step 2). This can be satisfied only if there is a double bond between the two carbons (Step 3).\n\n![](_page_5_Picture_19.jpeg)\n\n*Figure 4.6 (c) Electron dot structure of ethane*\n\n![](_page_5_Figure_21.jpeg)\n\nCarbon and its Compounds 63\n\n![](_page_6_Picture_0.jpeg)\n\n*Figure 4.7 Structure of ethene*\n\nThe electron dot structure for ethene is given in Fig. 4.7. Yet another compound of hydrogen and carbon has the formula C2H<sup>2</sup> and is called ethyne. Can you draw the electron dot structure for ethyne? How many bonds are necessary between the two carbon atoms in order to satisfy their valencies? Such compounds of carbon having double or triple bonds between the carbon atoms are known as unsaturated carbon compounds and they are more reactive than the saturated carbon compounds.\n\n#### 4.2.2 Chains, Branches and Rings\n\nIn the earlier section, we mentioned the carbon compounds methane, ethane and propane, containing respectively 1, 2 and 3 carbon atoms. Such 'chains' of carbon atoms can contain many more carbon atoms. The names and structures of six of these are given in Table 4.2.\n\n![](_page_6_Figure_5.jpeg)\n\n| No. of C<br>atoms | Name    | Formula | Structure |\n|-------------------|---------|---------|-----------|\n| 1                 | Methane | CH4     |           |\n| 2                 | Ethane  | C2H6    |           |\n| 3                 | Propane | C3H8    |           |\n| 4                 | Butane  | C4H10   |           |\n| 5                 | Pentane | C5H12   |           |\n| 6                 | Hexane  | C6H14   |           |\n\nBut, let us take another look at butane. If we make the carbon 'skeleton' with four carbon atoms, we see that two different possible 'skeletons' are –\n\n```\nC—C—C—C\n```\n\n![](_page_7_Picture_2.jpeg)\n\n*Figure 4.8 (a) Two possible carbon-skeletons*\n\nFilling the remaining valencies with hydrogen gives us –\n\n![](_page_7_Figure_5.jpeg)\n\n*Figure 4.8 (b) Complete molecules for two structures with formula* C4H<sup>10</sup>\n\nWe see that both these structures have the same formula C4H10. Such compounds with identical molecular formula but different structures are called structural isomers.\n\nIn addition to straight and branched carbon chains, some compounds have carbon atoms arranged in the form of a ring. For example, cyclohexane has the formula C6H12 and the following structure –\n\n![](_page_7_Figure_9.jpeg)\n\n![](_page_7_Figure_10.jpeg)\n\nCan you draw the electron dot structure for cyclohexane? Straight chain, branched chain and cyclic carbon compounds, all may be saturated or unsaturated. For example, benzene, C6H<sup>6</sup> , has the following structure –\n\n![](_page_7_Figure_12.jpeg)\n\n#### *Figure 4.10 Structure of benzene*\n\nAll these carbon compounds which contain only carbon and hydrogen are called hydrocarbons. Among these, the saturated hydrocarbons are called alkanes. The unsaturated hydrocarbons which contain one or more double bonds are called alkenes. Those containing one or more triple bonds are called alkynes.\n\n#### 4.2.3 Will you be my Friend?\n\nCarbon seems to be a very friendly element. So far we have been looking at compounds containing carbon and hydrogen only. But carbon also forms bonds with other elements such as halogens, oxygen, nitrogen and sulphur. In a hydrocarbon chain, one or more hydrogens can be replaced by these elements, such that the valency of carbon remains satisfied. In such compounds, the element replacing hydrogen is referred to as a heteroatom. These heteroatoms are also present in some groups as given in Table 4.3.\n\nTable 4.3 Some functional groups in carbon compounds\n\n| Hetero<br>atom | Class<br>Class of of<br>compounds | Formula of<br>functional group                 |\n|----------------|-----------------------------------|------------------------------------------------|\n| Cl/Br          | Halo- (Chloro/bromo)<br>alkane    | —Cl, —Br<br>(substitutes for<br>hydrogen atom) |\n| Oxygen         | 1. Alcohol                        | —OH                                            |\n|                | 2. Aldehyde                       |                                                |\n|                | 3. Ketone                         |                                                |\n|                | 4. Carboxylic acid                |                                                |\n\nThese heteroatoms and the group containing these confer specific properties to the compound, regardless of the length and nature of the carbon chain and hence are called functional groups. Some important functional groups are given in the Table 4.3. Free valency or valencies of the group are shown by the single line. The functional group is attached to the carbon chain through this valency by replacing one hydrogen atom or atoms.\n\n#### 4.2.4 Homologous Series\n\nYou have seen that carbon atoms can be linked together to form chains of varying lengths. These chains can be branched also. In addition, hydrogen atom or other atoms on these carbon chains can be replaced by any of the functional groups that we saw above. The presence of a functional group such as alcohol decides the properties of the carbon compound, regardless of the length of the carbon chain. For example, the chemical properties of CH3OH, C2H5OH, C3H7OH and C4H9OH are all very similar. Hence, such a series of compounds in which the same functional group substitutes for hydrogen in a carbon chain is called a homologous series.\n\nLet us look at the homologous series that we saw earlier in Table 4.2. If we look at the formulae of successive compounds, say –\n\n| CH4<br>and C2H6  | — | these differ by a –CH2<br>- unit |\n|------------------|---|----------------------------------|\n| C2H6<br>and C3H8 | — | these differ by a –CH2<br>- unit |\n\nWhat is the difference between the next pair – propane and butane (C4H10)?\n\nCan you find out the difference in molecular masses between these pairs (the atomic mass of carbon is 12 u and the atomic mass of hydrogen is 1 u)?\n\nSimilarly, take the homologous series for alkenes. The first member of the series is ethene which we have already come across in Section 4.2.1. What is the formula for ethene? The succeeding members have the formula C3H<sup>6</sup> , C4H<sup>8</sup> and C5H10. Do these also differ by a –CH<sup>2</sup> – unit? Do you see any relation between the number of carbon and hydrogen atoms in these compounds? The general formula for alkenes can be written as CnH2n, where n = 2, 3, 4. Can you similarly generate the general formula for alkanes and alkynes?\n\nAs the molecular mass increases in any homologous series, a gradation in physical properties is seen. This is because the melting and boiling points increase with increasing molecular mass. Other physical properties such as solubility in a particular solvent also show a similar gradation. But the chemical properties, which are determined solely by the functional group, remain similar in a homologous series.\n\n### Activity 4.2\n\n- n Calculate the difference in the formulae and molecular masses for (a) CH3OH and C2H5OH (b) C2H5OH and C3H7OH, and (c) C3H7OH and C4H9OH.\n- n Is there any similarity in these three?\n- n Arrange these alcohols in the order of increasing carbon atoms to get a family. Can we call this family a homologous series?\n- n Generate the homologous series for compounds containing up to four carbons for the other functional groups given in Table 4.3.\n\n#### 4.2.5 Nomenclature of Carbon Compounds\n\nThe names of compounds in a homologous series are based on the name of the basic carbon chain modified by a \"prefix\" \"phrase before\" or \"suffix\" \"phrase after\" indicating the nature of the functional group. For example, the names of the alcohols taken in Activity 4.2 are methanol, ethanol, propanol and butanol.\n\nNaming a carbon compound can be done by the following method –\n\n- (i) Identify the number of carbon atoms in the compound. A compound having three carbon atoms would have the name propane.\n- (ii) In case a functional group is present, it is indicated in the name of the compound with either a prefix or a suffix (as given in Table 4.4).\n- (iii) If the name of the functional group is to be given as a suffix, and the suffix of the functional group begins with a vowel a, e, i, o, u, then the name of the carbon chain is modified by deleting the final 'e' and adding the appropriate suffix. For example, a three-carbon chain with a ketone group would be named in the following manner – Propane – 'e' = propan + 'one' = propanone.\n- (iv) If the carbon chain is unsaturated, then the final 'ane' in the name of the carbon chain is substituted by 'ene' or 'yne' as given in Table 4.4. For example, a three-carbon chain with a double bond would be called propene and if it has a triple bond, it would be called propyne.\n\n#### Table 4.4 Nomenclature of organic compounds\n\n| Prefix/Suffix                 | Example |                                                         |\n|-------------------------------|---------|---------------------------------------------------------|\n| Prefix-chloro,<br>bromo, etc. |         | Chloropropane                                           |\n|                               |         | Bromopropane                                            |\n| Suffix - ol                   |         |                                                         |\n| Suffix - al                   |         |                                                         |\n| Suffix - one                  |         |                                                         |\n| Suffix - oic acid             |         | Propanoic acid                                          |\n| Suffix - ene                  |         |                                                         |\n| Suffix - yne                  |         |                                                         |\n|                               |         | Propanol<br>Propanal<br>Propanone<br>Propene<br>Propyne |\n\n## QUESTIONS\n\n- 1. How many structural isomers can you draw for pentane?\n- 2. What are the two properties of carbon which lead to the huge number of carbon compounds we see around us?\n- 3. What will be the formula and electron dot structure of cyclopentane?\n\n![](_page_11_Figure_0.jpeg)\n\n#### 4.3 CHEMICAL PROPERTIES OF CARBON COMPOUNDS\n\nIn this section we will be studying about some of the chemical properties of carbon compounds. Since most of the fuels we use are either carbon or its compounds, we shall first study combustion.\n\n#### 4.3.1 Combustion\n\nCarbon, in all its allotropic forms, burns in oxygen to give carbon dioxide along with the release of heat and light. Most carbon compounds also release a large amount of heat and light on burning. These are the oxidation reactions that you learnt about in the first Chapter –\n\n- (i) C + O<sup>2</sup> <sup>→</sup> CO<sup>2</sup> + heat and light\n- (ii) CH<sup>4</sup> + O<sup>2</sup> <sup>→</sup> CO<sup>2</sup> + H2O + heat and light\n- (iii) CH3CH2OH + O<sup>2</sup> <sup>→</sup> CO<sup>2</sup> + H2O + heat and light\n\nBalance the latter two reactions like you learnt in the first Chapter.\n\n### Activity 4.3\n\nCAUTION: This Activity needs the teacher's assistance.\n\n- n Take some carbon compounds (naphthalene, camphor, alcohol) one by one on a spatula and burn them.\n- n Observe the nature of the flame and note whether smoke is produced.\n- n Place a metal plate above the flame. Is there a deposition on the plate in case of any of the compounds?\n\n#### Activity 4.4\n\nn Light a bunsen burner and adjust the air hole at the base to get different types of flames/presence of smoke.\n\n?\n\n- n When do you get a yellow, sooty flame?\n- n When do you get a blue flame?\n\nSaturated hydrocarbons will generally give a clean flame while unsaturated carbon compounds will give a yellow flame with lots of black smoke. This results in a sooty deposit on the metal plate in Activity 4.3. However, limiting the supply of air results in incomplete combustion of even saturated hydrocarbons giving a sooty flame. The gas/kerosene stove used at home has inlets for air so that a sufficiently oxygen-rich mixture is burnt to give a clean blue flame. If you observe the bottoms of cooking vessels getting blackened, it means that the air holes are blocked and fuel is getting wasted. Fuels such as coal and petroleum have some amount of nitrogen and sulphur in them. Their combustion results in the formation of oxides of sulphur and nitrogen which are major pollutants in the environment.\n\n#### Why do substances burn with or without a flame?\n\nHave you ever observed either a coal or a wood fire? If not, the next time you get a chance, take close note of what happens when the wood or coal starts to burn. You have seen above that a candle or the LPG in the gas stove burns with a flame. However, you will observe the coal or charcoal in an 'angithi' sometimes just glows red and gives out heat without a flame. This is because a flame is only produced when gaseous substances burn. When wood or charcoal is ignited, the volatile substances present vapourise and burn with a flame in the beginning.\n\nA luminous flame is seen when the atoms of the gaseous substance are heated and start to glow. The colour produced by each element is a characteristic property of that element. Try and heat a copper wire in the flame of a gas stove and observe its colour. You have seen that incomplete combustion gives soot which is carbon. On this basis, what will you attribute the yellow colour of a candle flame to?\n\n# Formation of coal and petroleum\n\nCoal and petroleum have been formed from biomass which has been subjected to various biological and geological processes. Coal is the remains of trees, ferns, and other plants that lived millions of years ago. These were crushed into the earth, perhaps by earthquakes or volcanic eruptions. They were pressed down by layers of earth and rock. They slowly decayed into coal. Oil and gas are the remains of millions of tiny plants and animals that lived in the sea. When they died, their bodies sank to the sea bed and were covered by silt. Bacteria attacked the dead remains, turning them into oil and gas under the high pressures they were being subjected to. Meanwhile, the silt was slowly compressed into rock. The oil and gas seeped into the porous parts of the rock, and got trapped like water in a sponge. Can you guess why coal and petroleum are called fossil fuels?\n\n#### 4.3.2 Oxidation\n\n### Activity 4.5\n\n- n Take about 3 mL of ethanol in a test tube and warm it gently in a water bath.\n- n Add a 5% solution of alkaline potassium permanganate drop by drop to this solution.\n- n Does the colour of potassium permanganate persist when it is added initially?\n- n Why does the colour of potassium permanganate not disappear when excess is added?\n\nYou have learnt about oxidation reactions in the first Chapter. Carbon compounds can be easily oxidised on combustion. In addition to this complete oxidation, we have reactions in which alcohols are converted to carboxylic acids –\n\nMore to Know!\n\nWe see that some substances are capable of adding oxygen to others. These substances are known as oxidising agents.\n\nAlkaline potassium permanganate or acidified potassium dichromate are oxidising alcohols to acids, that is, adding oxygen to the starting material. Hence they are known as oxidising agents.\n\n#### 4.3.3 Addition Reaction\n\nUnsaturated hydrocarbons add hydrogen in the presence of catalysts such as palladium or nickel to give saturated hydrocarbons. Catalysts are substances that cause a reaction to occur or proceed at a different rate without the reaction itself being affected. This reaction is commonly used in the hydrogenation of vegetable oils using a nickel catalyst. Vegetable oils generally have long unsaturated carbon chains while animal fats have saturated carbon chains.\n\n![](_page_13_Picture_5.jpeg)\n\nYou must have seen advertisements stating that some vegetable oils are 'healthy'. Animal fats generally contain saturated fatty acids which are said to be harmful for health. Oils containing unsaturated fatty acids should be chosen for cooking.\n\n#### 4.3.4 Substitution Reaction\n\nSaturated hydrocarbons are fairly unreactive and are inert in the presence of most reagents. However, in the presence of sunlight, chlorine is added to hydrocarbons in a very fast reaction. Chlorine can replace the hydrogen atoms one by one. It is called a substitution reaction because one type of atom or a group of atoms takes the place of another. A number of products are usually formed with the higher homologues of alkanes.\n\nCH<sup>4</sup> + Cl<sup>2</sup> <sup>→</sup> CH3Cl + HCl (in the presence of sunlight)\n\n![](_page_13_Figure_10.jpeg)\n\n### 4.4 SOME IMPORTANT CARBON COMPOUNDS – ETHANOL AND ETHANOIC ACID\n\nMany carbon compounds are invaluable to us. But here we shall study the properties of two commercially important compounds – ethanol and ethanoic acid.\n\nCarbon and its Compounds 71\n\n#### 4.4.1 Properties of Ethanol\n\nEthanol is a liquid at room temperature (refer to Table 4.1 for the melting and boiling points of ethanol). Ethanol is commonly called alcohol and is the active ingredient of all alcoholic drinks. In addition, because it is a good solvent, it is also used in medicines such as tincture iodine, cough syrups, and many tonics. Ethanol is also soluble in water in all proportions. Consumption of small quantities of dilute ethanol causes drunkenness. Even though this practice is condemned, it is a socially widespread practice. However, intake of even a small quantity of pure ethanol (called absolute alcohol) can be lethal. Also, long-term consumption of alcohol leads to many health problems.\n\n#### *Reactions of Ethanol*\n\n(i) Reaction with sodium –\n\n### Activity 4.6\n\nTeacher's demonstration –\n\n- n Drop a small piece of sodium, about the size of a couple of grains of rice, into ethanol (absolute alcohol).\n- n What do you observe?\n- n How will you test the gas evolved?\n\n#### 2Na + 2CH3CH2OH → 2CH3CH2O–Na<sup>+</sup> + H<sup>2</sup> (Sodium ethoxide)\n\nAlcohols react with sodium leading to the evolution of hydrogen. With ethanol, the other product is sodium ethoxide. Can you recall which other substances produce hydrogen on reacting with metals?\n\n(ii) Reaction to give unsaturated hydrocarbon: Heating ethanol at 443 K with excess concentrated sulphuric acid results in the dehydration of ethanol to give ethene –\n\n#### CH CH OH 3 2 CH = CH + H O <sup>2</sup> 2 2 Hot Conc. H SO <sup>2</sup> <sup>4</sup> − →\n\nThe concentrated sulphuric acid can be regarded as a dehydrating agent which removes water from ethanol.\n\n#### How do alcohols affect living beings?\n\nWhen large quantities of ethanol are consumed, it tends to slow metabolic processes and to depress the central nervous system. This results in lack of coordination, mental confusion, drowsiness, lowering of the normal inhibitions, and finally stupor. The individual may feel relaxed without realising that his sense of judgement, sense of timing, and muscular coordination have been seriously impaired.\n\nUnlike ethanol, intake of methanol in very small quantities can cause death. Methanol is oxidised to methanal in the liver. Methanal reacts rapidly with the components of cells. It coagulates the protoplasm, in much the same way an egg is coagulated by cooking. Methanol also affects the optic nerve, causing blindness.\n\nEthanol is an important industrial solvent. To prevent the misuse of ethanol produced for industrial use, it is made unfit for drinking by adding poisonous substances like methanol to it. Dyes are also added to colour the alcohol blue so that it can be identified easily. This is called denatured alcohol.\n\n#### **Alcohol as a fuel**\n\nSugarcane plants are one of the most efficient convertors of sunlight into chemical energy. Sugarcane juice can be used to prepare molasses which is fermented to give alcohol (ethanol). Some countries now use alcohol as an additive in petrol since it is a cleaner fuel which gives rise to only carbon dioxide and water on burning in sufficient air (oxygen).\n\n#### 4.4.2 Properties of Ethanoic Acid\n\nEthanoic acid is commonly called acetic acid and belongs to a group of acids called carboxylic acids. 5-8% solution of acetic acid in water is called vinegar and is used widely as a preservative in pickles. The melting point of pure ethanoic acid is 290 K and hence it often freezes during winter in cold climates. This gave rise to its name glacial acetic acid.\n\nThe group of organic compounds called carboxylic acids are obviously characterised by their acidic nature. However, unlike mineral acids like HCl, which are completely ionised, carboxylic acids are weak acids.\n\n#### Activity 4.8\n\n- n Take 1 mL ethanol (absolute alcohol) and 1 mL glacial acetic acid along with a few drops of concentrated sulphuric acid in a test tube.\n- n Warm in a water-bath for at least five minutes as shown in Fig. 4.11.\n- n Pour into a beaker containing 20-50 mL of water and smell the resulting mixture.\n\n#### **Reactions of ethanoic acid:**\n\n(i) *Esterification reaction:* Esters are most commonly formed by reaction of an acid and an alcohol. Ethanoic acid reacts with absolute ethanol in the presence of an acid catalyst to give an ester –\n\n#### CH COOH CH CH OH CH C C CH CH H O 3 3 2 3 2 3 2 Acid O (E - + - - - - - + thanoic acid) (Ethanol) (Ester) O\n\nGenerally, esters are sweet-smelling substances. These are used in making perfumes and as flavouring agents. On treating with sodium hydroxide, which is an alkali, the ester is converted back to alcohol and sodium salt of carboxylic acid. This reaction is known as saponification because it is used in the preparation of soap. Soaps are sodium or potassium salts of long chain carboxylic acid.\n\n#### Activity 4.7\n\n- n Compare the pH of dilute acetic acid and dilute hydrochloric acid using both litmus paper and universal indicator.\n- n Are both acids indicated by the litmus test?\n- n Does the universal indicator show them as equally strong acids?\n\n![](_page_15_Figure_19.jpeg)\n\n**Figure 4.11** *Formation of ester*\n\n#### CH COOC H C H OH+CH COONa <sup>3</sup> 2 5 2 5 <sup>3</sup> NaOH\n\n(ii) *Reaction with a base:* Like mineral acids, ethanoic acid reacts with a base such as sodium hydroxide to give a salt (sodium ethanoate or commonly called sodium acetate) and water:\n\n#### NaOH + CH3COOH → CH3COONa + H2<sup>O</sup>\n\n#### How does ethanoic acid react with carbonates and hydrogencarbonates?\n\nLet us perform an activity to find out.\n\n### Activity 4.9\n\n- n Set up the apparatus as shown in Chapter 2, Activity 2.5.\n- n Take a spatula full of sodium carbonate in a test tube and add 2 mL of dilute ethanoic acid.\n- n What do you observe?\n- n Pass the gas produced through freshly prepared lime-water. What do you observe?\n- n Can the gas produced by the reaction between ethanoic acid and sodium carbonate be identified by this test?\n- n Repeat this Activity with sodium hydrogencarbonate instead of sodium carbonate.\n  - (iii) *Reaction with carbonates and hydrogencarbonates*: Ethanoic acid reacts with carbonates and hydrogencarbonates to give rise to a salt, carbon dioxide and water. The salt produced is commonly called sodium acetate.\n\n2CH3COOH + Na2CO<sup>3</sup> <sup>→</sup> 2CH3COONa + H2O + CO<sup>2</sup>\n\nCH3COOH + NaHCO<sup>3</sup> <sup>→</sup> CH3COONa + H2O + CO<sup>2</sup>\n\n## QUESTIONS 1. How would you distinguish experimentally between an alcohol and a carboxylic acid? 2. What are oxidising agents? ?\n\n![](_page_16_Picture_16.jpeg)\n\n![](_page_16_Figure_17.jpeg)\n\n# 4.5 SOAPS AND DETERGENTS\n\n### Activity 4.10\n\n- n Take about 10 mL of water each in two test tubes.\n- n Add a drop of oil (cooking oil) to both the test tubes and label them as A and B.\n- n To test tube B, add a few drops of soap solution.\n- n Now shake both the test tubes vigourously for the same period of time.\n- n Can you see the oil and water layers separately in both the test tubes immediately after you stop shaking them?\n- n Leave the test tubes undisturbed for some time and observe. Does the oil layer separate out? In which test tube does this happen first?\n\nThis activity demonstrates the effect of soap in cleaning. Most dirt is oily in nature and as you know, oil does not dissolve in water. The molecules of soap are sodium or potassium salts of long-chain carboxylic acids. The ionic-end of soap interacts with water while the carbon chain interacts with oil. The soap molecules, thus form structures called micelles (see Fig. 4.12) where one end of the molecules is towards the oil droplet while the ionic-end faces outside. This forms an emulsion in water. The soap micelle thus helps in pulling out the dirt in water and we can wash our clothes clean (Fig. 4.13).\n\nCan you draw the structure of the micelle that would be formed if you dissolve soap in a hydrocarbon?\n\n![](_page_17_Figure_2.jpeg)\n\n### Activity 4.11\n\n- n Take about 10 mL of distilled water (or rain water) and 10 mL of hard water (from a tubewell or hand-pump) in separate test tubes.\n- n Add a couple of drops of soap solution to both.\n- n Shake the test tubes vigorously for an equal period of time and observe the amount of foam formed.\n- n In which test tube do you get more foam?\n- n In which test tube do you observe a white curdy precipitate? *Note for the teacher* : If hard water is not available in your locality, prepare some hard water by dissolving hydrogencarbonates/ sulphates/chlorides of calcium or magnesium in water.\n\n### Activity 4.12\n\n- n Take two test tubes with about 10 mL of hard water in each.\n- n Add five drops of soap solution to one and five drops of detergent solution to the other.\n- n Shake both test tubes for the same period.\n- n Do both test tubes have the same amount of foam?\n- n In which test tube is a curdy solid formed?\n\nHave you ever observed while bathing that foam is formed with difficulty and an insoluble substance (scum) remains after washing with water? This is caused by the reaction of soap with the calcium and magnesium salts, which cause the hardness of water. Hence you need to use a larger amount of soap. This problem is overcome by using another class of compounds called detergents as cleansing agents. Detergents are generally sodium salts of sulphonic acids or ammonium salts with chlorides or bromides ions, etc. Both have long hydrocarbon chain. The charged ends of these compounds do not form insoluble precipitates with the calcium and magnesium ions in hard water. Thus, they remain effective in hard water. Detergents are usually used to make shampoos and products for cleaning clothes.\n\n### ? QUESTIONS 1. Would you be able to check if water is hard by using a detergent? 2. People use a variety of methods to wash clothes. Usually after adding the soap, they 'beat' the clothes on a stone, or beat it with a paddle, scrub with a brush or the mixture is agitated in a washing machine. Why is agitation necessary to get clean clothes?\n\n# What you have learnt\n\n- n Carbon is a versatile element that forms the basis for all living organisms and many of the things we use.\n- n This large variety of compounds is formed by carbon because of its tetravalency and the property of catenation that it exhibits.\n- n Covalent bonds are formed by the sharing of electrons between two atoms so that both can achieve a completely filled outermost shell.\n- n Carbon forms covalent bonds with itself and other elements such as hydrogen, oxygen, sulphur, nitrogen and chlorine.\n- n Carbon also forms compounds containing double and triple bonds between carbon atoms. These carbon chains may be in the form of straight chains, branched chains or rings.\n- n The ability of carbon to form chains gives rise to a homologous series of compounds in which the same functional group is attached to carbon chains of different lengths.\n- n The functional groups such as alcohols, aldehydes, ketones and carboxylic acids bestow characteristic properties to the carbon compounds that contain them.\n- n Carbon and its compounds are some of our major sources of fuels.\n- n Ethanol and ethanoic acid are carbon compounds of importance in our daily lives.\n- n The action of soaps and detergents is based on the presence of both hydrophobic and hydrophilic groups in the molecule and this helps to emulsify the oily dirt and hence its removal.\n\n# EXERCISES\n\n- 1. Ethane, with the molecular formula C2H<sup>6</sup> has\n  - (a) 6 covalent bonds.\n  - (b) 7 covalent bonds.\n  - (c) 8 covalent bonds.\n  - (d) 9 covalent bonds.\n- 2. Butanone is a four-carbon compound with the functional group\n  - (a) carboxylic acid.\n  - (b) aldehyde.\n  - (c) ketone.\n  - (d) alcohol.\n- 3. While cooking, if the bottom of the vessel is getting blackened on the outside, it means that\n  - (a) the food is not cooked completely.\n  - (b) the fuel is not burning completely.\n  - (c) the fuel is wet.\n  - (d) the fuel is burning completely.\n\n- 4. Explain the nature of the covalent bond using the bond formation in CH3Cl.\n- 5. Draw the electron dot structures for\n  - (a) ethanoic acid.\n  - (b) H<sup>2</sup> S.\n  - (c) propanone.\n  - (d) F2 .\n- 6. What is an homologous series? Explain with an example.\n- 7. How can ethanol and ethanoic acid be differentiated on the basis of their physical and chemical properties?\n- 8. Why does micelle formation take place when soap is added to water? Will a micelle be formed in other solvents such as ethanol also?\n- 9. Why are carbon and its compounds used as fuels for most applications?\n- 10. Explain the formation of scum when hard water is treated with soap.\n- 11. What change will you observe if you test soap with litmus paper (red and blue)?\n- 12. What is hydrogenation? What is its industrial application?\n- 13. Which of the following hydrocarbons undergo addition reactions: C2H<sup>6</sup> , C3H<sup>8</sup> , C3H<sup>6</sup> , C2H<sup>2</sup> and CH<sup>4</sup> .\n- 14. Give a test that can be used to differentiate between saturated and unsaturated hydrocarbons.\n- 15. Explain the mechanism of the cleaning action of soaps.\n\n# Group Activity\n\n- I Use molecular model kits to make models of the compounds you have learnt in this Chapter.\n- II n Take about 20 mL of castor oil/cotton seed oil/linseed oil/soyabean oil in a beaker. Add 30 mL of 20 % sodium hydroxide solution. Heat the mixture with continuous stirring for a few minutes till the mixture thickens. Add 5-10 g of common salt to this. Stir the mixture well and allow it to cool.\n  - n You can cut out the soap in fancy shapes. You can also add perfume to the soap before it sets.",
    "structured_data": {
      "error": "No structured data available"
    },
    "images": [
      {
        "name": "_page_0_Picture_0.jpeg",
        "path": "/home/content/converted_books/images/jesc104/_page_0_Picture_0.jpeg",
        "size_bytes": 38791,
        "description": "This image shows the title page for Chapter 4, titled \"Carbon and its Compounds,\" which features a molecular structure diagram of carbon atoms bonded together (likely representing diamond or graphite) and includes a QR code for additional digital resources. The chapter introduction sets up the study of carbon as an important element in both its pure form and in various compounds that are significant in our daily lives.",
        "description_generated_at": "2025-07-19 12:26:12"
      },
      {
        "name": "_page_2_Figure_0.jpeg",
        "path": "/home/content/converted_books/images/jesc104/_page_2_Figure_0.jpeg",
        "size_bytes": 15718,
        "description": "This diagram shows how two hydrogen atoms (each labeled \"H\" with an \"x\" representing their single electron) combine to form a hydrogen molecule (H₂) by sharing their electrons in the overlapping region between them. The image illustrates the concept of covalent bonding, where atoms share electrons to achieve stable electronic configurations, with the shared electrons clearly labeled in the overlapping area of the two atomic circles.",
        "description_generated_at": "2025-07-19 12:26:12"
      },
      {
        "name": "_page_2_Figure_2.jpeg",
        "path": "/home/content/converted_books/images/jesc104/_page_2_Figure_2.jpeg",
        "size_bytes": 6125,
        "description": "This diagram illustrates the formation of a hydrogen molecule (H₂) by showing two hydrogen atoms sharing their electrons in the overlapping region, with the equivalent representation H-H demonstrating how a single covalent bond is formed. The image serves as a visual example of electron sharing between atoms to achieve stable electronic configurations, which is fundamental to understanding covalent bonding in chemistry.",
        "description_generated_at": "2025-07-19 12:26:12"
      },
      {
        "name": "_page_2_Figure_4.jpeg",
        "path": "/home/content/converted_books/images/jesc104/_page_2_Figure_4.jpeg",
        "size_bytes": 17355,
        "description": "This diagram illustrates the formation of a double covalent bond in an oxygen molecule (O₂), showing two oxygen atoms sharing four electrons (two pairs) represented by X's in the overlapping region between the pink circles. The image demonstrates how each oxygen atom contributes electrons to form the double bond, with the chemical notation O=O shown below to represent this double bond structure.",
        "description_generated_at": "2025-07-19 12:26:12"
      },
      {
        "name": "_page_2_Figure_6.jpeg",
        "path": "/home/content/converted_books/images/jesc104/_page_2_Figure_6.jpeg",
        "size_bytes": 17608,
        "description": "This diagram illustrates the formation of a nitrogen molecule (N₂) through covalent bonding, showing how two nitrogen atoms share three pairs of electrons (represented by X's) to form a triple bond. The image demonstrates the electron dot structure and includes the simplified notation N≡N to represent the triple covalent bond between the nitrogen atoms.",
        "description_generated_at": "2025-07-19 12:26:12"
      },
      {
        "name": "_page_3_Picture_3.jpeg",
        "path": "/home/content/converted_books/images/jesc104/_page_3_Picture_3.jpeg",
        "size_bytes": 14464,
        "description": "This image shows the electron dot structure (Lewis structure) for methane (CH₄), illustrating how one carbon atom (shown in pink/red) shares electrons with four hydrogen atoms (shown in blue) through covalent bonding. The \"x\" symbols represent the shared electron pairs that form the covalent bonds between carbon and hydrogen atoms in this simple hydrocarbon molecule.",
        "description_generated_at": "2025-07-19 12:26:12"
      },
      {
        "name": "_page_3_Figure_5.jpeg",
        "path": "/home/content/converted_books/images/jesc104/_page_3_Figure_5.jpeg",
        "size_bytes": 62462,
        "description": "This diagram illustrates the molecular structures of three different allotropes of carbon: diamond (showing its rigid 3D tetrahedral structure), graphite (displaying its layered hexagonal structure), and buckminsterfullerene C-60 (resembling a soccer ball shape). The image helps students visualize how the same carbon atoms can arrange differently to create materials with vastly different properties, from diamond's hardness to graphite's slippery layers to fullerene's unique spherical form.",
        "description_generated_at": "2025-07-19 12:26:12"
      },
      {
        "name": "_page_5_Figure_9.jpeg",
        "path": "/home/content/converted_books/images/jesc104/_page_5_Figure_9.jpeg",
        "size_bytes": 7708,
        "description": "This image shows a simple structural diagram of two carbon atoms connected by a single covalent bond (C—C), representing the first step in building the molecular structure of ethane. The diagram illustrates the basic carbon-carbon backbone before hydrogen atoms are added to satisfy the remaining valencies of each carbon atom.",
        "description_generated_at": "2025-07-19 12:26:12"
      },
      {
        "name": "_page_5_Figure_11.jpeg",
        "path": "/home/content/converted_books/images/jesc104/_page_5_Figure_11.jpeg",
        "size_bytes": 4594,
        "description": "This image shows the structural formula of ethane (C₂H₆), displaying two carbon atoms connected by a single bond with each carbon atom bonded to three hydrogen atoms. The diagram illustrates Step 2 in building the ethane molecule, demonstrating how all valencies of the carbon atoms are satisfied by single bonds to complete this saturated hydrocarbon structure.",
        "description_generated_at": "2025-07-19 12:26:12"
      },
      {
        "name": "_page_5_Picture_19.jpeg",
        "path": "/home/content/converted_books/images/jesc104/_page_5_Picture_19.jpeg",
        "size_bytes": 23561,
        "description": "This diagram shows the electron dot structure of ethene (C₂H₄), illustrating how two carbon atoms are connected by a double bond with hydrogen atoms attached to satisfy all valencies. The overlapping circles represent the shared electron pairs, demonstrating why ethene is classified as an unsaturated hydrocarbon due to its carbon-carbon double bond.",
        "description_generated_at": "2025-07-19 12:26:12"
      },
      {
        "name": "_page_5_Figure_21.jpeg",
        "path": "/home/content/converted_books/images/jesc104/_page_5_Figure_21.jpeg",
        "size_bytes": 7500,
        "description": "This diagram illustrates the step-by-step process of drawing the molecular structure of ethene (C₂H₄), showing how two carbon atoms are first connected and then hydrogen atoms are added to satisfy the valency requirements. The image demonstrates the formation of a double bond between carbon atoms when single bonds are insufficient to complete the molecular structure.",
        "description_generated_at": "2025-07-19 12:26:12"
      },
      {
        "name": "_page_6_Picture_0.jpeg",
        "path": "/home/content/converted_books/images/jesc104/_page_6_Picture_0.jpeg",
        "size_bytes": 18800,
        "description": "This image shows the electron dot structure of ethene (C₂H₄), illustrating how two carbon atoms share electrons through a double bond while each carbon is also bonded to two hydrogen atoms. The diagram uses circles to represent atoms and X marks to show the shared electrons, demonstrating how carbon atoms can form multiple bonds to satisfy their valency requirements in unsaturated compounds.",
        "description_generated_at": "2025-07-19 12:26:12"
      },
      {
        "name": "_page_6_Figure_5.jpeg",
        "path": "/home/content/converted_books/images/jesc104/_page_6_Figure_5.jpeg",
        "size_bytes": 11111,
        "description": "This image shows Table 4.2, which displays the formulae and structures of saturated carbon and hydrogen compounds (alkanes) from methane to hexane. The table lists the number of carbon atoms, compound names, molecular formulas, and their corresponding structural representations for the first six members of the alkane series.",
        "description_generated_at": "2025-07-19 12:26:12"
      },
      {
        "name": "_page_7_Picture_2.jpeg",
        "path": "/home/content/converted_books/images/jesc104/_page_7_Picture_2.jpeg",
        "size_bytes": 1565,
        "description": "This image shows a simple molecular diagram illustrating a branched carbon skeleton structure with three carbon atoms arranged in a Y-shape, where one carbon atom branches off from a main chain of two carbon atoms. This diagram demonstrates the concept of branched carbon chains in organic chemistry, specifically showing an alternative structural arrangement for carbon atoms beyond the typical straight-chain formation.",
        "description_generated_at": "2025-07-19 12:26:12"
      },
      {
        "name": "_page_7_Figure_5.jpeg",
        "path": "/home/content/converted_books/images/jesc104/_page_7_Figure_5.jpeg",
        "size_bytes": 12167,
        "description": "This image shows two different structural arrangements of butane (C₄H₁₀) molecules - a straight-chain structure on the left and a branched-chain structure on the right, both with all hydrogen atoms explicitly drawn. These diagrams illustrate the concept of structural isomers, which are compounds that have the same molecular formula but different arrangements of atoms.",
        "description_generated_at": "2025-07-19 12:26:12"
      },
      {
        "name": "_page_7_Figure_9.jpeg",
        "path": "/home/content/converted_books/images/jesc104/_page_7_Figure_9.jpeg",
        "size_bytes": 15187,
        "description": "This image shows two representations of cyclohexane (C₆H₁₂): (a) a simplified ring structure showing only the carbon atoms connected in a hexagonal cycle, and (b) the complete structural formula with all hydrogen atoms attached to each carbon atom. The diagram illustrates how carbon atoms can form cyclic (ring-shaped) compounds in addition to straight and branched chains.",
        "description_generated_at": "2025-07-19 12:26:12"
      },
      {
        "name": "_page_7_Figure_10.jpeg",
        "path": "/home/content/converted_books/images/jesc104/_page_7_Figure_10.jpeg",
        "size_bytes": 10240,
        "description": "This image shows the structure of cyclohexane in two parts: (a) the carbon skeleton displaying six carbon atoms arranged in a hexagonal ring, and (b) the complete molecule with all hydrogen atoms added to show the full C₆H₁₂ structure. The diagram illustrates how carbon atoms can form cyclic (ring-shaped) compounds in addition to straight and branched chains.",
        "description_generated_at": "2025-07-19 12:26:12"
      },
      {
        "name": "_page_7_Figure_12.jpeg",
        "path": "/home/content/converted_books/images/jesc104/_page_7_Figure_12.jpeg",
        "size_bytes": 10095,
        "description": "This image shows the structural diagram of benzene (C₆H₆), displaying six carbon atoms arranged in a hexagonal ring with alternating single and double bonds, and one hydrogen atom attached to each carbon. The diagram illustrates an example of an unsaturated cyclic hydrocarbon, demonstrating how carbon atoms can form ring structures with delocalized electrons.",
        "description_generated_at": "2025-07-19 12:26:12"
      },
      {
        "name": "_page_11_Figure_0.jpeg",
        "path": "/home/content/converted_books/images/jesc104/_page_11_Figure_0.jpeg",
        "size_bytes": 48059,
        "description": "This image shows practice questions from a chemistry textbook that ask students to draw molecular structures for organic compounds (like ethanoic acid, butanone, and hexanal) and to name given chemical structures using proper nomenclature rules. The questions are designed to help students apply their knowledge of carbon compound naming conventions and structural formulas that were covered in the preceding text.",
        "description_generated_at": "2025-07-19 12:26:12"
      },
      {
        "name": "_page_13_Picture_5.jpeg",
        "path": "/home/content/converted_books/images/jesc104/_page_13_Picture_5.jpeg",
        "size_bytes": 9473,
        "description": "This diagram illustrates an addition reaction where an unsaturated hydrocarbon (with a C=C double bond) reacts with hydrogen gas (H₂) in the presence of a nickel catalyst to form a saturated hydrocarbon (with single C-C bonds). The image demonstrates the hydrogenation process mentioned in the text, showing how the double bond is broken and hydrogen atoms are added to create a saturated compound.",
        "description_generated_at": "2025-07-19 12:26:12"
      },
      {
        "name": "_page_13_Figure_10.jpeg",
        "path": "/home/content/converted_books/images/jesc104/_page_13_Figure_10.jpeg",
        "size_bytes": 47621,
        "description": "This image shows a \"Questions\" section from the textbook containing two practice questions about carbon compounds. The questions ask students to explain why the conversion of ethanol to ethanoic acid is an oxidation reaction and why oxygen-ethyne mixtures are used for welding instead of air-ethyne mixtures, helping students apply their knowledge of carbon compound reactions and properties.",
        "description_generated_at": "2025-07-19 12:26:12"
      },
      {
        "name": "_page_15_Figure_19.jpeg",
        "path": "/home/content/converted_books/images/jesc104/_page_15_Figure_19.jpeg",
        "size_bytes": 27769,
        "description": "This diagram shows a laboratory setup for ester formation, featuring a test tube containing the reaction mixture suspended in a beaker of water and heated by a Bunsen burner on a tripod stand. The setup demonstrates the experimental procedure for synthesizing esters from carboxylic acids and alcohols using gentle heating in a water bath.",
        "description_generated_at": "2025-07-19 12:26:12"
      },
      {
        "name": "_page_16_Picture_16.jpeg",
        "path": "/home/content/converted_books/images/jesc104/_page_16_Picture_16.jpeg",
        "size_bytes": 29019,
        "description": "This diagram illustrates how soap molecules arrange themselves around an oil droplet to form a micelle structure. The soap molecules have hydrophilic (water-loving) heads containing Na+ ions that face outward toward the water, while their hydrophobic (water-repelling) zigzag tails point inward toward the central oil droplet, demonstrating the basic mechanism of how soap helps clean oily substances.",
        "description_generated_at": "2025-07-19 12:26:12"
      },
      {
        "name": "_page_16_Figure_17.jpeg",
        "path": "/home/content/converted_books/images/jesc104/_page_16_Figure_17.jpeg",
        "size_bytes": 4730,
        "description": "This image shows a diagram illustrating the formation of micelles, which are spherical structures formed by soap molecules in water. The diagram demonstrates how soap molecules arrange themselves with their hydrophobic (water-repelling) tails pointing inward and hydrophilic (water-loving) heads pointing outward, which is essential for understanding how soaps work to clean oily substances.",
        "description_generated_at": "2025-07-19 12:26:12"
      },
      {
        "name": "_page_17_Figure_2.jpeg",
        "path": "/home/content/converted_books/images/jesc104/_page_17_Figure_2.jpeg",
        "size_bytes": 263301,
        "description": "This diagram illustrates how soap works to clean dirt and grease by showing the step-by-step formation of micelles - spherical structures where soap molecules surround oil/dirt with their hydrophobic tails pointing inward and hydrophilic ends facing outward toward the water. The image demonstrates the cleaning mechanism of soap, explaining how it can remove oily substances that normally don't dissolve in water by forming these special molecular arrangements called micelles.",
        "description_generated_at": "2025-07-19 12:26:12"
      }
    ],
    "exercises": [
      {
        "question": "Make a list of ten things you have used or consumed since the morning. Compile this list with the lists made by your classmates and then sort the items into the table with columns: Things made of metal, Things made of glass/clay, Others.",
        "answer": "This activity helps identify carbon-based compounds in daily life. Examples for each column: Things made of metal - spoon, knife, water bottle, pen cap, scissors; Things made of glass/clay - drinking glass, ceramic plate, mirror, window pane, flower pot; Others - food items (bread, rice, fruits), clothes (cotton shirt, synthetic fabric), books, plastic items, medicines, cosmetics. Most items in the 'Others' column contain carbon compounds, as they are derived from organic materials or synthetic polymers based on carbon."
      },
      {
        "question": "What would be the electron dot structure of carbon dioxide which has the formula CO₂?",
        "answer": "Carbon dioxide (CO₂) has a linear structure with carbon in the center forming double bonds with two oxygen atoms. The electron dot structure shows: O=C=O. Carbon has 4 valence electrons and needs 4 more to complete its octet. Each oxygen has 6 valence electrons and needs 2 more. Carbon shares 2 electrons with each oxygen atom, forming two double bonds. This satisfies the octet rule for all atoms - carbon gets 8 electrons (4 shared pairs) and each oxygen gets 8 electrons (2 shared pairs with carbon plus 2 lone pairs)."
      },
      {
        "question": "What would be the electron dot structure of a molecule of sulphur which is made up of eight atoms of sulphur?",
        "answer": "Sulphur forms an eight-membered ring structure (S₈). Each sulphur atom has 6 valence electrons and forms two single bonds with adjacent sulphur atoms in the ring. The electron dot structure shows a crown-shaped ring where each sulphur atom is bonded to two other sulphur atoms, with each sulphur having two lone pairs of electrons. This arrangement allows each sulphur atom to achieve a stable electron configuration while forming the characteristic S₈ ring structure found in solid sulphur."
      },
      {
        "question": "How many structural isomers can you draw for pentane?",
        "answer": "Pentane (C₅H₁₂) has three structural isomers: 1) n-pentane: CH₃-CH₂-CH₂-CH₂-CH₃ (straight chain), 2) 2-methylbutane (isopentane): CH₃-CH(CH₃)-CH₂-CH₃ (branched with methyl group on second carbon), 3) 2,2-dimethylpropane (neopentane): (CH₃)₄C (highly branched with central carbon bonded to four methyl groups). These isomers have the same molecular formula but different structural arrangements, leading to different physical and chemical properties."
      },
      {
        "question": "What are the two properties of carbon which lead to the huge number of carbon compounds we see around us?",
        "answer": "The two key properties are: 1) Catenation - Carbon's unique ability to form strong covalent bonds with other carbon atoms, creating long chains, branched structures, and rings. This property is stronger in carbon than any other element due to the small size of carbon atoms and the strength of C-C bonds. 2) Tetravalency - Carbon has 4 valence electrons, allowing it to form 4 covalent bonds with other carbon atoms or different elements like hydrogen, oxygen, nitrogen, sulfur, and halogens. These properties together enable carbon to form millions of different compounds with varying chain lengths, branching patterns, and functional groups."
      },
      {
        "question": "What will be the formula and electron dot structure of cyclopentane?",
        "answer": "Cyclopentane has the molecular formula C₅H₁₀. It consists of 5 carbon atoms arranged in a ring structure, with each carbon atom bonded to two other carbon atoms and two hydrogen atoms. The electron dot structure shows a pentagon-shaped ring where each carbon forms single bonds with its two neighboring carbons and two hydrogen atoms, satisfying carbon's tetravalency. Each carbon atom shares one electron pair with each of its neighbors and one electron pair with each of its two hydrogen atoms."
      },
      {
        "question": "Calculate the difference in the formulae and molecular masses for (a) CH₃OH and C₂H₅OH (b) C₂H₅OH and C₃H₇OH, and (c) C₃H₇OH and C₄H₉OH.",
        "answer": "For each pair: (a) CH₃OH (32 u) and C₂H₅OH (46 u): Difference = CH₂ unit, mass difference = 14 u; (b) C₂H₅OH (46 u) and C₃H₇OH (60 u): Difference = CH₂ unit, mass difference = 14 u; (c) C₃H₇OH (60 u) and C₄H₉OH (74 u): Difference = CH₂ unit, mass difference = 14 u. All three pairs differ by exactly one CH₂ unit and 14 u in molecular mass. This consistent difference of CH₂ units is characteristic of a homologous series, where successive members differ by the same structural unit."
      },
      {
        "question": "Ethane, with the molecular formula C₂H₆ has (a) 6 covalent bonds (b) 7 covalent bonds (c) 8 covalent bonds (d) 9 covalent bonds.",
        "answer": "The correct answer is (b) 7 covalent bonds. In ethane (C₂H₆), there is 1 C-C bond between the two carbon atoms and 6 C-H bonds (3 hydrogen atoms bonded to each carbon atom). Total covalent bonds = 1 + 6 = 7. The structure is H₃C-CH₃, where each line represents a covalent bond formed by sharing of electron pairs."
      },
      {
        "question": "Butanone is a four-carbon compound with the functional group (a) carboxylic acid (b) aldehyde (c) ketone (d) alcohol.",
        "answer": "The correct answer is (c) ketone. Butanone (also called methyl ethyl ketone) has the structure CH₃-CO-CH₂-CH₃, where the carbonyl group (C=O) is attached to two carbon atoms. This C=O group bonded to two carbon atoms is characteristic of ketones. The suffix '-one' in butanone also indicates the ketone functional group. If it were an aldehyde, it would be called butanal; if alcohol, it would be butanol; if carboxylic acid, it would be butanoic acid."
      },
      {
        "question": "While cooking, if the bottom of the vessel is getting blackened on the outside, it means that (a) the food is not cooked completely (b) the fuel is not burning completely (c) the fuel is wet (d) the fuel is burning completely.",
        "answer": "The correct answer is (b) the fuel is not burning completely. When fuel undergoes incomplete combustion due to insufficient oxygen supply, it produces carbon particles (soot) that deposit on the vessel bottom, causing blackening. This indicates that air holes in the stove may be blocked, preventing proper air-fuel mixing. Complete combustion would produce only CO₂ and water vapor, leaving no black residue. This blackening also means fuel is being wasted as not all chemical energy is being released."
      },
      {
        "question": "Explain the nature of the covalent bond using the bond formation in CH₃Cl.",
        "answer": "In CH₃Cl (methyl chloride), carbon forms covalent bonds by sharing electrons. Carbon has 4 valence electrons and needs 4 more for stability. It shares 1 electron each with 3 hydrogen atoms (each having 1 valence electron) and 1 electron with chlorine (which has 7 valence electrons and needs 1 more). This results in 4 covalent bonds: 3 C-H bonds and 1 C-Cl bond. Each covalent bond consists of a shared pair of electrons that belongs to both atoms involved, allowing all atoms to achieve stable electronic configurations. The C-Cl bond is polar due to chlorine's higher electronegativity."
      },
      {
        "question": "Draw the electron dot structures for (a) ethanoic acid (b) H₂S (c) propanone (d) F₂.",
        "answer": "(a) Ethanoic acid (CH₃COOH): Shows carbon-carbon single bond, carbon-oxygen double bond, and O-H bond in carboxyl group; (b) H₂S: Sulfur in center with 6 valence electrons, bonded to 2 hydrogen atoms, with 2 lone pairs on sulfur; (c) Propanone (CH₃COCH₃): Three carbon atoms with central carbon double-bonded to oxygen (carbonyl group), and two methyl groups attached; (d) F₂: Two fluorine atoms each with 7 valence electrons sharing one pair to form F-F bond, with 3 lone pairs on each fluorine atom."
      },
      {
        "question": "What is an homologous series? Explain with an example.",
        "answer": "A homologous series is a group of organic compounds with the same functional group and similar chemical properties, where successive members differ by a CH₂ unit. Members show gradation in physical properties like melting point, boiling point, and solubility. Example: Alkane series - methane (CH₄), ethane (C₂H₆), propane (C₃H₈), butane (C₄H₁₀). Each successive member differs by CH₂ and 14u in molecular mass. They have similar chemical properties (combustion, substitution reactions) but different physical properties (increasing boiling points). General formula for alkanes is CₙH₂ₙ₊₂."
      },
      {
        "question": "How can ethanol and ethanoic acid be differentiated on the basis of their physical and chemical properties?",
        "answer": "Physical properties: Ethanol is liquid at room temperature with characteristic alcoholic odor; ethanoic acid has vinegar-like pungent smell and freezes at 290K (glacial acetic acid). Chemical properties: (1) Litmus test - ethanoic acid turns blue litmus red (acidic), ethanol shows no change (neutral); (2) Sodium carbonate test - ethanoic acid produces CO₂ gas with effervescence, ethanol shows no reaction; (3) Sodium metal test - both produce H₂ gas, but ethanol produces sodium ethoxide while acid produces sodium ethanoate; (4) pH test - ethanoic acid shows acidic pH (~3-4), ethanol shows neutral pH (~7)."
      },
      {
        "question": "Why does micelle formation take place when soap is added to water? Will a micelle be formed in other solvents such as ethanol also?",
        "answer": "Micelle formation occurs because soap molecules have dual nature - hydrophilic (water-loving) ionic head and hydrophobic (water-hating) hydrocarbon tail. In water, soap molecules arrange themselves with hydrophilic heads facing outward toward water and hydrophobic tails pointing inward, forming spherical structures called micelles. This arrangement minimizes contact between hydrophobic tails and water. In ethanol, micelles would not form in the same way because ethanol can dissolve both polar and non-polar parts of soap molecules, so there's no driving force for the special arrangement. However, reverse micelles might form in non-polar solvents where polar heads cluster inside."
      },
      {
        "question": "Why are carbon and its compounds used as fuels for most applications?",
        "answer": "Carbon and its compounds are preferred fuels because: (1) High energy content - they release large amounts of heat and light energy upon combustion due to strong C-C and C-H bonds; (2) Complete combustion produces only CO₂ and water vapor, which are relatively less harmful; (3) Easy availability - found abundantly as coal, petroleum, natural gas, and biomass; (4) Easy handling and storage - many are liquids or gases at room temperature; (5) Controllable combustion - burning rate can be easily controlled; (6) Cost-effective - relatively inexpensive to extract and process; (7) High calorific value - provide more energy per unit mass compared to many other materials."
      },
      {
        "question": "Explain the formation of scum when hard water is treated with soap.",
        "answer": "Scum formation occurs when soap reacts with calcium and magnesium ions present in hard water. Soap molecules (sodium stearate: C₁₇H₃₅COONa) react with Ca²⁺ and Mg²⁺ ions to form insoluble precipitates: 2C₁₇H₃₅COONa + Ca²⁺ → (C₁₇H₃₅COO)₂Ca + 2Na⁺. The calcium and magnesium salts of fatty acids are insoluble in water and appear as white curdy precipitate called scum. This reduces soap's cleaning efficiency as soap molecules are consumed in precipitation rather than cleaning. More soap is needed in hard water, and the scum can stick to clothes and surfaces, making them appear dull and dirty."
      },
      {
        "question": "What change will you observe if you test soap with litmus paper (red and blue)?",
        "answer": "Soap solution is basic in nature, so it will: (1) Turn red litmus paper blue - indicating basic/alkaline nature; (2) Blue litmus paper will remain blue - as bases don't change blue litmus. This happens because soaps are sodium or potassium salts of long-chain fatty acids. When dissolved in water, they undergo hydrolysis: C₁₇H₃₅COONa + H₂O → C₁₇H₃₅COOH + NaOH. The NaOH formed makes the solution basic with pH around 8-9. This basic nature also helps in cleaning as it can neutralize acidic dirt and grease."
      },
      {
        "question": "What is hydrogenation? What is its industrial application?",
        "answer": "Hydrogenation is the addition of hydrogen gas to unsaturated hydrocarbons (containing C=C or C≡C bonds) in the presence of catalysts like nickel or palladium to form saturated compounds. Example: C₂H₄ + H₂ → C₂H₆ (Ni catalyst). Industrial applications: (1) Vegetable oil hydrogenation - converts liquid unsaturated oils to solid or semi-solid fats (margarine, vanaspati); (2) Food industry - improves shelf life and texture of products; (3) Petroleum refining - converts heavy oils to lighter fractions; (4) Production of ammonia in Haber process; (5) Manufacturing of methanol and other chemicals. This process is important for food preservation and creating desired physical properties in fats."
      },
      {
        "question": "Which of the following hydrocarbons undergo addition reactions: C₂H₆, C₃H₈, C₃H₆, C₂H₂ and CH₄.",
        "answer": "C₃H₆ (propene) and C₂H₂ (ethyne) undergo addition reactions. These are unsaturated hydrocarbons containing double and triple bonds respectively. Unsaturated compounds readily undergo addition reactions where atoms or groups add across the multiple bonds without elimination of any atom. Examples: C₃H₆ + H₂ → C₃H₈ (hydrogenation); C₂H₂ + Br₂ → C₂H₂Br₂ (bromination). The other compounds - C₂H₆ (ethane), C₃H₈ (propane), and CH₄ (methane) - are saturated hydrocarbons with only single bonds, so they undergo substitution reactions instead of addition reactions."
      },
      {
        "question": "Give a test that can be used to differentiate between saturated and unsaturated hydrocarbons.",
        "answer": "Bromine water test: Add bromine water (orange/brown colored) to the hydrocarbon sample. (1) Unsaturated hydrocarbons (alkenes/alkynes) will decolorize bromine water rapidly due to addition reaction across the double/triple bond. Example: C₂H₄ + Br₂ → C₂H₄Br₂ (colorless); (2) Saturated hydrocarbons (alkanes) will not decolorize bromine water under normal conditions as they don't have multiple bonds for addition reactions. Alternative test: Alkaline KMnO₄ test - unsaturated compounds decolorize purple KMnO₄ solution, while saturated compounds don't react under mild conditions."
      },
      {
        "question": "Explain the mechanism of the cleaning action of soaps.",
        "answer": "Soap molecules have amphiphilic structure - hydrophilic (polar) head and hydrophobic (non-polar) tail. Cleaning mechanism: (1) When soap is added to water containing oily dirt, soap molecules orient with hydrophobic tails toward oil and hydrophilic heads toward water; (2) Multiple soap molecules surround each oil droplet forming micelles - spherical structures with oil trapped inside and ionic heads facing outward; (3) This creates stable emulsion of oil in water; (4) Mechanical agitation (scrubbing) helps break down larger oil particles and distribute soap molecules; (5) Oil droplets surrounded by soap micelles are lifted away from the surface and suspended in water; (6) Rinsing removes the emulsified oil-soap mixture, leaving the surface clean."
      },
      {
        "question": "How would you distinguish experimentally between an alcohol and a carboxylic acid?",
        "answer": "Several tests can distinguish alcohols from carboxylic acids: (1) Litmus test - carboxylic acids turn blue litmus red (acidic), alcohols show no change (neutral); (2) Sodium carbonate test - carboxylic acids react with Na₂CO₃ producing CO₂ gas with effervescence, alcohols don't react; (3) pH test - carboxylic acids show acidic pH (3-5), alcohols show neutral pH (~7); (4) Sodium metal test - both produce H₂, but acids form sodium carboxylate salts while alcohols form alkoxides; (5) Ester formation - both react with acids/alcohols respectively to form sweet-smelling esters, but reaction conditions differ."
      },
      {
        "question": "What are oxidising agents?",
        "answer": "Oxidising agents are substances that can add oxygen to other substances or remove hydrogen from them, while themselves getting reduced in the process. They cause oxidation of other substances. Examples: (1) Alkaline potassium permanganate (KMnO₄) - purple color disappears when it oxidizes other substances; (2) Acidified potassium dichromate (K₂Cr₂O₇) - orange color changes to green when acting as oxidizing agent; (3) Oxygen gas - most common oxidizing agent in combustion reactions. These agents are used to convert alcohols to carboxylic acids, in bleaching, disinfection, and various industrial processes. The oxidizing agent itself gets reduced while oxidizing other substances."
      },
      {
        "question": "Would you be able to check if water is hard by using a detergent?",
        "answer": "No, you cannot effectively check if water is hard using detergent. Detergents work equally well in both hard and soft water because they don't form insoluble precipitates with calcium and magnesium ions present in hard water. Unlike soaps, which form scum (insoluble precipitates) with Ca²⁺ and Mg²⁺ ions and produce less foam in hard water, detergents maintain their cleaning action and foam formation regardless of water hardness. To test water hardness, soap solution is used - hard water produces less foam and forms white curdy precipitate (scum), while soft water produces abundant foam without precipitation."
      },
      {
        "question": "People use a variety of methods to wash clothes. Usually after adding the soap, they 'beat' the clothes on a stone, or beat it with a paddle, scrub with a brush or the mixture is agitated in a washing machine. Why is agitation necessary to get clean clothes?",
        "answer": "Agitation is necessary because: (1) Micelle formation - mechanical action helps soap molecules surround and emulsify oil/dirt particles more effectively; (2) Breaking down dirt - physical agitation breaks larger dirt particles into smaller ones, increasing surface area for soap action; (3) Distribution - ensures uniform distribution of soap solution through fabric fibers; (4) Loosening grip - helps loosen dirt particles that are mechanically stuck to fabric; (5) Enhanced contact - increases contact between soap molecules and dirt, improving cleaning efficiency; (6) Removal of emulsified dirt - helps lift away the oil-soap micelles from fabric surface; (7) Penetration - forces soap solution into fabric pores where dirt may be trapped. Without agitation, soap alone cannot effectively remove all types of dirt and stains."
      }
    ],
    "summary": {
      "title": "Carbon and its Compounds",
      "key_concepts": [
        "Covalent bonding and carbon's unique properties of catenation and tetravalency",
        "Types of carbon compounds: saturated and unsaturated hydrocarbons, homologous series",
        "Functional groups and their properties (alcohols, carboxylic acids, etc.)",
        "Chemical reactions of carbon compounds: combustion, oxidation, addition, and substitution",
        "Important carbon compounds: ethanol and ethanoic acid with their properties and reactions",
        "Soaps and detergents: structure, cleaning mechanism, and behavior in hard water"
      ],
      "summary": "This chapter explores carbon as a versatile element that forms millions of compounds due to its unique properties of tetravalency and catenation. It covers the nature of covalent bonding, different types of carbon compounds including saturated and unsaturated hydrocarbons, and the concept of homologous series. The chapter discusses various functional groups and their characteristic properties, along with important chemical reactions like combustion, oxidation, addition, and substitution. Special attention is given to ethanol and ethanoic acid as commercially important compounds, detailing their properties and reactions. The chapter concludes with the study of soaps and detergents, explaining their molecular structure and cleaning mechanism through micelle formation."
    }
  },
  "statistics": {
    "total_images": 25,
    "text_length": 46608,
    "processing_time": 35.5
  },
  "claude_processing": {
    "processed_at": "2025-07-19 12:26:12",
    "model_used": "claude-sonnet-4-20250514",
    "tasks_completed": [
      "exercises",
      "answers",
      "summary",
      "image_descriptions"
    ],
    "exercises_count": 26,
    "images_processed": 25
  }
}