{
  "source_file": "/home/content/books/science/jesc101.pdf",
  "filename": "jesc101.pdf",
  "subject": "science",
  "conversion_timestamp": "2025-07-18T12:06:53.429671",
  "processing_time_seconds": 23.54,
  "metadata": "md",
  "content": {
    "markdown_text": "*\"Facts are not science — as the dictionary is not literature.\" Martin H. Fischer*\n\n![](_page_0_Picture_1.jpeg)\n\n![](_page_0_Picture_2.jpeg)\n\nC onsider the following situations of daily life and think what happens when –\n\n- n milk is left at room temperature during summers.\n- n an iron tawa/pan/nail is left exposed to humid atmosphere.\n- n grapes get fermented.\n- n food is cooked.\n- n food gets digested in our body.\n- n we respire.\n\nIn all the above situations, the nature and the identity of the initial substance have somewhat changed. We have already learnt about physical and chemical changes of matter in our previous classes. Whenever a chemical change occurs, we can say that a chemical reaction has taken place.\n\nYou may perhaps be wondering as to what is actually meant by a chemical reaction. How do we come to know that a chemical reaction has taken place? Let us perform some activities to find the answer to these questions.\n\n## Activity 1.1\n\nCAUTION: This Activity needs the teacher's assistance. It would be better if students wear suitable eyeglasses.\n\n- n Clean a magnesium ribbon about 3-4 cm long by rubbing it with sandpaper.\n- n Hold it with a pair of tongs. Burn it using a spirit lamp or burner and collect the ash so formed in a watch-glass as shown in Fig. 1.1. Burn the magnesium ribbon keeping it away as far as possible from your eyes.\n- n What do you observe?\n\n![](_page_0_Figure_17.jpeg)\n\n#### *Figure 1.1 Burning of a magnesium ribbon in air and collection of magnesium oxide in a watch-glass*\n\nYou must have observed that magnesium ribbon burns with a dazzling white flame and changes into a white powder. This powder is magnesium oxide. It is formed due to the reaction between magnesium and oxygen present in the air.\n\n### Activity 1.2\n\n- n Take lead nitrate solution in a test tube.\n- n Add potassium iodide solution to this.\n- n What do you observe?\n\n![](_page_1_Figure_5.jpeg)\n\n## Activity 1.3\n\n- n Take a few zinc granules in a conical flask or a test tube.\n- n Add dilute hydrochloric acid or sulphuric acid to this (Fig. 1.2).\n- CAUTION: Handle the acid with care.\n- n Do you observe anything happening around the zinc granules?\n- n Touch the conical flask or test tube. Is there any change in its temperature?\n\nFrom the above three activities, we can say that any of the following observations helps us to determine whether a chemical reaction has taken place –\n\n- n change in state\n- n change in colour\n- n evolution of a gas\n- n change in temperature.\n\nAs we observe the changes around us, we can see that there is a large variety of chemical reactions taking place around us. We will study about the various types of chemical reactions and their symbolic representation in this Chapter.\n\n## 1.1 CHEMICAL EQUA AL EQUATIONS\n\nActivity 1.1 can be described as – when a magnesium ribbon is burnt in oxygen, it gets converted to magnesium oxide. This description of a chemical reaction in a sentence form is quite long. It can be written in a shorter form. The simplest way to do this is to write it in the form of a word-equation.\n\nThe word-equation for the above reaction would be –\n\n$$\nMagnesium + Oxygen \\rightarrow Magnesium oxide\n$$\n (1.1)  \n(\n$$\n(Readants)\n$$\n (Product)\n\nThe substances that undergo chemical change in the reaction (1.1), magnesium and oxygen, are the reactants. The new substance is magnesium oxide, formed during the reaction, as a product.\n\nA word-equation shows change of reactants to products through an arrow placed between them. The reactants are written on the left-hand side (LHS) with a plus sign (+) between them. Similarly, products are written on the right-hand side (RHS) with a plus sign (+) between them. The arrowhead points towards the products, and shows the direction of the reaction.\n\n#### *Figure 1.2*\n\n*Formation of hydrogen gas by the action of dilute sulphuric acid on zinc*\n\n### 1.1.1 Writing a Chemical Equation\n\nIs there any other shorter way for representing chemical equations? Chemical equations can be made more concise and useful if we use chemical formulae instead of words. A chemical equation represents a chemical reaction. If you recall formulae of magnesium, oxygen and magnesium oxide, the above word-equation can be written as –\n\n$$\nMg + O_2 \\rightarrow MgO \\tag{1.2}\n$$\n\nCount and compare the number of atoms of each element on the LHS and RHS of the arrow. Is the number of atoms of each element the same on both the sides? If yes, then the equation is balanced. If not, then the equation is unbalanced because the mass is not the same on both sides of the equation. Such a chemical equation is a skeletal chemical equation for a reaction. Equation (1.2) is a skeletal chemical equation for the burning of magnesium in air.\n\n#### 1.1.2 Balanced Chemical Equations\n\nRecall the law of conservation of mass that you studied in Class IX; mass can neither be created nor destroyed in a chemical reaction. That is, the total mass of the elements present in the products of a chemical reaction has to be equal to the total mass of the elements present in the reactants.\n\nIn other words, the number of atoms of each element remains the same, before and after a chemical reaction. Hence, we need to balance a skeletal chemical equation. Is the chemical Eq. (1.2) balanced? Let us learn about balancing a chemical equation step by step.\n\nThe word-equation for Activity 1.3 may be represented as –\n\n```\nZinc + Sulphuric acid → Zinc sulphate + Hydrogen\n```\n\nThe above word-equation may be represented by the following chemical equation –\n\n#### Zn + H<sup>2</sup> SO<sup>4</sup> <sup>→</sup> ZnSO<sup>4</sup> + H<sup>2</sup>\n\nLet us examine the number of atoms of different elements on both sides of the arrow.\n\n| Element | Number of atoms in<br>reactants (LHS) | Number of atoms<br>in products (RHS) |\n|---------|---------------------------------------|--------------------------------------|\n| Zn      | 1                                     | 1                                    |\n| H       | 2                                     | 2                                    |\n| S       | 1                                     | 1                                    |\n| O       | 4                                     | 4                                    |\n\nAs the number of atoms of each element is the same on both sides of the arrow, Eq. (1.3) is a balanced chemical equation.\n\nLet us try to balance the following chemical equation –\n\nFe + H2O → Fe3O<sup>4</sup> + H<sup>2</sup>\n\n(1.4)\n\n(1.3)\n\nStep I: To balance a chemical equation, first draw boxes around each formula. Do not change anything inside the boxes while balancing the equation.\n\n$$\n\\boxed{\\text{Fe}} + \\boxed{\\text{H}_2\\text{O}} \\rightarrow \\boxed{\\text{Fe}_3\\text{O}_4} + \\boxed{\\text{H}_2} \\tag{1.5}\n$$\n\nStep II: List the number of atoms of different elements present in the unbalanced equation (1.5).\n\n| Element | Number of atoms<br>in reactants (LHS) | Number of atoms<br>in products (RHS) |\n|---------|---------------------------------------|--------------------------------------|\n| Fe      | 1                                     | 3                                    |\n| H       | 2                                     | 2                                    |\n| O       | 1                                     | 4                                    |\n\nStep III: It is often convenient to start balancing with the compound that contains the maximum number of atoms. It may be a reactant or a product. In that compound, select the element which has the maximum number of atoms. Using these criteria, we select Fe3O<sup>4</sup> and the element oxygen in it. There are four oxygen atoms on the RHS and only one on the LHS.\n\nTo balance the oxygen atoms –\n\n| Atoms of<br>oxygen                   | In reactants      | In products           |  |\n|--------------------------------------|-------------------|-----------------------|--|\n| (i)<br>Initial<br>(ii)<br>To balance | 1 (in H2O)<br>1×4 | 4 (in Fe3O4<br>)<br>4 |  |\n\nTo equalise the number of atoms, it must be remembered that we cannot alter the formulae of the compounds or elements involved in the reactions. For example, to balance oxygen atoms we can put coefficient '4' as 4 H2O and not H2O<sup>4</sup> or (H2O)<sup>4</sup> . Now the partly balanced equation becomes –\n\n$$\n\\overline{Fe} + 4H_2O \\rightarrow \\overline{Fe_3O_4} + H_2\n$$\n\n#### (1.6) (partly balanced equation)\n\nStep IV: Fe and H atoms are still not balanced. Pick any of these elements to proceed further. Let us balance hydrogen atoms in the partly balanced equation.\n\nTo equalise the number of H atoms, make the number of molecules of hydrogen as four on the RHS.\n\n| Atoms of<br>hydrogen                 | In reactants      | In products            |\n|--------------------------------------|-------------------|------------------------|\n| (i)<br>Initial<br>(ii)<br>To balance | 8 (in 4 H2O)<br>8 | 2 (in H2<br>)<br>2 × 4 |\n\n+ 4 H<sup>2</sup>\n\nThe equation would be –\n\nFe + 4 H2O → Fe3O<sup>4</sup>\n\n(1.7) (partly balanced equation)\n\nStep V: Examine the above equation and pick up the third element which is not balanced. You find that only one element is left to be balanced, that is, iron.\n\n| Atoms of<br>iron                     | In reactants     | In products           |\n|--------------------------------------|------------------|-----------------------|\n| (i)<br>Initial<br>(ii)<br>To balance | 1 (in Fe)<br>1×3 | 3 (in Fe3O4<br>)<br>3 |\n\nTo equalise Fe, we take three atoms of Fe on the LHS.\n\n$$\n3 \\text{ Fe } + 4 \\text{ H}_2\\text{O} \\rightarrow \\text{Fe}_3\\text{O}_4 + 4 \\text{ H}_2 \\tag{1.8}\n$$\n\nStep VI: Finally, to check the correctness of the balanced equation, we count atoms of each element on both sides of the equation.\n\n$$\n3\\mathrm{Fe} + 4\\mathrm{H}_2\\mathrm{O} \\rightarrow \\mathrm{Fe}_3\\mathrm{O}_4 + 4\\mathrm{H}_2\n$$\n\n(1.9) (balanced equation)\n\nThe numbers of atoms of elements on both sides of Eq. (1.9) are equal. This equation is now balanced. This method of balancing chemical equations is called hit-and-trial method as we make trials to balance the equation by using the smallest whole number coefficient.\n\nStep VII: *Writing Symbols of Physical States* Carefully examine the above balanced Eq. (1.9). Does this equation tell us anything about the physical state of each reactant and product? No information has been given in this equation about their physical states.\n\nTo make a chemical equation more informative, the physical states of the reactants and products are mentioned along with their chemical formulae. The gaseous, liquid, aqueous and solid states of reactants and products are represented by the notations (g), (l), (aq) and (s), respectively. The word aqueous (aq) is written if the reactant or product is present as a solution in water.\n\nThe balanced Eq. (1.9) becomes\n\n3Fe(s) + 4H2O(g) → Fe3O<sup>4</sup> (s) + 4H<sup>2</sup>\n\n(g) (1.10)\n\nNote that the symbol (g) is used with H2O to indicate that in this reaction water is used in the form of steam.\n\nUsually physical states are not included in a chemical equation unless it is necessary to specify them.\n\nSometimes the reaction conditions, such as temperature, pressure, catalyst, etc., for the reaction are indicated above and/or below the arrow in the equation. For example –\n\n$$\nCO(g) + 2H_2(g) \\xrightarrow{340 \\text{ atm}} CH_3OH(l)\n$$\n\\n(1.11)\n\n6CO (aq) 12H O(l) <sup>2</sup> + <sup>2</sup> C H O (aq) 6O 6 12 6 + Sunlight Chlorophyll <sup>→</sup> <sup>2</sup> <sup>2</sup> (aq) 6H O(l) + (1.12) (Glucose)\n\nUsing these steps, can you balance Eq. (1.2) given in the text earlier?\n\n# QUESTIONS\n\n- 1. Why should a magnesium ribbon be cleaned before burning in air?\n- 2. Write the balanced equation for the following chemical reactions.\n  - (i) Hydrogen + Chlorine → Hydrogen chloride\n  - (ii) Barium chloride + Aluminium sulphate → Barium sulphate + Aluminium chloride\n  - (iii) Sodium + Water → Sodium hydroxide + Hydrogen\n- 3. Write a balanced chemical equation with state symbols for the following reactions.\n  - (i) Solutions of barium chloride and sodium sulphate in water react to give insoluble barium sulphate and the solution of sodium chloride.\n  - (ii) Sodium hydroxide solution (in water) reacts with hydrochloric acid solution (in water) to produce sodium chloride solution and water.\n\n## 1.2 TYPES OF CHEMICAL REACTIONS\n\nWe have learnt in Class IX that during a chemical reaction atoms of one element do not change into those of another element. Nor do atoms disappear from the mixture or appear from elsewhere. Actually, chemical reactions involve the breaking and making of bonds between atoms to produce new substances. You will study about types of bonds formed between atoms in Chapters 3 and 4.\n\n1.2.1 Combination Reaction\n\n![](_page_5_Figure_12.jpeg)\n\n#### *Figure 1.3*\n\n*Formation of slaked lime by the reaction of calcium oxide with water*\n\nCalcium oxide reacts vigorously with water to produce slaked lime (calcium hydroxide) releasing a large amount of heat.\n\n$$\nCaO(s) + H2O(l) \\rightarrow Ca(OH)2(aq) + Heat\n$$\n\\n(Quick lime) (Slaked lime) (5laked lime) (1.13)\n\nIn this reaction, calcium oxide and water combine to form a single product, calcium hydroxide. Such a reaction in which a single product is formed from two or more reactants is known as a combination reaction.\n\n?\n\nA solution of slaked lime produced by the reaction 1.13 is used for whitewashing walls. Calcium hydroxide reacts slowly with the carbon dioxide in air to form a thin layer of calcium carbonate on the walls. Calcium carbonate is formed after two to three days of whitewashing and gives a shiny finish to the walls. It is interesting to note that the chemical formula for marble is also CaCO<sup>3</sup> .\n\n| →<br>Ca(OH)2<br>(aq) + CO2<br>(g) | CaCO3<br>(s) | + H2O(l) | (1.14) |\n|-----------------------------------|--------------|----------|--------|\n| (Calcium                          | (Calcium     |          |        |\n| hydroxide)                        | carbonate)   |          |        |\n\nLet us discuss some more examples of combination reactions.\n\n- (i) Burning of coal\n  - C(s) + O<sup>2</sup> (g) → CO<sup>2</sup>\n\n(g) (1.15)\n\n(ii) Formation of water from H<sup>2</sup> (g) and O<sup>2</sup> (g)\n\n2H<sup>2</sup> (g) + O<sup>2</sup> (g) → 2H2O(l) (1.16)\n\nIn simple language we can say that when two or more substances (elements or compounds) combine to form a single product, the reactions are called combination reactions.\n\nIn Activity 1.4, we also observed that a large amount of heat is evolved. This makes the reaction mixture warm. Reactions in which heat is released along with the formation of products are called exothermic chemical reactions.\n\nOther examples of exothermic reactions are –\n\n(i) Burning of natural gas\n\nCH<sup>4</sup> (g) + 2O<sup>2</sup> (g) → CO<sup>2</sup> (g) + 2H2O (g) (1.17)\n\n(ii) Do you know that respiration is an exothermic process?\n\nWe all know that we need energy to stay alive. We get this energy from the food we eat. During digestion, food is broken down into simpler substances. For example, rice, potatoes and bread contain carbohydrates. These carbohydrates are broken down to form glucose. This glucose combines with oxygen in the cells of our body and provides energy. The special name of this reaction is respiration, the process of which you will study in Chapter 6. heat is given out along with the formation of a single product. Do You Know?\n\n#### C6H12O<sup>6</sup> (aq) + 6O<sup>2</sup> (aq) → 6CO<sup>2</sup> (aq) + 6H2O(l) + energy (1.18) (Glucose)\n\n(iii) The decomposition of vegetable matter into compost is also an example of an exothermic reaction.\n\nIdentify the type of the reaction taking place in Activity 1.1, where\n\n![](_page_7_Figure_0.jpeg)\n\n#### *Figure 1.4*\n\n*Correct way of heating the boiling tube containing crystals of ferrous sulphate and of smelling the odour*\n\nHave you noticed that the green colour of the ferrous sulphate crystals has changed? You can also smell the characteristic odour of burning sulphur.\n\n$$\n2FeSO4(s) \\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\\t\n$$\n\nIn this reaction you can observe that a single reactant breaks down to give simpler products. This is a decomposition reaction. Ferrous sulphate crystals (FeSO<sup>4</sup> . 7H2O) lose water when heated and the colour of the crystals changes. It then decomposes to ferric oxide (Fe2O<sup>3</sup> ), sulphur dioxide (SO<sup>2</sup> ) and sulphur trioxide (SO<sup>3</sup> ). Ferric oxide is a solid, while SO<sup>2</sup> and SO<sup>3</sup> are gases.\n\nDecomposition of calcium carbonate to calcium oxide and carbon dioxide on heating is an important decomposition reaction used in various industries. Calcium oxide is called lime or quick lime. It has many uses – one is in the manufacture of cement. When a decomposition reaction is carried out by heating, it is called thermal decomposition.\n\n$$\nCaCO3(s) \\xrightarrow{Heat} CaO(s) + CO2(g)\n$$\n\\n(Limsstone) (Quick line) (1.20)\n\n![](_page_7_Figure_8.jpeg)\n\n*Figure 1.5 Heating of lead nitrate and emission of nitrogen dioxide*\n\nAnother example of a thermal decomposition reaction is given in Activity 1.6.\n\n#### Activity 1.6\n\n- n Take about 2 g lead nitrate powder in a boiling tube.\n- n Hold the boiling tube with a pair of tongs and heat it over a flame, as shown in Fig. 1.5.\n- n What do you observe? Note down the change, if any.\n\nYou will observe the emission of brown fumes. These fumes are of nitrogen dioxide (NO<sup>2</sup> ). The reaction that takes place is –\n\n| 2Pb(NO3<br>)<br>(s)<br><br>2 | Heat<br>2PbO(s)<br>→ | + | 4NO2<br>(g) + O2 |          |\n|-------------------------------|-------------------------|---|------------------|----------|\n| (Lead nitrate)                | (Lead oxide)            |   | (Nitrogen        | (Oxygen) |\n\n(g) + O<sup>2</sup> (g) (1.21) dioxide)\n\nLet us perform some more decomposition reactions as given in Activities 1.7 and 1.8.\n\n## Activity 1.7\n\n- n Take a plastic mug. Drill two holes at its base and fit rubber stoppers in these holes. Insert carbon electrodes in these rubber stoppers as shown in Fig. 1.6.\n- n Connect these electrodes to a 6 volt battery.\n- n Fill the mug with water such that the electrodes are immersed. Add a few drops of dilute sulphuric acid to the water.\n- n Take two test tubes filled with water and invert them over the two carbon electrodes.\n- n Switch on the current and leave the apparatus undisturbed for some time.\n- n You will observe the formation of bubbles at both the electrodes. These bubbles displace water in the test tubes.\n- n Is the volume of the gas collected the same in both the test tubes?\n- n Once the test tubes are filled with the respective gases, remove them carefully.\n- n Test these gases one by one by bringing a burning candle close to the mouth of the test tubes.\n\nCAUTION: This step must be performed carefully by the teacher.\n\n- n What happens in each case?\n- n Which gas is present in each test tube?\n\n### Activity 1.8\n\n- n Take about 2 g silver chloride in a china dish.\n- n What is its colour?\n- n Place this china dish in sunlight for some time (Fig. 1.7).\n- n Observe the colour of the silver chloride after some time.\n\n![](_page_8_Figure_21.jpeg)\n\n*Figure 1.6*\n\n*Electrolysis of water*\n\n*Silver chloride turns grey in sunlight to form silver*\n\n*Figure 1.7*\n\n*metal*\n\nYou will see that white silver chloride turns grey in sunlight. This is due to the decomposition of silver chloride into silver and chlorine by light.\n\n2AgCl(s) Sunlight → 2Ag(s) + Cl<sup>2</sup>\n\n(g) (1.22)\n\nChemical Reactions and Equations 9\n\nSilver bromide also behaves in the same way.\n\n2AgBr(s) Sunlight → 2Ag(s) + Br<sup>2</sup> (g) (1.23)\n\nThe above reactions are used in black and white photography. What form of energy is causing these decomposition reactions?\n\nWe have seen that the decomposition reactions require energy either in the form of heat, light or electricity for breaking down the reactants. Reactions in which energy is absorbed are known as endothermic reactions.\n\n#### *Carry out the following Activity*\n\nTake about 2 g barium hydroxide in a test tube. Add 1 g of ammonium chloride and mix with the help of a glass rod. Touch the bottom of the test tube with your palm. What do you feel? Is this an exothermic or endothermic reaction?\n\n# **QUESTIONS**\n\n- 1. A solution of a substance 'X' is used for whitewashing.\n  - (i) Name the substance 'X' and write its formula.\n  - (ii) Write the reaction of the substance 'X' named in (i) above with water.\n- 2. Why is the amount of gas collected in one of the test tubes in Activity 1.7 double of the amount collected in the other? Name this gas.\n\n1.2.3 Displacement Reaction\n\n*Figure 1.8 (a) Iron nails dipped in copper sulphate solution*\n\n## Activity 1.9\n\n- n Take three iron nails and clean them by rubbing with sand paper.\n- n Take two test tubes marked as (A) and (B). In each test tube, take about 10 mL copper sulphate solution.\n- n Tie two iron nails with a thread and immerse them carefully in the copper sulphate solution in test tube B for about 20 minutes [Fig. 1.8 (a)]. Keep one iron nail aside for comparison.\n- n After 20 minutes, take out the iron nails from the copper sulphate solution.\n- n Compare the intensity of the blue colour of copper sulphate solutions in test tubes (A) and (B) [Fig. 1.8 (b)].\n- n Also, compare the colour of the iron nails dipped in the copper sulphate solution with the one kept aside [Fig. 1.8 (b)].\n\n?\n\n![](_page_10_Figure_0.jpeg)\n\n*Figure 1.8 (b) Iron nails and copper sulphate solutions compared before and after the experiment*\n\nWhy does the iron nail become brownish in colour and the blue colour of copper sulphate solution fades?\n\nThe following chemical reaction takes place in this Activity–\n\nFe(s) + CuSO<sup>4</sup> (aq) <sup>→</sup> FeSO<sup>4</sup> (aq) + Cu(s) (1.24) (Copper sulphate) (Iron sulphate)\n\nIn this reaction, iron has displaced or removed another element, copper, from copper sulphate solution. This reaction is known as displacement reaction.\n\nOther examples of displacement reactions are\n\n| (aq) →<br>Zn(s) + CuSO4<br>(Copper sulphate)    | ZnSO4<br>(aq) +<br>(Zinc sulphate)    | Cu(s)<br>(1.25) |\n|-------------------------------------------------|---------------------------------------|-----------------|\n| →<br>Pb(s) + CuCl2<br>(aq)<br>(Copper chloride) | PbCl2<br>(aq)<br>+<br>(Lead chloride) | Cu(s)<br>(1.26) |\n\nZinc and lead are more reactive elements than copper. They displace copper from its compounds.\n\n1.2.4 Double Displacement Reaction\n\nsulphate) chloride) sulphate) chloride)\n\nActivity 1.10 n Take about 3 mL of sodium sulphate solution in a test tube. n In another test tube, take about 3 mL of barium chloride solution. n Mix the two solutions (Fig. 1.9). n What do you observe? *Figure 1.9 Formation of barium sulphate and sodium chloride* You will observe that a white substance, which is insoluble in water, is formed. This insoluble substance formed is known as a precipitate. Any reaction that produces a precipitate can be called a precipitation reaction. Na2SO<sup>4</sup> (aq) + BaCl<sup>2</sup> (aq) → BaSO<sup>4</sup> (s) + 2NaCl(aq) (1.27) (Sodium (Barium (Barium (Sodium\n\nChemical Reactions and Equations 11\n\nWhat causes this? The white precipitate of BaSO4 is formed by the\n\nreaction of 2– SO<sup>4</sup> and Ba2+. The other product formed is sodium chloride which remains in the solution. Such reactions in which there is an exchange of ions between the reactants are called double displacement reactions.\n\n*Recall Activity 1.2*, where you have mixed the solutions of lead(II) nitrate and potassium iodide.\n\n- (i) What was the colour of the precipitate formed? Can you name the compound precipitated?\n- (ii) Write the balanced chemical equation for this reaction.\n- (iii) Is this also a double displacement reaction?\n\n![](_page_11_Figure_6.jpeg)\n\n*Figure 1.10*\n\n*Oxidation of copper to copper oxide*\n\n#### 2Cu + O<sup>2</sup> → Heat 2CuO (1.28)\n\nIf hydrogen gas is passed over this heated material (CuO), the black coating on the surface turns brown as the reverse reaction takes place and copper is obtained.\n\n#### CuO +H Cu+H O <sup>2</sup> <sup>2</sup> → Heat (1.29)\n\nIf a substance gains oxygen during a reaction, it is said to be oxidised. If a substance loses oxygen during a reaction, it is said to be reduced.\n\nDuring this reaction (1.29), the copper(II) oxide is losing oxygen and is being reduced. The hydrogen is gaining oxygen and is being oxidised. In other words, one reactant gets oxidised while the other gets reduced during a reaction. Such reactions are called oxidation-reduction reactions or redox reactions.\n\n$$\nCuO + H2 \\xrightarrow{\\text{Heat}} Cu + H2O\n$$\n\\n\n$$\nReduction\n$$\n\\n(1.30)\n\nSome other examples of redox reactions are:\n\n$$\nZnO + C \\rightarrow Zn + CO \\tag{1.31}\n$$\n\nMnO HCl MnCl H O Cl <sup>2</sup> + → + + 4 2 2 2 2 (1.32)\n\nIn reaction (1.31) carbon is oxidised to CO and ZnO is reduced to Zn. In reaction (1.32) HCl is oxidised to Cl<sup>2</sup> whereas MnO<sup>2</sup> is reduced to MnCl<sup>2</sup> .\n\nFrom the above examples we can say that if a substance gains oxygen or loses hydrogen during a reaction, it is oxidised. If a substance loses oxygen or gains hydrogen during a reaction, it is reduced.\n\n*Recall Activity 1.1*,where a magnesium ribbon burns with a dazzling flame in air (oxygen) and changes into a white substance, magnesium oxide. Is magnesium being oxidised or reduced in this reaction?\n\n### 1.3 HAVE YOU OBSERVED THE EFFECTS OF OXIDATION REACTIONS IN EVERYDAY LIFE? Y LIFE?\n\n#### 1.3.1 Corrosion\n\nYou must have observed that iron articles are shiny when new, but get coated with a reddish brown powder when left for some time. This process is commonly known as rusting of iron. Some other metals also get tarnished in this manner. Have you noticed the colour of the coating formed on copper and silver? When a metal is attacked by substances around it such as moisture, acids, etc., it is said to corrode and this process is called corrosion. The black coating on silver and the green coating on copper are other examples of corrosion.\n\nCorrosion causes damage to car bodies, bridges, iron railings, ships and to all objects made of metals, specially those of iron. Corrosion of iron is a serious problem. Every year an enormous amount of money is spent to replace damaged iron. You will learn more about corrosion in Chapter 3.\n\n### 1.3.2 Rancidity\n\nHave you ever tasted or smelt the fat/oil containing food materials left for a long time?\n\nWhen fats and oils are oxidised, they become rancid and their smell and taste change. Usually substances which prevent oxidation (antioxidants) are added to foods containing fats and oil. Keeping food in air tight containers helps to slow down oxidation. Do you know that chips manufacturers usually flush bags of chips with gas such as nitrogen to prevent the chips from getting oxidised ?\n\n![](_page_12_Figure_10.jpeg)\n\n# What you have learnt\n\n- n A complete chemical equation represents the reactants, products and their physical states symbolically.\n- n A chemical equation is balanced so that the numbers of atoms of each type involved in a chemical reaction are the same on the reactant and product sides of the equation. Equations must always be balanced.\n- n In a combination reaction two or more substances combine to form a new single substance.\n- n Decomposition reactions are opposite to combination reactions. In a decomposition reaction, a single substance decomposes to give two or more substances.\n- n Reactions in which heat is given out along with the products are called exothermic reactions.\n- n Reactions in which energy is absorbed are known as endothermic reactions.\n- n When an element displaces another element from its compound, a displacement reaction occurs.\n- n Two different atoms or groups of atoms (ions) are exchanged in double displacement reactions.\n- n Precipitation reactions produce insoluble salts.\n- n Reactions also involve the gain or loss of oxygen or hydrogen by substances. Oxidation is the gain of oxygen or loss of hydrogen. Reduction is the loss of oxygen or gain of hydrogen.\n\n# EXERCISES\n\n- 1. Which of the statements about the reaction below are incorrect? 2PbO(s) + C(s) → 2Pb(s) + CO<sup>2</sup> (g)\n  - (a) Lead is getting reduced.\n  - (b) Carbon dioxide is getting oxidised.\n  - (c) Carbon is getting oxidised.\n  - (d) Lead oxide is getting reduced.\n    - (i) (a) and (b)\n    - (ii) (a) and (c)\n    - (iii) (a), (b) and (c)\n    - (iv) all\n- 2. Fe2O<sup>3</sup> + 2Al <sup>→</sup> Al2O<sup>3</sup> + 2Fe\n\nThe above reaction is an example of a\n\n- (a) combination reaction.\n- (b) double displacement reaction.\n\n- (c) decomposition reaction.\n- (d) displacement reaction.\n- 3. What happens when dilute hydrochloric acid is added to iron fillings? Tick the correct answer.\n  - (a) Hydrogen gas and iron chloride are produced.\n  - (b) Chlorine gas and iron hydroxide are produced.\n  - (c) No reaction takes place.\n  - (d) Iron salt and water are produced.\n- 4. What is a balanced chemical equation? Why should chemical equations be balanced?\n- 5. Translate the following statements into chemical equations and then balance them.\n  - (a) Hydrogen gas combines with nitrogen to form ammonia.\n  - (b) Hydrogen sulphide gas burns in air to give water and sulpur dioxide.\n  - (c) Barium chloride reacts with aluminium sulphate to give aluminium chloride and a precipitate of barium sulphate.\n  - (d) Potassium metal reacts with water to give potassium hydroxide and hydrogen gas.\n- 6. Balance the following chemical equations.\n  - (a) HNO3 +Ca(OH)<sup>2</sup> <sup>→</sup> Ca(NO<sup>3</sup> ) 2 + H2O\n  - (b) NaOH + H2SO<sup>4</sup> <sup>→</sup> Na2SO<sup>4</sup> + H2O\n  - (c) NaCl + AgNO<sup>3</sup> <sup>→</sup> AgCl + NaNO<sup>3</sup>\n  - (d) BaCl<sup>2</sup> + H<sup>2</sup> SO<sup>4</sup> <sup>→</sup> BaSO<sup>4</sup> + HCl\n- 7. Write the balanced chemical equations for the following reactions.\n  - (a) Calcium hydroxide + Carbon dioxide → Calcium carbonate + Water\n  - (b) Zinc + Silver nitrate → Zinc nitrate + Silver\n  - (c) Aluminium + Copper chloride → Aluminium chloride + Copper\n  - (d) Barium chloride + Potassium sulphate → Barium sulphate + Potassium chloride\n- 8. Write the balanced chemical equation for the following and identify the type of reaction in each case.\n  - (a) Potassium bromide(aq) + Barium iodide(aq) → Potassium iodide(aq) +\n\nBarium bromide(s)\n\n- (b) Zinc carbonate(s) → Zinc oxide(s) + Carbon dioxide(g)\n- (c) Hydrogen(g) + Chlorine(g) → Hydrogen chloride(g)\n- (d) Magnesium(s) + Hydrochloric acid(aq) → Magnesium chloride(aq) + Hydrogen(g)\n- 9. What does one mean by exothermic and endothermic reactions? Give examples.\n- 10. Why is respiration considered an exothermic reaction? Explain.\n- 11. Why are decomposition reactions called the opposite of combination reactions? Write equations for these reactions.\n\n- 12. Write one equation each for decomposition reactions where energy is supplied in the form of heat, light or electricity.\n- 13. What is the difference between displacement and double displacement reactions? Write equations for these reactions.\n- 14. In the refining of silver, the recovery of silver from silver nitrate solution involved displacement by copper metal. Write down the reaction involved.\n- 15. What do you mean by a precipitation reaction? Explain by giving examples.\n- 16. Explain the following in terms of gain or loss of oxygen with two examples each.\n  - (a) Oxidation\n  - (b) Reduction\n- 17. A shiny brown coloured element 'X' on heating in air becomes black in colour. Name the element 'X' and the black coloured compound formed.\n- 18. Why do we apply paint on iron articles?\n- 19. Oil and fat containing food items are flushed with nitrogen. Why?\n- 20. Explain the following terms with one example each.\n  - (a) Corrosion\n  - (b) Rancidity\n\n# Group Activity\n\nPerform the following activity.\n\n- n Take four beakers and label them as A, B, C and D.\n- n Put 25 mL of water in A, B and C beakers and copper sulphate solution in beaker D.\n- n Measure and record the temperature of each liquid contained in the beakers above.\n- n Add two spatulas of potassium sulphate, ammonium nitrate, anhydrous copper sulphate and fine iron fillings to beakers A, B, C and D respectively and stir.\n- n Finally measure and record the temperature of each of the mixture above.\n\nFind out which reactions are exothermic and which ones are endothermic in nature.",
    "structured_data": {
      "error": "No structured data available"
    },
    "images": [
      {
        "name": "_page_0_Picture_1.jpeg",
        "path": "/home/content/converted_books/images/jesc101/_page_0_Picture_1.jpeg",
        "size_bytes": 30680,
        "description": "This image shows the chapter title page for \"Chapter 1: Chemical Reactions and Equations\" with a simple illustration of a conical flask (laboratory beaker) containing some substance. The chapter heading introduces the main topic that will explore how chemical reactions occur and how they can be represented through chemical equations.",
        "description_generated_at": "2025-07-19 12:14:51"
      },
      {
        "name": "_page_0_Picture_2.jpeg",
        "path": "/home/content/converted_books/images/jesc101/_page_0_Picture_2.jpeg",
        "size_bytes": 11219,
        "description": "The image shows a QR code labeled \"1064CH01\" that likely provides digital access to additional learning resources or activities related to the chapter on chemical reactions. This QR code serves as a modern educational tool to connect students with supplementary online content that supports their understanding of chemical changes and reactions discussed in the text.",
        "description_generated_at": "2025-07-19 12:14:51"
      },
      {
        "name": "_page_0_Figure_17.jpeg",
        "path": "/home/content/converted_books/images/jesc101/_page_0_Figure_17.jpeg",
        "size_bytes": 34581,
        "description": "This diagram illustrates the experimental setup for burning a magnesium ribbon, showing hands using tongs to hold the ribbon over a burner flame while collecting the resulting white magnesium oxide ash in a watch-glass below. The image demonstrates the key components and safety procedures for this classic chemistry experiment that shows how a chemical reaction transforms magnesium metal into magnesium oxide.",
        "description_generated_at": "2025-07-19 12:14:51"
      },
      {
        "name": "_page_1_Figure_5.jpeg",
        "path": "/home/content/converted_books/images/jesc101/_page_1_Figure_5.jpeg",
        "size_bytes": 21056,
        "description": "This diagram shows the experimental setup for Activity 1.3, illustrating a conical flask containing zinc granules and dilute sulphuric acid, with a glass tube and cork system to collect the hydrogen gas (H₂) that is produced during the chemical reaction. The labeled diagram helps students visualize how to safely conduct the experiment where zinc reacts with acid to produce hydrogen gas, demonstrating key signs of a chemical reaction like gas evolution and temperature change.",
        "description_generated_at": "2025-07-19 12:14:51"
      },
      {
        "name": "_page_5_Figure_12.jpeg",
        "path": "/home/content/converted_books/images/jesc101/_page_5_Figure_12.jpeg",
        "size_bytes": 48981,
        "description": "This diagram illustrates Activity 1.4, showing a hand-drawn experimental setup where calcium oxide (quick lime) is being added to water in a beaker, with labels identifying the beaker, water, and calcium oxide. The image demonstrates the practical procedure for observing a combination reaction, specifically the formation of slaked lime when calcium oxide reacts with water, allowing students to experience the heat release mentioned in the chemical equation.",
        "description_generated_at": "2025-07-19 12:14:51"
      },
      {
        "name": "_page_7_Figure_0.jpeg",
        "path": "/home/content/converted_books/images/jesc101/_page_7_Figure_0.jpeg",
        "size_bytes": 81449,
        "description": "This diagram illustrates the proper laboratory technique for heating ferrous sulphate crystals in a boiling tube to demonstrate a decomposition reaction. The image shows a student safely wafting gases toward her nose to smell the products while heating the crystals over a burner, with clear safety instructions about not pointing the tube at others and proper gas detection methods.",
        "description_generated_at": "2025-07-19 12:14:51"
      },
      {
        "name": "_page_7_Figure_8.jpeg",
        "path": "/home/content/converted_books/images/jesc101/_page_7_Figure_8.jpeg",
        "size_bytes": 24540,
        "description": "This diagram shows the experimental setup for heating lead nitrate in a boiling tube using tongs over a Bunsen burner flame, with visible brown fumes (nitrogen dioxide) being released from the tube. The image illustrates the thermal decomposition reaction described in Activity 1.6, where lead nitrate breaks down into lead oxide, nitrogen dioxide gas, and oxygen when heated.",
        "description_generated_at": "2025-07-19 12:14:51"
      },
      {
        "name": "_page_8_Figure_21.jpeg",
        "path": "/home/content/converted_books/images/jesc101/_page_8_Figure_21.jpeg",
        "size_bytes": 15760,
        "description": "This diagram illustrates the experimental setup for Activity 1.8, showing an open window with sunlight streaming in and a china dish placed to receive the sunlight. The image demonstrates how silver chloride in the china dish is exposed to sunlight to observe the decomposition reaction that causes the white compound to turn grey.",
        "description_generated_at": "2025-07-19 12:14:51"
      },
      {
        "name": "_page_10_Figure_0.jpeg",
        "path": "/home/content/converted_books/images/jesc101/_page_10_Figure_0.jpeg",
        "size_bytes": 43118,
        "description": "This diagram shows the results of a displacement reaction experiment where iron nails were placed in copper sulphate solution, demonstrating how the iron nail becomes brownish (due to copper coating) while the blue copper sulphate solution becomes lighter in color. The image compares the treated nail with an untreated one and shows two test tubes - one with original blue copper sulphate solution and another with the faded solution after the reaction.",
        "description_generated_at": "2025-07-19 12:14:51"
      },
      {
        "name": "_page_11_Figure_6.jpeg",
        "path": "/home/content/converted_books/images/jesc101/_page_11_Figure_6.jpeg",
        "size_bytes": 71538,
        "description": "This diagram shows a laboratory setup for demonstrating oxidation and reduction reactions, featuring a china dish containing copper powder placed on a wire gauze above a burner supported by a tripod stand. The image illustrates Activity 1.11, which involves heating copper powder to observe its oxidation to black copper(II) oxide, demonstrating the fundamental concept of oxidation as the gain of oxygen.",
        "description_generated_at": "2025-07-19 12:14:51"
      },
      {
        "name": "_page_12_Figure_10.jpeg",
        "path": "/home/content/converted_books/images/jesc101/_page_12_Figure_10.jpeg",
        "size_bytes": 70371,
        "description": "This image shows a \"Questions\" section from the textbook containing three practice problems related to chemical reactions, including topics like copper sulfate solution color changes, double displacement reactions, and identifying oxidized and reduced substances in given chemical equations. The questions are designed to help students apply their understanding of the chemical reaction concepts discussed in the chapter, particularly focusing on displacement reactions and oxidation-reduction processes.",
        "description_generated_at": "2025-07-19 12:14:51"
      }
    ],
    "exercises": [
      {
        "question": "Why should a magnesium ribbon be cleaned before burning in air?",
        "answer": "A magnesium ribbon should be cleaned before burning because its surface gets coated with a layer of magnesium oxide (MgO) and magnesium carbonate (MgCO₃) due to slow oxidation by air and moisture. This coating prevents the magnesium from coming in direct contact with air during burning. Cleaning with sandpaper removes this coating, exposing the pure magnesium surface, which then burns readily with a dazzling white flame to form magnesium oxide."
      },
      {
        "question": "Write the balanced equation for the following chemical reactions: (i) Hydrogen + Chlorine → Hydrogen chloride (ii) Barium chloride + Aluminium sulphate → Barium sulphate + Aluminium chloride (iii) Sodium + Water → Sodium hydroxide + Hydrogen",
        "answer": "(i) H₂(g) + Cl₂(g) → 2HCl(g)\n(ii) 3BaCl₂(aq) + Al₂(SO₄)₃(aq) → 3BaSO₄(s) + 2AlCl₃(aq)\n(iii) 2Na(s) + 2H₂O(l) → 2NaOH(aq) + H₂(g)\n\nFor balancing: Count atoms of each element on both sides and adjust coefficients to make them equal while keeping chemical formulas unchanged."
      },
      {
        "question": "Write a balanced chemical equation with state symbols for the following reactions: (i) Solutions of barium chloride and sodium sulphate in water react to give insoluble barium sulphate and the solution of sodium chloride. (ii) Sodium hydroxide solution (in water) reacts with hydrochloric acid solution (in water) to produce sodium chloride solution and water.",
        "answer": "(i) BaCl₂(aq) + Na₂SO₄(aq) → BaSO₄(s) + 2NaCl(aq)\n(ii) NaOH(aq) + HCl(aq) → NaCl(aq) + H₂O(l)\n\nState symbols: (s) = solid, (l) = liquid, (g) = gas, (aq) = aqueous solution. The first reaction is a precipitation reaction forming insoluble BaSO₄, while the second is a neutralization reaction."
      },
      {
        "question": "A solution of a substance 'X' is used for whitewashing. (i) Name the substance 'X' and write its formula. (ii) Write the reaction of the substance 'X' named in (i) above with water.",
        "answer": "(i) The substance 'X' is calcium hydroxide (slaked lime). Its formula is Ca(OH)₂.\n(ii) The reaction is: CaO(s) + H₂O(l) → Ca(OH)₂(aq) + Heat\n\nCalcium oxide (quick lime) reacts with water to form calcium hydroxide solution, which is used for whitewashing. The whitewashing effect comes from the reaction: Ca(OH)₂(aq) + CO₂(g) → CaCO₃(s) + H₂O(l), forming a thin layer of calcium carbonate."
      },
      {
        "question": "Why is the amount of gas collected in one of the test tubes in Activity 1.7 double of the amount collected in the other? Name this gas.",
        "answer": "In the electrolysis of water (Activity 1.7), water decomposes according to: 2H₂O(l) → 2H₂(g) + O₂(g). From this equation, we can see that 2 molecules of hydrogen gas are produced for every 1 molecule of oxygen gas. Therefore, the volume of hydrogen gas collected is double that of oxygen gas. The gas collected in double amount is hydrogen gas (H₂), which can be identified by the 'pop' sound it makes when a burning candle is brought near it."
      },
      {
        "question": "Which of the statements about the reaction below are incorrect? 2PbO(s) + C(s) → 2Pb(s) + CO₂(g) (a) Lead is getting reduced. (b) Carbon dioxide is getting oxidised. (c) Carbon is getting oxidised. (d) Lead oxide is getting reduced.",
        "answer": "The incorrect statement is (b) Carbon dioxide is getting oxidised. The correct answer is (ii) (a) and (c).\n\nExplanation: In this reaction, PbO loses oxygen to form Pb (lead oxide is getting reduced), and C gains oxygen to form CO₂ (carbon is getting oxidised). Lead itself is getting reduced as it's part of lead oxide. Carbon dioxide is a product, not a reactant getting oxidised. Therefore, statements (a), (c), and (d) are correct, while (b) is incorrect."
      },
      {
        "question": "Fe₂O₃ + 2Al → Al₂O₃ + 2Fe. The above reaction is an example of a: (a) combination reaction (b) double displacement reaction (c) decomposition reaction (d) displacement reaction",
        "answer": "The correct answer is (d) displacement reaction.\n\nExplanation: In this reaction, aluminum (Al) displaces iron (Fe) from iron oxide (Fe₂O₃). This is a single displacement reaction where a more reactive metal (aluminum) displaces a less reactive metal (iron) from its compound. This reaction is also known as the thermite reaction and is highly exothermic."
      },
      {
        "question": "What happens when dilute hydrochloric acid is added to iron fillings? (a) Hydrogen gas and iron chloride are produced (b) Chlorine gas and iron hydroxide are produced (c) No reaction takes place (d) Iron salt and water are produced",
        "answer": "The correct answer is (a) Hydrogen gas and iron chloride are produced.\n\nExplanation: The reaction is: Fe(s) + 2HCl(aq) → FeCl₂(aq) + H₂(g). Iron displaces hydrogen from hydrochloric acid, producing iron(II) chloride (iron salt) and hydrogen gas. The hydrogen gas can be identified by the effervescence (bubbling) and the characteristic 'pop' sound when ignited."
      },
      {
        "question": "What is a balanced chemical equation? Why should chemical equations be balanced?",
        "answer": "A balanced chemical equation is one in which the number of atoms of each element is equal on both the reactant side (LHS) and product side (RHS) of the equation.\n\nChemical equations should be balanced because:\n1. Law of Conservation of Mass: Mass can neither be created nor destroyed in a chemical reaction\n2. The total mass of reactants equals the total mass of products\n3. The number of atoms of each element remains the same before and after the reaction\n4. It provides correct stoichiometric ratios for calculations\n5. It gives accurate information about the quantities of reactants and products involved"
      },
      {
        "question": "What does one mean by exothermic and endothermic reactions? Give examples.",
        "answer": "Exothermic reactions: Reactions that release heat energy along with product formation. The reaction mixture becomes warm.\nExamples:\n- Burning of methane: CH₄ + 2O₂ → CO₂ + 2H₂O + Heat\n- Respiration: C₆H₁₂O₆ + 6O₂ → 6CO₂ + 6H₂O + Energy\n- Formation of slaked lime: CaO + H₂O → Ca(OH)₂ + Heat\n\nEndothermic reactions: Reactions that absorb heat energy from surroundings. The reaction mixture becomes cold.\nExamples:\n- Electrolysis of water: 2H₂O + Electrical energy → 2H₂ + O₂\n- Decomposition of calcium carbonate: CaCO₃ + Heat → CaO + CO₂\n- Photosynthesis: 6CO₂ + 6H₂O + Light energy → C₆H₁₂O₆ + 6O₂"
      },
      {
        "question": "Explain oxidation and reduction in terms of gain or loss of oxygen with two examples each.",
        "answer": "Oxidation: The gain of oxygen or loss of hydrogen by a substance.\nExamples:\n1. 2Cu + O₂ → 2CuO (Copper gains oxygen)\n2. C + O₂ → CO₂ (Carbon gains oxygen)\n\nReduction: The loss of oxygen or gain of hydrogen by a substance.\nExamples:\n1. CuO + H₂ → Cu + H₂O (Copper oxide loses oxygen)\n2. ZnO + C → Zn + CO (Zinc oxide loses oxygen)\n\nIn redox reactions, oxidation and reduction occur simultaneously. The substance that gets oxidized is called a reducing agent, while the substance that gets reduced is called an oxidizing agent."
      },
      {
        "question": "What do you mean by a precipitation reaction? Explain by giving examples.",
        "answer": "A precipitation reaction is a type of double displacement reaction in which an insoluble solid (precipitate) is formed when two aqueous solutions are mixed. The precipitate separates out from the solution.\n\nExamples:\n1. AgNO₃(aq) + NaCl(aq) → AgCl(s)↓ + NaNO₃(aq)\n   (White precipitate of silver chloride)\n\n2. BaCl₂(aq) + Na₂SO₄(aq) → BaSO₄(s)↓ + 2NaCl(aq)\n   (White precipitate of barium sulphate)\n\n3. Pb(NO₃)₂(aq) + 2KI(aq) → PbI₂(s)↓ + 2KNO₃(aq)\n   (Yellow precipitate of lead iodide)\n\nThe downward arrow (↓) indicates the formation of a precipitate that settles down due to its insolubility in water."
      }
    ],
    "summary": {
      "title": "Chemical Reactions and Equations",
      "key_concepts": [
        "Balanced chemical equations and law of conservation of mass",
        "Types of chemical reactions: combination, decomposition, displacement, and double displacement",
        "Oxidation and reduction reactions (redox reactions)",
        "Exothermic and endothermic reactions",
        "Effects of oxidation in daily life: corrosion and rancidity"
      ],
      "summary": "This chapter introduces the fundamental concepts of chemical reactions and their symbolic representation through balanced chemical equations. It explains how chemical equations must be balanced according to the law of conservation of mass, ensuring equal numbers of atoms on both sides. The chapter categorizes chemical reactions into four main types: combination reactions (two or more reactants forming one product), decomposition reactions (one reactant breaking into multiple products), displacement reactions (one element replacing another), and double displacement reactions (exchange of ions between compounds). It also covers oxidation-reduction reactions, explaining oxidation as gain of oxygen or loss of hydrogen, and reduction as loss of oxygen or gain of hydrogen. The chapter distinguishes between exothermic reactions (releasing heat) and endothermic reactions (absorbing energy), providing practical examples like respiration, combustion, and photosynthesis. Finally, it discusses real-world applications of oxidation reactions, including corrosion of metals and rancidity of fats and oils, highlighting their economic and practical significance in daily life."
    }
  },
  "statistics": {
    "total_images": 11,
    "text_length": 32446,
    "processing_time": 23.56
  },
  "claude_processing": {
    "processed_at": "2025-07-19 12:14:51",
    "model_used": "claude-sonnet-4-20250514",
    "tasks_completed": [
      "exercises",
      "answers",
      "summary",
      "image_descriptions"
    ],
    "exercises_count": 12,
    "images_processed": 11
  },
  "title": "Chemical Reactions and Equations"
}