{
  "source_file": "/home/content/books/science/jesc110.pdf",
  "filename": "jesc110.pdf",
  "subject": "science",
  "conversion_timestamp": "2025-07-18T12:10:15.483446",
  "processing_time_seconds": 7.38,
  "metadata": "md",
  "content": {
    "markdown_text": "![](_page_0_Picture_0.jpeg)\n\n# The Human Eye and the Colourful World CHAPTER10\n\n![](_page_0_Picture_2.jpeg)\n\nY ou have studied in the previous chapter about refraction of light by lenses. You also studied the nature, position and relative size of images formed by lenses. How can these ideas help us in the study of the human eye? The human eye uses light and enables us to see objects around us. It has a lens in its structure. What is the function of the lens in a human eye? How do the lenses used in spectacles correct defects of vision? Let us consider these questions in this chapter.\n\nWe have learnt in the previous chapter about light and some of its properties. In this chapter, we shall use these ideas to study some of the optical phenomena in nature. We shall also discuss about rainbow formation, splitting of white light and blue colour of the sky.\n\n#### 10.1 THE HUMAN EYE\n\nThe human eye is one of the most valuable and sensitive sense organs. It enables us to see the wonderful world and the colours around us. On closing the eyes, we can identify objects to some extent by their smell, taste, sound they make or by touch. It is, however, impossible to identify colours while closing the eyes. Thus, of all the sense organs, the human eye is the most significant one as it enables us to see the beautiful, colourful world around us.\n\nThe human eye is like a camera. Its lens system forms an image on a light-sensitive screen called the retina. Light enters the eye through a thin membrane called the cornea. It forms the transparent bulge on the front surface of the eyeball as shown in Fig. 10.1. The eyeball is approximately spherical in shape with a diameter of about 2.3 cm. Most of the refraction for the light rays entering the eye occurs at the outer surface of the cornea. The crystalline lens merely provides the finer adjustment of focal length required to focus\n\n![](_page_0_Figure_8.jpeg)\n\nobjects at different distances on the retina. We find a structure called *iris* behind the cornea. Iris is a dark muscular diaphragm that controls the size of the pupil. The pupil regulates and controls the amount of light\n\n*Figure 10.1 The human eye* entering the eye. The eye lens forms an inverted real image of the object on the retina. The retina is a delicate membrane having enormous number of light-sensitive cells. The light-sensitive cells get activated upon illumination and generate electrical signals. These signals are sent to the brain via the optic nerves. The brain interprets these signals, and finally, processes the information so that we perceive objects as they are.\n\n#### 10.1.1 Power of Accommodation\n\nThe eye lens is composed of a fibrous, jelly-like material. Its curvature can be modified to some extent by the ciliary muscles. The change in the curvature of the eye lens can thus change its focal length. When the muscles are relaxed, the lens becomes thin. Thus, its focal length increases. This enables us to see distant objects clearly. When you are looking at objects closer to the eye, the ciliary muscles contract. This increases the curvature of the eye lens. The eye lens then becomes thicker. Consequently, the focal length of the eye lens decreases. This enables us to see nearby objects clearly.\n\nThe ability of the eye lens to adjust its focal length is called accommodation. However, the focal length of the eye lens cannot be decreased below a certain minimum limit. Try to read a printed page by holding it very close to your eyes. You may see the image being blurred or feel strain in the eye. To see an object comfortably and distinctly, you must hold it at about 25 cm from the eyes. The minimum distance, at which objects can be seen most distinctly without strain, is called the least distance of distinct vision. It is also called the near point of the eye. For a young adult with normal vision, the near point is about 25 cm. The farthest point upto which the eye can see objects clearly is called the far point of the eye. It is infinity for a normal eye. You may note here a normal eye can see objects clearly that are between 25 cm and infinity.\n\nSometimes, the crystalline lens of people at old age becomes milky and cloudy. This condition is called cataract. This causes partial or complete loss of vision. It is possible to restore vision through a cataract surgery.\n\n## 10.2 DEFECTS OF VISION AND THEIR CORRECTION\n\nSometimes, the eye may gradually lose its power of accommodation. In such conditions, the person cannot see the objects distinctly and comfortably. The vision becomes blurred due to the refractive defects of the eye.\n\nThere are mainly three common refractive defects of vision. These are (i) myopia or near -sightedness, (ii) Hypermetropia or far sightedness, and (iii) Presbyopia. These defects can be corrected by the use of suitable spherical lenses. We discuss below these defects and their correction.\n\n#### (a) Myopia\n\nMyopia is also known as near sightedness. A person with myopia can see nearby objects clearly but cannot see distant objects distinctly. A person with this defect has the far point nearer than infinity. Such a person may see clearly upto a distance of a few metres. In a myopic eye, the image of a distant object is formed in front of the retina [Fig. 10.2 (b)] and not at the retina itself. This defect may arise due to (i) excessive curvature of the eye lens, or (ii) elongation of the eyeball. This defect can be corrected by using a concave lens of suitable power. This is illustrated in Fig. 10.2 (c). A concave lens of suitable power will bring the image back on to the\n\nretina and thus the defect is corrected.\n\n#### (b) Hypermetropia\n\nHypermetropia is also known as far-sightedness. A person with hypermetropia can see distant objects clearly but cannot see nearby objects distinctly. The near point, for the person, is farther away from the normal near point (25 cm). Such a person has to keep a reading material much beyond 25 cm from the eye for comfortable reading. This is because the light rays from a closeby object are focussed at a point behind the retina as shown in Fig. 10.3 (b). This defect arises either because (i) the focal length of the eye lens is too long, or (ii) the eyeball has become too small. This defect can be corrected by using a convex lens of appropriate power. This is illustrated in Fig. 10.3 (c). Eye-glasses with converging lenses provide the additional focussing power required for forming the image on the retina.\n\n#### (c) Presbyopia\n\nThe power of accommodation of the eye usually decreases with ageing. For most people, the near point gradually recedes away. They find it difficult to see nearby objects comfortably and distinctly without corrective eye-glasses. This defect is called Presbyopia. It arises due to the gradual\n\n![](_page_2_Figure_7.jpeg)\n\n![](_page_2_Figure_8.jpeg)\n\n*(a), (b) The myopic eye, and (c) correction for myopia with a concave lens*\n\n![](_page_2_Figure_10.jpeg)\n\n![](_page_2_Figure_11.jpeg)\n\n#### *Figure 10.3*\n\n*(a), (b) The hypermetropic eye, and (c) correction for hypermetropia*\n\n- *N = Near point of a hypermetropic eye.*\n- *N' = Near point of a normal eye.*\n\nweakening of the ciliary muscles and diminishing flexibility of the eye lens. Sometimes, a person may suffer from both myopia and hypermetropia. Such people often require bi-focal lenses. A common type of bi-focal lenses consists of both concave and convex lenses. The upper portion consists of a concave lens. It facilitates distant vision. The lower part is a convex lens. It facilitates near vision.\n\n These days, it is possible to correct the refractive defects with contact lenses or through surgical interventions.\n\n# QUESTIONS\n\n- 1. What is meant by power of accommodation of the eye?\n- 2. A person with a myopic eye cannot see objects beyond 1.2 m distinctly. What should be the type of the corrective lens used to restore proper vision?\n- 3. What is the far point and near point of the human eye with normal vision?\n- 4. A student has difficulty reading the blackboard while sitting in the last row. What could be the defect the child is suffering from? How can it be corrected?\n\n![](_page_3_Picture_7.jpeg)\n\n*You talk of wondrous things you see, You say the sun shines bright; I feel him warm, but how can he Or make it day or night*?\n\n– C. CIBBER\n\n?\n\nDo you know that our eyes can live even after our death? By donating our eyes after we die, we can light the life of a blind person.\n\nAbout 35 million people in the developing world are blind and most of them can be cured. About 4.5 million people with corneal blindness can be cured through corneal transplantation of donated eyes. Out of these 4.5 million, 60% are children below the age of 12. So, if we have got the gift of vision, why not pass it on to somebody who does not have it? What do we have to keep in mind when eyes have to be donated?\n\nn Eye donors can belong to any age group or sex. People who use spectacles, or those operated for cataract, can still donate the eyes. People who are diabetic, have hypertension, asthma patients and those without communicable diseases can also donate eyes.\n\n- n Eyes must be removed within 4-6 hours after death. Inform the nearest eye bank immediately.\n- n The eye bank team will remove the eyes at the home of the deceased or at a hospital.\n- n Eye removal takes only 10-15 minutes. It is a simple process and does not lead to any disfigurement.\n- n Persons who were infected with or died because of AIDS, Hepatitis B or C, rabies, acute leukaemia, tetanus, cholera, meningitis or encephalitis cannot donate eyes. An eye bank collects, evaluates and distributes the donated eyes. All eyes donated are evaluated using strict medical standards. Those donated eyes found unsuitable for transplantation are used for valuable research and medical education. The identities\n\nof both the donor and the recipient remain confidential.\n\nOne pair of eyes gives vision to up to FOUR CORNEAL BLIND PEOPLE.\n\n# 10.3 REFRACTION OF LIGHT THROUGH A PRISM\n\nYou have learnt how light gets refracted through a rectangular glass slab. For parallel refracting surfaces, as in a glass slab, the emergent ray is parallel to the incident ray. However, it is slightly displaced laterally. How would light get refracted through a transparent prism? Consider a triangular glass prism. It has two triangular bases and three rectangular lateral surfaces. These surfaces are inclined to each other. The angle between its two lateral faces is called the angle of the prism. Let us now do an activity to study the refraction of light through a triangular glass prism.\n\n# Activity 10.1\n\n- n Fix a sheet of white paper on a drawing board using drawing pins.\n- n Place a glass prism on it in such a way that it rests on its triangular base. Trace the outline of the prism using a pencil.\n- n Draw a straight line PE inclined to one of the refracting surfaces, say AB, of the prism.\n- n Fix two pins, say at points P and Q, on the line PE as shown in Fig. 10.4.\n- n Look for the images of the pins, fixed at P and Q, through the other face AC.\n- n Fix two more pins, at points R and S, such that the pins at R and S and the images of the pins at P and Q lie on the same straight line.\n- n Remove the pins and the glass prism.\n- n The line PE meets the boundary of the prism at point E (see Fig. 10.4). Similarly, join and produce the points R and S. Let these lines meet the boundary of the prism at E and F, respectively. Join E and F.\n- n Draw perpendiculars to the refracting surfaces AB and AC of the prism at points E and F, respectively.\n- <sup>n</sup> Mark the angle of incidence (∠i), the angle of refraction (∠r) and the angle of emergence (∠e) as shown in Fig. 10.4.\n\n![](_page_5_Figure_0.jpeg)\n\nHere PE is the incident ray, EF is the refracted ray and FS is the emergent ray. You may note that a ray of light is entering from air to glass at the first surface AB. The light ray on refraction has bent towards the normal. At the second surface AC, the light ray has entered from glass to air. Hence it has bent away from normal. Compare the angle of incidence and the angle of refraction at each refracting surface of the prism. Is this similar to the kind of bending that occurs in a glass slab? The peculiar shape of the prism makes the emergent ray bend at an angle to the direction of the incident ray. This angle is called the angle of deviation. In this case ∠D is the angle of deviation. Mark the angle of deviation in the above activity and measure it.\n\n# 10.4 DISPERSION OF WHITE LIGHT BY A GLASS PRISM ASS PRISMASS PRISM\n\nYou must have seen and appreciated the spectacular colours in a rainbow. How could the white light of the Sun give us various colours of the rainbow? Before we take up this question, we shall first go back to the refraction of light through a prism. The inclined refracting surfaces of a glass prism show exciting phenomenon. Let us find it out through an activity.\n\n# Activity 10.2\n\n- n Take a thick sheet of cardboard and make a small hole or narrow slit in its middle.\n- n Allow sunlight to fall on the narrow slit. This gives a narrow beam of white light.\n- n Now, take a glass prism and allow the light from the slit to fall on one of its faces as shown in Fig. 10.5.\n- n Turn the prism slowly until the light that comes out of it appears on a nearby screen.\n- n What do you observe? You will find a beautiful band of colours. Why does this happen?\n\nThe prism has probably split the incident white light into a band of colours. Note the colours that appear at the two ends of the colour band. What is the sequence of colours that you see on the screen? The various colours seen are Violet, Indigo, Blue, Green, Yellow, Orange and Red, as shown in Fig. 10.5. The acronym VIBGYOR will help you to remember the sequence of colours. The band of the coloured components of a light beam is called its spectrum. You might not be able to see all the colours separately.\n\n![](_page_6_Figure_1.jpeg)\n\n*Figure 10.5 Dispersion of white light by the glass prism*\n\nYet something makes each colour distinct from the other. The splitting of light into its component colours is called dispersion.\n\nYou have seen that white light is dispersed into its seven-colour components by a prism. Why do we get these colours? Different colours of light bend through different angles with respect to the incident ray, as they pass through a prism. The red light bends the least while the violet the most. Thus the rays of each colour emerge along different paths and thus become distinct. It is the band of distinct colours that we see in a spectrum.\n\nIsaac Newton was the first to use a glass prism to obtain the spectrum of sunlight. He tried to split the colours of the spectrum of white light further by using another similar prism. However, he could not get any more colours. He then placed a second identical prism in an inverted position with respect to the first prism, as shown in Fig. 10.6. This allowed all the colours of the spectrum to pass through the second prism. He found a beam of white light emerging from the other side of the second prism. This observation gave Newton the idea that the sunlight is made up of seven colours.\n\nAny light that gives a spectrum similar to that of sunlight is often referred to as white light.\n\nA rainbow is a natural spectrum appearing in the sky after a rain shower (Fig. 10.7). It is caused by dispersion of sunlight by tiny water droplets, present in the atmosphere. A rainbow is always formed in a direction opposite to that of the Sun. The water droplets act like small prisms. They refract and disperse the incident sunlight, then reflect it internally, and finally refract it again when it comes out of the raindrop (Fig. 10.8). Due to the dispersion of light and internal reflection, different colours reach the observer's eye.\n\nYou can also see a rainbow on a sunny day when you look at the sky through a waterfall or through a water fountain, with the Sun behind you.\n\n![](_page_6_Figure_9.jpeg)\n\n*Figure 10.6 Recombination of the spectrum of white light*\n\n![](_page_6_Picture_11.jpeg)\n\n*Figure 10.7 Rainbow in the sky*\n\n![](_page_6_Figure_13.jpeg)\n\n*Figure 10.8 Rainbow formation*\n\n![](_page_7_Figure_0.jpeg)\n\n*Figure 10.9 Apparent star position due to atmospheric refraction*\n\n## 10.5 ATMOSPHERIC REFRACTION\n\nYou might have observed the apparent random wavering or flickering of objects seen through a turbulent stream of hot air rising above a fire or a radiator. The air just above the fire becomes hotter than the air further up. The hotter air is lighter (less dense) than the cooler air above it, and has a refractive index slightly less than that of the cooler air. Since the physical conditions of the refracting medium (air) are not stationary, the apparent position of the object, as seen through the hot air, fluctuates. This wavering is thus an effect of atmospheric refraction (refraction of light by the earth's atmosphere) on a small scale in our local environment. The twinkling of stars is a similar phenomenon on a much larger scale. Let us see how we can explain it.\n\n#### Twinkling of stars\n\nThe twinkling of a star is due to atmospheric refraction of starlight. The starlight, on entering the earth's atmosphere, undergoes refraction continuously before it reaches the earth. The atmospheric refraction occurs in a medium of gradually changing refractive index. Since the atmosphere bends starlight towards the normal, the apparent position of the star is slightly different from its actual position. The star appears slightly higher (above) than its actual position when viewed near the horizon (Fig. 10.9). Further, this apparent position of the star is not stationary, but keeps on changing slightly, since the physical conditions of the earth's atmosphere are not stationary, as was the case in the previous paragraph. Since the stars are very distant, they approximate point-sized sources of light. As the path of rays of light coming from the star goes on varying slightly, the apparent position of the star fluctuates and the amount of starlight entering the eye flickers – the star sometimes appears brighter, and at some other time, fainter, which is the twinkling effect.\n\n![](_page_7_Figure_6.jpeg)\n\n*Figure 10.10 Atmospheric refraction effects at sunrise and sunset*\n\nWhy don't the planets twinkle? The planets are much closer to the earth, and are thus seen as extended sources. If we consider a planet as a collection of a large number of point-sized sources of light, the total variation in the amount of light entering our eye from all the individual point-sized sources will average out to zero, thereby nullifying the twinkling effect.\n\n#### Advance sunrise and delayed sunset\n\nThe Sun is visible to us about 2 minutes before the actual sunrise, and about 2 minutes after the actual sunset because of atmospheric refraction. By actual sunrise, we mean the actual crossing of the horizon by the Sun. Fig. 10.10 shows the actual and apparent positions of the Sun with respect to the horizon. The time difference between actual sunset and the apparent sunset is about 2 minutes. The apparent flattening of the Sun's disc at sunrise and sunset is also due to the same phenomenon.\n\n## 10.6 SCATTERING OF LIGHT\n\nThe interplay of light with objects around us gives rise to several spectacular phenomena in nature. The blue colour of the sky, colour of water in deep sea, the reddening of the sun at sunrise and the sunset are some of the wonderful phenomena we are familiar with. In the previous class, you have learnt about the scattering of light by colloidal particles. The path of a beam of light passing through a true solution is not visible. However, its path becomes visible through a colloidal solution where the size of the particles is relatively larger.\n\n### 10.6.1 Tyndall Effect\n\nThe earth's atmosphere is a heterogeneous mixture of minute particles. These particles include smoke, tiny water droplets, suspended particles of dust and molecules of air. When a beam of light strikes such fine particles, the path of the beam becomes visible. The light reaches us, after being reflected diffusely by these particles. The phenomenon of scattering of light by the colloidal particles gives rise to Tyndall effect which you have studied in Class IX. This phenomenon is seen when a fine beam of sunlight enters a smoke-filled room through a small hole. Thus, scattering of light makes the particles visible. Tyndall effect can also be observed when sunlight passes through a canopy of a dense forest. Here, tiny water droplets in the mist scatter light.\n\nThe colour of the scattered light depends on the size of the scattering particles. Very fine particles scatter mainly blue light while particles of larger size scatter light of longer wavelengths. If the size of the scattering particles is large enough, then, the scattered light may even appear white.\n\n## 10.6.2 Why is the colour of the clear Sky Blue?\n\nThe molecules of air and other fine particles in the atmosphere have size smaller than the wavelength of visible light. These are more effective in scattering light of shorter wavelengths at the blue end than light of longer wavelengths at the red end. The red light has a wavelength about 1.8 times greater than blue light. Thus, when sunlight passes through the atmosphere, the fine particles in air scatter the blue colour (shorter wavelengths) more strongly than red. The scattered blue light enters our eyes. If the earth had no atmosphere, there would not have been any scattering. Then, the sky would have looked dark. The sky appears dark to passengers flying at very high altitudes, as scattering is not prominent at such heights.\n\nYou might have observed that 'danger' signal lights are red in colour. Do you know why? The red is least scattered by fog or smoke. Therefore, it can be seen in the same colour at a distance.\n\n# What you have learnt\n\n- n The ability of the eye to focus on both near and distant objects, by adjusting its focal length, is called the accommodation of the eye.\n- n The smallest distance, at which the eye can see objects clearly without strain, is called the near point of the eye or the least distance of distinct vision. For a young adult with normal vision, it is about 25 cm.\n- n The common refractive defects of vision include myopia, hypermetropia and presbyopia. Myopia (short-sightedness – the image of distant objects is focussed before the retina) is corrected by using a concave lens of suitable power. Hypermetropia (far-sightedness – the image of nearby objects is focussed beyond the retina) is corrected by using a convex lens of suitable power. The eye loses its power of accommodation at old age.\n- n The splitting of white light into its component colours is called dispersion.\n- n Scattering of light causes the blue colour of sky.\n\n# EXERCISES\n\n- 1. The human eye can focus on objects at different distances by adjusting the focal length of the eye lens. This is due to\n  - (a) presbyopia. (b) accommodation.\n  - (c) near-sightedness. (d) far-sightedness.\n- 2. The human eye forms the image of an object at its (a) cornea. (b) iris. (c) pupil. (d) retina.\n- 3. The least distance of distinct vision for a young adult with normal vision is about (a) 25 m. (b) 2.5 cm. (c) 25 cm. (d) 2.5 m.\n- 4. The change in focal length of an eye lens is caused by the action of the\n  - (a) pupil. (b) retina. (c) ciliary muscles. (d) iris.\n- 5. A person needs a lens of power –5.5 dioptres for correcting his distant vision. For correcting his near vision he needs a lens of power +1.5 dioptre. What is the focal length of the lens required for correcting (i) distant vision, and (ii) near vision?\n- 6. The far point of a myopic person is 80 cm in front of the eye. What is the nature and power of the lens required to correct the problem?\n- 7. Make a diagram to show how hypermetropia is corrected. The near point of a hypermetropic eye is 1 m. What is the power of the lens required to correct this defect? Assume that the near point of the normal eye is 25 cm.\n- 8. Why is a normal eye not able to see clearly the objects placed closer than 25 cm?\n- 9. What happens to the image distance in the eye when we increase the distance of an object from the eye?\n- 10. Why do stars twinkle?\n- 11. Explain why the planets do not twinkle.\n- 12. Why does the sky appear dark instead of blue to an astronaut?",
    "structured_data": {
      "error": "No structured data available"
    },
    "images": [
      {
        "name": "_page_0_Picture_0.jpeg",
        "path": "/home/content/converted_books/images/jesc110/_page_0_Picture_0.jpeg",
        "size_bytes": 5861,
        "description": "This image shows a vibrant rainbow arcing across a cloudy sky over a mountainous landscape with buildings. The photograph serves as an introductory visual for Chapter 10 on \"The Human Eye and the Colourful World,\" illustrating one of the natural optical phenomena that will be explained through the principles of light refraction and dispersion discussed in the chapter.",
        "description_generated_at": "2025-07-19 12:07:54"
      },
      {
        "name": "_page_0_Picture_2.jpeg",
        "path": "/home/content/converted_books/images/jesc110/_page_0_Picture_2.jpeg",
        "size_bytes": 10582,
        "description": "This image shows a QR code labeled \"1064CH11\" that appears at the beginning of Chapter 10 about \"The Human Eye and the Colourful World\" in a science textbook. The QR code likely provides students with digital access to additional learning resources, videos, or interactive content related to the chapter on human vision and optical phenomena.",
        "description_generated_at": "2025-07-19 12:07:54"
      },
      {
        "name": "_page_0_Figure_8.jpeg",
        "path": "/home/content/converted_books/images/jesc110/_page_0_Figure_8.jpeg",
        "size_bytes": 24924,
        "description": "This is a labeled cross-sectional diagram of the human eye showing its major anatomical parts including the cornea, pupil, iris, crystalline lens, aqueous humor, vitreous humor, retina, ciliary muscles, and optic nerve. The diagram illustrates how the eye functions like a camera by showing the spherical structure and arrangement of components that allow light to enter, focus, and form images on the retina.",
        "description_generated_at": "2025-07-19 12:07:54"
      },
      {
        "name": "_page_2_Figure_7.jpeg",
        "path": "/home/content/converted_books/images/jesc110/_page_2_Figure_7.jpeg",
        "size_bytes": 40891,
        "description": "This diagram illustrates myopia (nearsightedness) and its correction through three parts: (a) shows how a myopic eye can focus on nearby objects, (b) demonstrates how distant light rays focus in front of the retina in a myopic eye, and (c) shows how a concave lens corrects myopia by diverging light rays so they focus properly on the retina. The image uses ray diagrams with blue arrows to show the path of light through the eye and corrective lens.",
        "description_generated_at": "2025-07-19 12:07:54"
      },
      {
        "name": "_page_2_Figure_8.jpeg",
        "path": "/home/content/converted_books/images/jesc110/_page_2_Figure_8.jpeg",
        "size_bytes": 2348,
        "description": "This diagram illustrates myopia (nearsightedness) and its correction, showing how light rays from distant objects focus in front of the retina in a myopic eye, and how a concave (diverging) lens can redirect the light to focus properly on the retina. The figure demonstrates the optical principle behind correcting nearsightedness with eyeglasses that have negative-powered lenses.",
        "description_generated_at": "2025-07-19 12:07:54"
      },
      {
        "name": "_page_2_Figure_10.jpeg",
        "path": "/home/content/converted_books/images/jesc110/_page_2_Figure_10.jpeg",
        "size_bytes": 15069,
        "description": "This diagram illustrates the near point of a hypermetropic (farsighted) eye, showing how light rays from a nearby object at point N converge behind the retina instead of directly on it. The image demonstrates why people with hypermetropia have difficulty seeing close objects clearly, as their eye cannot focus near objects properly onto the retina.",
        "description_generated_at": "2025-07-19 12:07:54"
      },
      {
        "name": "_page_2_Figure_11.jpeg",
        "path": "/home/content/converted_books/images/jesc110/_page_2_Figure_11.jpeg",
        "size_bytes": 21750,
        "description": "This diagram illustrates hypermetropia (farsightedness) and its correction, showing how light rays from nearby objects focus behind the retina in the defective eye (top), and how a convex lens placed in front of the eye helps converge the light rays to focus properly on the retina (bottom). The labels N and N' indicate the near points of the hypermetropic eye and normal eye respectively, demonstrating how this vision defect affects close-up vision.",
        "description_generated_at": "2025-07-19 12:07:54"
      },
      {
        "name": "_page_3_Picture_7.jpeg",
        "path": "/home/content/converted_books/images/jesc110/_page_3_Picture_7.jpeg",
        "size_bytes": 11301,
        "description": "This image shows a \"Think it over\" section header with a close-up photograph of human eyes, likely serving as a reflective prompt for students to consider the importance of vision and eye donation after learning about eye defects and their corrections. The image reinforces the chapter's transition from technical concepts about vision correction to the social awareness topic of eye donation that follows in the text.",
        "description_generated_at": "2025-07-19 12:07:54"
      },
      {
        "name": "_page_5_Figure_0.jpeg",
        "path": "/home/content/converted_books/images/jesc110/_page_5_Figure_0.jpeg",
        "size_bytes": 49886,
        "description": "This diagram illustrates the refraction of light through a triangular glass prism, showing how a light ray bends as it enters and exits the prism at different angles. The figure labels the incident ray (PE), refracted ray (EF), and emergent ray (FS), along with key angles including incidence, refraction, emergence, and deviation to demonstrate how light changes direction when passing through different media.",
        "description_generated_at": "2025-07-19 12:07:54"
      },
      {
        "name": "_page_6_Figure_1.jpeg",
        "path": "/home/content/converted_books/images/jesc110/_page_6_Figure_1.jpeg",
        "size_bytes": 19294,
        "description": "This diagram shows a triangular glass prism splitting a white light beam into its component colors (violet, indigo, blue, green, yellow, orange, and red), demonstrating the phenomenon of light dispersion. The image illustrates how white light enters the prism as a single beam and emerges as a spectrum of colors, with each color bending at a different angle as it passes through the glass.",
        "description_generated_at": "2025-07-19 12:07:54"
      },
      {
        "name": "_page_6_Figure_9.jpeg",
        "path": "/home/content/converted_books/images/jesc110/_page_6_Figure_9.jpeg",
        "size_bytes": 15599,
        "description": "This diagram illustrates the recombination of white light using two triangular prisms, where the first prism disperses white light into its component colors (red R, violet V, etc.), and the second inverted prism recombines these separated colors back into white light that appears on a screen. The diagram demonstrates that white light is composed of multiple colors and can be both separated and recombined using prisms.",
        "description_generated_at": "2025-07-19 12:07:54"
      },
      {
        "name": "_page_6_Picture_11.jpeg",
        "path": "/home/content/converted_books/images/jesc110/_page_6_Picture_11.jpeg",
        "size_bytes": 21226,
        "description": "This image shows a beautiful natural rainbow arcing across a cloudy sky above a mountainous landscape. It serves as a real-world example to illustrate how sunlight undergoes dispersion through water droplets in the atmosphere, demonstrating the natural formation of the visible light spectrum discussed in the chapter on light and optics.",
        "description_generated_at": "2025-07-19 12:07:54"
      },
      {
        "name": "_page_6_Figure_13.jpeg",
        "path": "/home/content/converted_books/images/jesc110/_page_6_Figure_13.jpeg",
        "size_bytes": 13890,
        "description": "This diagram illustrates how a rainbow forms by showing sunlight entering a water droplet (raindrop) and undergoing refraction, internal reflection, and dispersion to separate white light into its component colors. The image demonstrates the optical process behind rainbow formation, with arrows showing the path of light as it bends and reflects within the droplet before emerging as dispersed colored light.",
        "description_generated_at": "2025-07-19 12:07:54"
      },
      {
        "name": "_page_7_Figure_0.jpeg",
        "path": "/home/content/converted_books/images/jesc110/_page_7_Figure_0.jpeg",
        "size_bytes": 14417,
        "description": "This diagram illustrates how atmospheric refraction causes stars to appear in slightly different positions than their actual locations. The image shows light from a star bending as it passes through Earth's atmosphere (which has an increasing refractive index closer to the surface), making the star appear higher in the sky than it actually is to an observer on Earth.",
        "description_generated_at": "2025-07-19 12:07:54"
      },
      {
        "name": "_page_7_Figure_6.jpeg",
        "path": "/home/content/converted_books/images/jesc110/_page_7_Figure_6.jpeg",
        "size_bytes": 21378,
        "description": "This diagram illustrates how atmospheric refraction causes the Sun to appear above the horizon even when it is actually below it. The image shows Earth with its atmosphere, an observer, and two positions of the Sun - its actual position below the horizon and its apparent position above the horizon due to light bending through the atmosphere, explaining why we see advanced sunrise and delayed sunset.",
        "description_generated_at": "2025-07-19 12:07:54"
      }
    ],
    "exercises": [
      {
        "question": "What is meant by power of accommodation of the eye?",
        "answer": "The power of accommodation of the eye refers to the ability of the eye lens to adjust its focal length automatically to focus on objects at different distances. This is achieved through the action of ciliary muscles that can change the curvature of the eye lens. When viewing distant objects, the ciliary muscles relax, making the lens thinner and increasing its focal length. When viewing nearby objects, the ciliary muscles contract, making the lens thicker and decreasing its focal length. This adjustment allows us to see objects clearly whether they are far away or close to us."
      },
      {
        "question": "A person with a myopic eye cannot see objects beyond 1.2 m distinctly. What should be the type of the corrective lens used to restore proper vision?",
        "answer": "A concave lens should be used to correct myopia. In this case, the person's far point is 1.2 m instead of infinity. A concave lens of suitable power will diverge the light rays before they enter the eye, effectively moving the image formation back onto the retina. The power of the required lens can be calculated using the formula P = 1/f, where f is the focal length. For this person, a concave lens with focal length of -1.2 m (power = -0.83 D) would be needed to correct the vision defect."
      },
      {
        "question": "What is the far point and near point of the human eye with normal vision?",
        "answer": "For a human eye with normal vision: (1) Near point: The closest distance at which objects can be seen clearly without strain, which is about 25 cm for a young adult. This is also called the least distance of distinct vision. (2) Far point: The farthest distance up to which the eye can see objects clearly, which is infinity for a normal eye. This means a normal eye can focus on objects from 25 cm to infinity without any difficulty."
      },
      {
        "question": "A student has difficulty reading the blackboard while sitting in the last row. What could be the defect the child is suffering from? How can it be corrected?",
        "answer": "The student is likely suffering from myopia (near-sightedness). This defect makes it difficult to see distant objects clearly, such as text on a blackboard from the back of the classroom, while near objects can be seen clearly. Myopia occurs when the eye lens has excessive curvature or the eyeball is elongated, causing the image of distant objects to form in front of the retina instead of on it. This defect can be corrected by using spectacles with concave lenses of appropriate power, which will diverge the light rays and bring the image back onto the retina."
      },
      {
        "question": "The human eye can focus on objects at different distances by adjusting the focal length of the eye lens. This is due to (a) presbyopia. (b) accommodation. (c) near-sightedness. (d) far-sightedness.",
        "answer": "(b) accommodation. The ability of the eye lens to adjust its focal length to focus on objects at different distances is called accommodation. This process involves the ciliary muscles changing the curvature of the eye lens - relaxing for distant vision (making lens thinner) and contracting for near vision (making lens thicker). Presbyopia is an age-related loss of accommodation, while near-sightedness and far-sightedness are refractive defects."
      },
      {
        "question": "The human eye forms the image of an object at its (a) cornea. (b) iris. (c) pupil. (d) retina.",
        "answer": "(d) retina. The human eye forms images on the retina, which is a light-sensitive screen at the back of the eye. The retina contains numerous light-sensitive cells that get activated when light falls on them, generating electrical signals that are sent to the brain via optic nerves. The cornea is the transparent front layer, the iris controls the pupil size, and the pupil regulates light entry, but the actual image formation occurs on the retina."
      },
      {
        "question": "The least distance of distinct vision for a young adult with normal vision is about (a) 25 m. (b) 2.5 cm. (c) 25 cm. (d) 2.5 m.",
        "answer": "(c) 25 cm. The least distance of distinct vision, also called the near point, is the minimum distance at which objects can be seen clearly without strain. For a young adult with normal vision, this distance is about 25 cm. Objects placed closer than this distance appear blurred and cause eye strain because the eye lens cannot increase its curvature beyond a certain limit."
      },
      {
        "question": "The change in focal length of an eye lens is caused by the action of the (a) pupil. (b) retina. (c) ciliary muscles. (d) iris.",
        "answer": "(c) ciliary muscles. The ciliary muscles are responsible for changing the focal length of the eye lens through the process of accommodation. When these muscles contract, they increase the curvature of the lens (decreasing focal length for near vision), and when they relax, they decrease the curvature (increasing focal length for distant vision). The pupil controls light entry, the retina receives images, and the iris controls pupil size."
      },
      {
        "question": "A person needs a lens of power –5.5 dioptres for correcting his distant vision. For correcting his near vision he needs a lens of power +1.5 dioptre. What is the focal length of the lens required for correcting (i) distant vision, and (ii) near vision?",
        "answer": "Using the relationship P = 1/f, where P is power in dioptres and f is focal length in meters: (i) For distant vision: P = -5.5 D, so f = 1/(-5.5) = -0.18 m = -18 cm. The negative sign indicates a concave lens. (ii) For near vision: P = +1.5 D, so f = 1/(+1.5) = +0.67 m = +67 cm. The positive sign indicates a convex lens. This person needs bifocal lenses with a concave lens (focal length 18 cm) for distant vision and a convex lens (focal length 67 cm) for near vision."
      },
      {
        "question": "The far point of a myopic person is 80 cm in front of the eye. What is the nature and power of the lens required to correct the problem?",
        "answer": "A concave lens is required to correct myopia. To find the power: The person can see clearly only up to 80 cm, but needs to see up to infinity. The lens should form a virtual image at 80 cm of an object placed at infinity. Using lens formula: 1/f = 1/v - 1/u, where u = ∞ (object at infinity), v = -80 cm = -0.8 m (virtual image). Therefore: 1/f = 1/(-0.8) - 1/∞ = -1/0.8 = -1.25. So f = -0.8 m. Power P = 1/f = 1/(-0.8) = -1.25 D. A concave lens of power -1.25 dioptres is required."
      },
      {
        "question": "Make a diagram to show how hypermetropia is corrected. The near point of a hypermetropic eye is 1 m. What is the power of the lens required to correct this defect? Assume that the near point of the normal eye is 25 cm.",
        "answer": "Hypermetropia is corrected using a convex lens. The lens should form a virtual image at the person's near point (1 m) of an object placed at the normal near point (25 cm). Using lens formula: 1/f = 1/v - 1/u, where u = -25 cm = -0.25 m (object), v = -100 cm = -1 m (virtual image at person's near point). Therefore: 1/f = 1/(-1) - 1/(-0.25) = -1 + 4 = 3. So f = 1/3 m = 0.33 m. Power P = 1/f = 1/0.33 = +3 D. A convex lens of power +3 dioptres is required. [Diagram would show: hypermetropic eye with image forming behind retina, then corrected with convex lens bringing image onto retina]"
      },
      {
        "question": "Why is a normal eye not able to see clearly the objects placed closer than 25 cm?",
        "answer": "A normal eye cannot see objects clearly when placed closer than 25 cm because of the limited accommodation power of the eye lens. The ciliary muscles can contract only to a certain maximum extent, which limits how much the curvature of the eye lens can be increased. When the curvature reaches its maximum, the focal length cannot be decreased further. For objects closer than 25 cm, the required focal length would be less than this minimum possible value, so the image would form behind the retina, appearing blurred. Additionally, viewing objects too close causes strain on the ciliary muscles, leading to discomfort."
      },
      {
        "question": "What happens to the image distance in the eye when we increase the distance of an object from the eye?",
        "answer": "When we increase the distance of an object from the eye, the image distance in the eye remains essentially constant. This is because the image is always formed on the retina, which is at a fixed distance from the eye lens (approximately 2.5 cm). However, to maintain the image on the retina as object distance increases, the eye lens adjusts its focal length through accommodation. For distant objects, the ciliary muscles relax, making the lens thinner and increasing its focal length. This ensures that regardless of object distance (within the eye's range), the image is always formed at the same distance - on the retina."
      },
      {
        "question": "Why do stars twinkle?",
        "answer": "Stars twinkle due to atmospheric refraction. As starlight enters Earth's atmosphere, it passes through layers of air with different densities and temperatures, causing continuous refraction. Since atmospheric conditions are constantly changing, the path of starlight keeps varying slightly, making the star's apparent position fluctuate. Stars appear as point sources of light due to their vast distance, so small changes in the light path cause noticeable variations in brightness - the star appears to twinkle. The varying amount of starlight reaching our eyes creates the twinkling effect, with stars appearing brighter or fainter alternately."
      },
      {
        "question": "Explain why the planets do not twinkle.",
        "answer": "Planets do not twinkle because they are much closer to Earth than stars and appear as extended sources of light rather than point sources. A planet can be considered as a collection of many point-sized sources of light. While atmospheric refraction affects each of these point sources individually, causing them to vary in brightness, the combined effect from all these sources averages out to zero. The total variation in light entering our eyes from all the individual point sources of the planet cancels out, eliminating the twinkling effect. Thus, planets appear as steady sources of light."
      },
      {
        "question": "Why does the sky appear dark instead of blue to an astronaut?",
        "answer": "The sky appears dark to an astronaut because there is no atmosphere in space to scatter sunlight. The blue color of the sky on Earth is due to the scattering of sunlight by tiny particles and molecules in the atmosphere. These particles scatter blue light (shorter wavelengths) more effectively than red light (longer wavelengths), making the sky appear blue. In space, there are no air molecules or particles to scatter light, so there is no scattering phenomenon. Without scattering, astronauts see the black darkness of space with stars appearing as bright points of light against this dark background."
      }
    ],
    "summary": {
      "title": "The Human Eye and the Colourful World",
      "key_concepts": [
        "Structure and functioning of the human eye, including accommodation",
        "Common vision defects (myopia, hypermetropia, presbyopia) and their correction using lenses",
        "Refraction and dispersion of light through prisms, rainbow formation",
        "Atmospheric refraction effects - twinkling of stars, sunrise/sunset phenomena",
        "Scattering of light - Tyndall effect and blue color of the sky"
      ],
      "summary": "This chapter explores the human eye as an optical instrument and various optical phenomena in nature. It begins with the anatomy and functioning of the human eye, explaining how accommodation allows us to see objects at different distances. The chapter then discusses common vision defects like myopia, hypermetropia, and presbyopia, and how they can be corrected using appropriate lenses. The study of light refraction through prisms leads to understanding dispersion and rainbow formation. The chapter concludes with atmospheric optical phenomena, explaining why stars twinkle, why planets don't, and why the sky appears blue due to light scattering. These concepts demonstrate the practical applications of optics in understanding both human vision and natural phenomena."
    }
  },
  "statistics": {
    "total_images": 15,
    "text_length": 24406,
    "processing_time": 7.4
  },
  "claude_processing": {
    "processed_at": "2025-07-19 12:07:54",
    "model_used": "claude-sonnet-4-20250514",
    "tasks_completed": [
      "exercises",
      "answers",
      "summary",
      "image_descriptions"
    ],
    "exercises_count": 16,
    "images_processed": 15
  },
  "title": "The Human Eye and the Colorful World"
}