{
  "source_file": "/home/content/books/science/jesc112.pdf",
  "filename": "jesc112.pdf",
  "subject": "science",
  "conversion_timestamp": "2025-07-18T12:10:46.692245",
  "processing_time_seconds": 11.17,
  "metadata": "md",
  "content": {
    "markdown_text": "![](_page_0_Picture_0.jpeg)\n\n![](_page_0_Picture_1.jpeg)\n\nI n the previous Chapter on 'Electricity' we learnt about the heating effects of electric current. What could be the other effects of electric current? We know that an electric current-carrying wire behaves like a magnet. Let us perform the following Activity to reinforce it.\n\nActivity 12.1\n\n- n Take a straight thick copper wire and place it between the points X and Y in an electric circuit, as shown in Fig. 12.1. The wire XY is kept perpendicular to the plane of paper.\n- n Horizontally place a small compass near to this copper wire. See the position of its needle.\n- n Pass the current through the circuit by inserting the key into the plug.\n- n Observe the change in the position of the compass needle.\n\n![](_page_0_Figure_8.jpeg)\n\n![](_page_0_Figure_9.jpeg)\n\nWe see that the needle is deflected. What does it mean? It means that the electric current through the copper wire has produced a magnetic effect. Thus we can say that electricity and magnetism are linked to each other. Then, what about the reverse possibility of an electric effect of moving magnets? In this Chapter we will study magnetic fields and such electromagnetic effects. We shall also study about electromagnets which involve the magnetic effect of electric current.\n\n#### Hans Christian Oersted (1777–1851)\n\nHans Christian Oersted, one of the leading scientists of the 19th century, played a crucial role in understanding *electromagnetism*. In 1820 he accidentally discovered that a compass needle got deflected when an electric current passed through a metallic wire placed nearby. Through this observation Oersted showed that electricity and magnetism were related phenomena. His research later created technologies such as the radio, television and fiber optics. The unit of magnetic field strength is named the oersted in his honor.\n\n![](_page_0_Picture_13.jpeg)\n\n## 12.1 MAGNETIC FIELD AND FIELD LINES\n\nWe are familiar with the fact that a compass needle gets deflected when brought near a bar magnet. A compass needle is, in fact, a small bar magnet. The ends of the compass needle point approximately towards north and south directions. The end pointing towards north is called *north seeking* or north pole. The other end that points towards south is called *south seeking* or south pole. Through various activities we have observed that like poles repel, while unlike poles of magnets attract each other.\n\n![](_page_1_Picture_2.jpeg)\n\n1. Why does a compass needle get deflected when brought near a bar magnet?\n\n## Activity 12.2\n\n- n Fix a sheet of white paper on a drawing board using some adhesive material.\n- n Place a bar magnet in the centre of it.\n- n Sprinkle some iron filings uniformly around the bar magnet (Fig. 12.2). A salt-sprinkler may be used for this purpose.\n- n Now tap the board gently.\n- <sup>n</sup> What do you observe? *Figure 12.2*\n\n![](_page_1_Picture_10.jpeg)\n\n*Iron filings near the bar magnet align themselves along the field lines.*\n\n?\n\nThe iron filings arrange themselves in a pattern as shown Fig. 12.2. Why do the iron filings arrange in such a pattern? What does this pattern demonstrate? The magnet exerts its influence in the region surrounding it. Therefore the iron filings experience a force. The force thus exerted makes iron filings to arrange in a pattern. The region surrounding a magnet, in which the force of the magnet can be detected, is said to have a magnetic field. The lines along which the iron filings align themselves represent magnetic field lines.\n\nAre there other ways of obtaining magnetic field lines around a bar magnet? Yes, you can yourself draw the field lines of a bar magnet.\n\n## Activity 12.3\n\n- n Take a small compass and a bar magnet.\n- n Place the magnet on a sheet of white paper fixed on a drawing board, using some adhesive material.\n- n Mark the boundary of the magnet.\n- n Place the compass near the north pole of the magnet. How does it behave? The south pole of the needle points towards the north pole of the magnet. The north pole of the compass is directed away from the north pole of the magnet.\n\n- n Mark the position of two ends of the needle.\n- n Now move the needle to a new position such that its south pole occupies the position previously occupied by its north pole.\n- n In this way, proceed step by step till you reach the south pole of the magnet as shown in Fig. 12.3.\n- n Join the points marked on the paper by a smooth curve. This curve represents a field line.\n- n Repeat the above procedure and draw as many lines as you can. You will get a pattern shown in Fig. 12.4. These lines represent the magnetic field around the magnet. These are known as magnetic field lines.\n- n Observe the deflection in the compass needle as you move it along a field line. The deflection increases as the needle is moved towards the poles.\n\n![](_page_2_Picture_6.jpeg)\n\n*Figure 12.3 Drawing a magnetic field line with the help of a compass needle*\n\n![](_page_2_Figure_8.jpeg)\n\n![](_page_2_Figure_9.jpeg)\n\nMagnetic field is a quantity that has both direction and magnitude. The direction of the magnetic field is taken to be the direction in which a north pole of the compass needle moves inside it. Therefore it is taken by convention that the field lines emerge from north pole and merge at the south pole (note the arrows marked on the field lines in Fig. 12.4). Inside the magnet, the direction of field lines is from its south pole to its north pole. Thus the magnetic field lines are closed curves.\n\nThe relative strength of the magnetic field is shown by the degree of closeness of the field lines. The field is stronger, that is, the force acting on the pole of another magnet placed is greater where the field lines are crowded (see Fig. 12.4).\n\nNo two field-lines are found to cross each other. If they did, it would mean that at the point of intersection, the compass needle would point towards two directions, which is not possible.\n\n## 12.2 MAGNETIC FIELD DUE TO A CURRENT-CARRYING ARRYING CONDUCTOR\n\nIn Activity 12.1, we have seen that an electric current through a metallic conductor produces a magnetic field around it. In order to find the direction of the field produced let us repeat the activity in the following way –\n\n## Activity 12.4\n\n- n Take a long straight copper wire, two or three cells of 1.5 V each, and a plug key. Connect all of them in series as shown in Fig. 12.5 (a).\n- n Place the straight wire parallel to and over a compass needle.\n- n Plug the key in the circuit.\n- n Observe the direction of deflection of the north pole of the needle. If the current flows from north to south, as shown in Fig. 12.5 (a), the north pole of the compass needle would move towards the east.\n- n Replace the cell connections in the circuit as shown in Fig. 12.5 (b). This would result in the change of the direction of current through the copper wire, that is, from south to north.\n- n Observe the change in the direction of deflection of the needle. You will see that now the needle moves in opposite direction, that is, towards the west [Fig. 12.5 (b)]. It means that the direction of magnetic field produced by the electric current is also reversed.\n\n![](_page_3_Figure_7.jpeg)\n\n*Figure 12.5 A simple electric circuit in which a straight copper wire is placed parallel to and over a compass needle. The deflection in the needle becomes opposite when the direction of the current is reversed.*\n\n## 12.2.1 Magnetic Field due to a Current through a Straight Conductor\n\nWhat determines the pattern of the magnetic field generated by a current through a conductor? Does the pattern depend on the shape of the conductor? We shall investigate this with an activity.\n\nWe shall first consider the pattern of the magnetic field around a straight conductor carrying current.\n\n## Activity 12.5\n\n- n Take a battery (12 V), a variable resistance (or a rheostat), an ammeter (0–5 A), a plug key, connecting wires and a long straight thick copper wire.\n- n Insert the thick wire through the centre, normal to the plane of a rectangular cardboard. Take care that the cardboard is fixed and does not slide up or down.\n\n- n Connect the copper wire vertically between the points X and Y, as shown in Fig. 12.6 (a), in series with the battery, a plug and key.\n- n Sprinkle some iron filings uniformly on the cardboard. (You may use a salt sprinkler for this purpose.)\n- n Keep the variable of the rheostat at a fixed position and note the current through the ammeter.\n- n Close the key so that a current flows through the wire. Ensure that the copper wire placed between the points X and Y remains vertically straight.\n- n Gently tap the cardboard a few times. Observe the pattern of the iron filings. You would find that the iron filings align themselves showing a pattern of concentric circles around the copper wire (Fig. 12.6).\n- n What do these concentric circles represent? They represent the magnetic field lines.\n- n How can the direction of the magnetic field be found? Place a compass at a point (say P) over a circle. Observe the direction of the needle. The direction of the north pole of the compass needle would give the direction of the field lines produced by the electric current through the straight wire at point P. Show the direction by an arrow.\n- n Does the direction of magnetic field lines get reversed if the direction of current through the straight copper wire is reversed? Check it.\n\n![](_page_4_Figure_8.jpeg)\n\n#### *(a) A pattern of concentric circles indicating the field lines of a magnetic field around a straight conducting wire. The arrows in the circles show the direction of the field lines. (b) A close up of the pattern obtained.*\n\nWhat happens to the deflection of the compass needle placed at a given point if the current in the copper wire is changed? To see this, vary the current in the wire. We find that the deflection in the needle also changes. In fact, if the current is increased, the deflection also increases. It indicates that the magnitude of the magnetic field produced at a given point increases as the current through the wire increases.\n\nWhat happens to the deflection of the needle if the compass is moved away from the copper wire but the current through the wire remains the same? To see this, now place the compass at a farther point from the conducting wire (say at point Q). What change do you observe? We see that the deflection in the needle decreases. Thus the magnetic field produced by a given current in the conductor decreases as the distance from it increases. From Fig. 12.6, it can be noticed that the concentric circles representing the magnetic field around a current-carrying straight wire become larger and larger as we move away from it.\n\n#### 12.2.2 Right-Hand Thumb Rule\n\nA convenient way of finding the direction of magnetic field associated with a current-carrying conductor is given in Fig. 12.7.\n\n![](_page_5_Figure_0.jpeg)\n\n*Figure 12.7 Right-hand thumb rule*\n\nImagine that you are holding a current-carrying straight conductor in your right hand such that the thumb points towards the direction of current. Then your fingers will wrap around the conductor in the direction of the field lines of the magnetic field, as shown in Fig. 12.7. This is known as the right-hand thumb rule\\*.\n\n#### Example 12.1\n\nA current through a horizontal power line flows in east to west direction. What is the direction of magnetic field at a point directly below it and at a point directly above it?\n\n#### Solution\n\nThe current is in the east-west direction. Applying the right-hand thumb rule, we get that the magnetic field (at any point below or above the wire) turns clockwise in a plane perpendicular to the wire, when viewed from the east end, and anti-clockwise, when viewed from the west end.\n\n![](_page_5_Figure_7.jpeg)\n\n## 12.2.3 Magnetic Field due to a Current through a Circular Loop\n\n![](_page_5_Picture_9.jpeg)\n\n*Figure 12.8 Magnetic field lines of the field produced by a current-carrying circular loop*\n\nWe have so far observed the pattern of the magnetic field lines produced around a current-carrying straight wire. Suppose this straight wire is bent in the form of a circular loop and a current is passed through it. How would the magnetic field lines look like? We know that the magnetic field produced by a current-carrying straight wire depends inversely on the distance from it. Similarly at every point of a current-carrying circular loop, the concentric circles representing the magnetic field around it would become larger and larger as we move away from the wire (Fig. 12.8). By the time we reach at the centre of the circular loop, the arcs of these *big* circles would appear as straight lines. Every point on the wire carrying current would give rise to the magnetic field appearing as straight lines at the center of the loop. By applying the right hand rule, it is easy to check that every section of the wire contributes to the magnetic field lines in the same direction within the loop.\n\n<sup>\\*</sup> *This rule is also called Maxwell's corkscrew rule. If we consider ourselves driving a corkscrew in the direction of the current, then the direction of the rotation of corkscrew is the direction of the magnetic field.*\n\nWe know that the magnetic field produced by a current-carrying wire at a given point depends directly on the current passing through it. Therefore, if there is a circular coil having n turns, the field produced is n times as large as that produced by a single turn. This is because the current in each circular turn has the same direction, and the field due to each turn then just adds up.\n\n## Activity 12.6\n\n- n Take a rectangular cardboard having two holes. Insert a circular coil having large number of turns through them, normal to the plane of the cardboard.\n- n Connect the ends of the coil in series with a battery, a key and a rheostat, as shown in Fig. 12.9.\n- n Sprinkle iron filings uniformly on the cardboard.\n- n Plug the key.\n- n Tap the cardboard gently a few times. Note the pattern of the iron filings that emerges on the cardboard.\n\n![](_page_6_Figure_7.jpeg)\n\n*Figure 12.9 Magnetic field produced by a currentcarrying circular coil.*\n\n## 12.2.4 Magnetic Field due to a Current in a Solenoid\n\nA coil of many circular turns of insulated copper wire wrapped closely in the shape of a cylinder is called a solenoid. The pattern of the magnetic field lines around a current-carrying solenoid is shown in Fig. 12.10. Compare the pattern of the field with the magnetic field around a bar magnet (Fig. 12.4). Do they look similar? Yes, they are similar. In fact, one end of the solenoid behaves as a magnetic north pole, while the other behaves as the south pole. The field lines inside the solenoid are in the form of parallel straight lines. This indicates that the magnetic field is the same at all points inside the solenoid. That is, the field is uniform inside the solenoid.\n\nA strong magnetic field produced inside a solenoid can be used to magnetise a piece of magnetic material, like soft iron, when placed inside the coil (Fig. 12.11). The magnet so formed is called an electromagnet.\n\n![](_page_6_Figure_12.jpeg)\n\n![](_page_6_Picture_13.jpeg)\n\n*Figure 12.10 Field lines of the magnetic field through and around a current carrying solenoid.*\n\n![](_page_6_Figure_15.jpeg)\n\n*Figure 12.11 A current-carrying solenoid coil is used to magnetise steel rod inside it – an electromagnet.*\n\n#### 3. Choose the correct option.\n\nThe magnetic field inside a long straight solenoid-carrying current\n\n- (a) is zero.\n- (b) decreases as we move towards its end.\n- (c) increases as we move towards its end.\n- (d) is the same at all points.\n\n#### 12.3 FORCE ON A CURRENT-CARRYING CONDUCTOR IN A MAGNETIC FIELD\n\nWe have learnt that an electric current flowing through a conductor produces a magnetic field. The field so produced exerts a force on a magnet placed in the vicinity of the conductor. French scientist Andre Marie Ampere (1775–1836) suggested that the magnet must also exert an equal and opposite force on the current-carrying conductor. The force due to a magnetic field acting on a current-carrying conductor can be demonstrated through the following activity.\n\n## Activity 12.7\n\n- n Take a small aluminium rod AB (of about 5 cm). Using two connecting wires suspend it horizontally from a stand, as shown in Fig. 12.12.\n- n Place a strong horse-shoe magnet in such a way that the rod lies between the two poles with the magnetic field directed upwards. For this put the north pole of the magnet vertically below and south pole vertically above the aluminium rod (Fig. 12.12).\n- n Connect the aluminium rod in series with a battery, a key and a rheostat.\n- n Now pass a current through the aluminium rod from end B to end A.\n- n What do you observe? It is observed that the rod is displaced towards the left. You will notice that the rod gets displaced.\n- n Reverse the direction of current flowing through the rod and observe the direction of its displacement. It is now towards the right. Why does the rod get displaced?\n\n![](_page_7_Figure_15.jpeg)\n\n![](_page_7_Figure_16.jpeg)\n\nThe displacement of the rod in the above activity suggests that a force is exerted on the current-carrying aluminium rod when it is placed in a magnetic field. It also suggests that the direction of force is also reversed when the direction of current through the conductor is reversed. Now change the direction of field to vertically downwards by interchanging the two poles of the magnet. It is once again observed that\n\nthe direction of force acting on the current-carrying rod gets reversed. It shows that the direction of the force on the conductor depends upon the direction of current and the direction of the magnetic field. Experiments have shown that the displacement of the rod is largest (or the magnitude of the force is the highest) when the direction of current is at right angles to the direction of the magnetic field. In such a condition we can use a simple rule to find the direction of the force on the conductor.\n\nIn Activity 12.7, we considered the direction of the current and that of the magnetic field perpendicular to each other and found that the force is perpendicular to both of them. The three directions can be illustrated through a simple rule, called Fleming's left-hand rule. According to this rule, stretch the thumb, forefinger and middle finger of your left hand such that they are mutually perpendicular (Fig. 12.13). If the first finger points in the direction of magnetic field and the second finger in the direction of current, then the thumb will point in the direction of motion or the force acting on the conductor.\n\n![](_page_8_Figure_2.jpeg)\n\n*Figure 12.13 Fleming's left-hand rule*\n\n*Figure 12.14*\n\nDevices that use current-carrying conductors and magnetic fields include electric motor, electric generator, loudspeakers, microphones and measuring instruments.\n\n#### Example 12.2\n\nAn electron enters a magnetic field at right angles to it, as shown in Fig. 12.14. The direction of force acting on the electron will be\n\n- (a) to the right.\n- (b) to the left.\n- (c) out of the page.\n- (d) into the page.\n\n#### Solution\n\nAnswer is option (d). The direction of force is perpendicular to the direction of magnetic field and current as given by Fleming's left hand rule. Recall that the direction of current is taken opposite to the direction of motion of electrons. The force is therefore directed into the page.\n\n![](_page_8_Figure_13.jpeg)\n\n- 1. Which of the following property of a proton can change while it moves freely in a magnetic field? (There may be more than one correct answer.)\n\n  - (a) mass (b) speed\n  - (c) velocity (d) momentum\n\n?\n\n- 2. In Activity 12.7, how do we think the displacement of rod AB will be affected if (i) current in rod AB is increased; (ii) a stronger horse-shoe magnet is used; and (iii) length of the rod AB is increased?\n- 3. A positively-charged particle (alpha-particle) projected towards west is deflected towards north by a magnetic field. The direction of magnetic field is\n  - (a) towards south (b) towards east\n  - (c) downward (d) upward\n\n#### Magnetism in medicine\n\nMore to Know!\n\nAn electric current always produces a magnetic field. Even weak ion currents that travel along the nerve cells in our body produce magnetic fields. When we touch something, our nerves carry an electric impulse to the muscles we need to use. This impulse produces a temporary magnetic field. These fields are very weak and are about one-billionth of the earth's magnetic field. Two main organs in the human body where the magnetic field produced is significant, are the heart and the brain. The magnetic field inside the body forms the basis of obtaining the images of different body parts. This is done using a technique called Magnetic Resonance Imaging (MRI). Analysis of these images helps in medical diagnosis. Magnetism has, thus, got important uses in medicine.\n\n#### 12.4 DOMESTIC ELECTRIC CIRCUITS\n\nIn our homes, we receive supply of electric power through a main supply (also called mains), either supported through overhead electric poles or by underground cables. One of the wires in this supply, usually with red insulation cover, is called live wire (or positive). Another wire, with black insulation, is called neutral wire (or negative). In our country, the potential difference between the two is 220 V.\n\nAt the meter-board in the house, these wires pass into an electricity meter through a main fuse. Through the main switch they are connected to the line wires in the house. These wires supply electricity to separate circuits within the house. Often, two separate circuits are used, one of 15 A current rating for appliances with higher power ratings such as geysers, air coolers, etc. The other circuit is of 5 A current rating for bulbs, fans, etc. The earth wire, which has insulation of green colour, is usually connected to a metal plate deep in the earth near the house. This is used as a safety measure, especially for those appliances that have a metallic body, for example, electric press, toaster, table fan, refrigerator, etc. The metallic body is connected to the earth wire, which provides a low-resistance conducting path for the current. Thus, it ensures that any leakage of current to the metallic body of the appliance keeps its potential to that of the earth, and the user may not get a severe electric shock.\n\n![](_page_10_Figure_0.jpeg)\n\n*Figure 12.15 A schematic diagram of one of the common domestic circuits*\n\nFigure 12.15 gives a schematic diagram of one of the common domestic circuits. In each separate circuit, different appliances can be connected across the live and neutral wires. Each appliance has a separate switch to 'ON'/'OFF' the flow of current through it. In order that each appliance has equal potential difference, they are connected parallel to each other.\n\nElectric fuse is an important component of all domestic circuits. We have already studied the principle and working of a fuse in the previous chapter (see Section 11.7). A fuse in a circuit prevents damage to the appliances and the circuit due to overloading. Overloading can occur when the live wire and the neutral wire come into direct contact. (This occurs when the insulation of wires is damaged or there is a fault in the appliance.) In such a situation, the current in the circuit abruptly increases. This is called short-circuiting. The use of an electric fuse prevents the electric circuit and the appliance from a possible damage by stopping the flow of unduly high electric current. The Joule heating that takes place in the fuse melts it to break the electric circuit. Overloading can also occur due to an accidental hike in the supply voltage. Sometimes overloading is caused by connecting too many appliances to a single socket.\n\n![](_page_10_Figure_4.jpeg)\n\n# What you have learnt\n\n- n A compass needle is a small magnet. Its one end, which points towards north, is called a north pole, and the other end, which points towards south, is called a south pole.\n- n A magnetic field exists in the region surrounding a magnet, in which the force of the magnet can be detected.\n- n Field lines are used to represent a magnetic field. A field line is the path along which a hypothetical free north pole would tend to move. The direction of the magnetic field at a point is given by the direction that a north pole placed at that point would take. Field lines are shown closer together where the magnetic field is greater.\n- n A metallic wire carrying an electric current has associated with it a magnetic field. The field lines about the wire consist of a series of concentric circles whose direction is given by the right-hand rule.\n- n The pattern of the magnetic field around a conductor due to an electric current flowing through it depends on the shape of the conductor. The magnetic field of a solenoid carrying a current is similar to that of a bar magnet.\n- n An electromagnet consists of a core of soft iron wrapped around with a coil of insulated copper wire.\n- n A current-carrying conductor when placed in a magnetic field experiences a force. If the direction of the field and that of the current are mutually perpendicular to each other, then the force acting on the conductor will be perpendicular to both and will be given by Fleming's left-hand rule.\n- n In our houses we receive AC electric power of 220 V with a frequency of 50 Hz. One of the wires in this supply is with red insulation, called live wire. The other one is of black insulation, which is a neutral wire. The potential difference between the two is 220 V. The third is the earth wire that has green insulation and this is connected to a metallic body deep inside earth. It is used as a safety measure to ensure that any leakage of current to a metallic body does not give any severe shock to a user.\n- n Fuse is the most important safety device, used for protecting the circuits due to short-circuiting or overloading of the circuits.\n\n# EXERCISES\n\n- 1. Which of the following correctly describes the magnetic field near a long straight wire?\n  - (a) The field consists of straight lines perpendicular to the wire.\n  - (b) The field consists of straight lines parallel to the wire.\n  - (c) The field consists of radial lines originating from the wire.\n  - (d) The field consists of concentric circles centred on the wire.\n- 2. At the time of short circuit, the current in the circuit\n  - (a) reduces substantially.\n  - (b) does not change.\n  - (c) increases heavily.\n  - (d) vary continuously.\n- 3. State whether the following statements are true or false.\n  - (a) The field at the centre of a long circular coil carrying current will be parallel straight lines.\n  - (b) A wire with a green insulation is usually the live wire of an electric supply.\n- 4. List two methods of producing magnetic fields.\n- 5. When is the force experienced by a current–carrying conductor placed in a magnetic field largest?\n- 6. Imagine that you are sitting in a chamber with your back to one wall. An electron beam, moving horizontally from back wall towards the front wall, is deflected by a strong magnetic field to your right side. What is the direction of magnetic field?\n- 7. State the rule to determine the direction of a (i) magnetic field produced around a straight conductor-carrying current, (ii) force experienced by a current-carrying straight conductor placed in a magnetic field which is perpendicular to it, and (iii) current induced in a coil due to its rotation in a magnetic field.\n- 8. When does an electric short circuit occur?\n- 9. What is the function of an earth wire? Why is it necessary to earth metallic appliances?",
    "structured_data": {
      "error": "No structured data available"
    },
    "images": [
      {
        "name": "_page_0_Picture_0.jpeg",
        "path": "/home/content/converted_books/images/jesc112/_page_0_Picture_0.jpeg",
        "size_bytes": 38232,
        "description": "This image shows the chapter title page for \"Chapter 12: Magnetic Effects of Electric Current\" from a science textbook. The title is displayed in large blue text, with a small diagram on the left showing magnetic field lines around what appears to be a current-carrying wire or magnet, illustrating the chapter's focus on the relationship between electricity and magnetism.",
        "description_generated_at": "2025-07-19 12:22:58"
      },
      {
        "name": "_page_0_Picture_1.jpeg",
        "path": "/home/content/converted_books/images/jesc112/_page_0_Picture_1.jpeg",
        "size_bytes": 10935,
        "description": "This image shows a QR code with the identifier \"1064CH13\" below it. The QR code likely provides digital access to additional resources, videos, or interactive content related to the chapter on magnetic effects of electric current.",
        "description_generated_at": "2025-07-19 12:22:58"
      },
      {
        "name": "_page_0_Figure_8.jpeg",
        "path": "/home/content/converted_books/images/jesc112/_page_0_Figure_8.jpeg",
        "size_bytes": 20348,
        "description": "This diagram shows an experimental setup for Activity 12.1, which demonstrates the magnetic effect of electric current by showing how a compass needle deflects when placed near a current-carrying copper wire. The circuit includes a battery, resistor R, ammeter (A), key switch (K), and a straight conductor wire XY positioned perpendicular to a compass, illustrating the fundamental connection between electricity and magnetism.",
        "description_generated_at": "2025-07-19 12:22:58"
      },
      {
        "name": "_page_0_Figure_9.jpeg",
        "path": "/home/content/converted_books/images/jesc112/_page_0_Figure_9.jpeg",
        "size_bytes": 11601,
        "description": "This diagram illustrates the experimental setup described in Activity 12.1, showing how a compass needle gets deflected when electric current passes through a nearby copper wire. The image demonstrates the fundamental concept that electric current produces a magnetic effect, which is the basis for understanding electromagnetism in this physics chapter.",
        "description_generated_at": "2025-07-19 12:22:58"
      },
      {
        "name": "_page_0_Picture_13.jpeg",
        "path": "/home/content/converted_books/images/jesc112/_page_0_Picture_13.jpeg",
        "size_bytes": 7551,
        "description": "This image shows a historical portrait photograph of Hans Christian Oersted (1777-1851), a Danish physicist and chemist. The photograph depicts him as an older gentleman with a white beard wearing formal 19th century attire, and serves to introduce students to the scientist who discovered the connection between electricity and magnetism in 1820.",
        "description_generated_at": "2025-07-19 12:22:58"
      },
      {
        "name": "_page_1_Picture_2.jpeg",
        "path": "/home/content/converted_books/images/jesc112/_page_1_Picture_2.jpeg",
        "size_bytes": 5238,
        "description": "This image shows iron filings scattered around a bar magnet that have arranged themselves into curved lines extending from one pole of the magnet to the other. The pattern demonstrates magnetic field lines, illustrating how a magnet's invisible magnetic field extends into the space around it and exerts forces on magnetic materials like iron filings.",
        "description_generated_at": "2025-07-19 12:22:58"
      },
      {
        "name": "_page_1_Picture_10.jpeg",
        "path": "/home/content/converted_books/images/jesc112/_page_1_Picture_10.jpeg",
        "size_bytes": 46466,
        "description": "This image shows the magnetic field pattern of a bar magnet, demonstrated by iron filings that have arranged themselves in curved lines extending from the north pole (N) to the south pole (S) of the red bar magnet. The iron filings create a visual representation of the invisible magnetic field lines, showing how the magnetic force extends into the space around the magnet and is strongest at the poles where the field lines are most concentrated.",
        "description_generated_at": "2025-07-19 12:22:58"
      },
      {
        "name": "_page_2_Picture_6.jpeg",
        "path": "/home/content/converted_books/images/jesc112/_page_2_Picture_6.jpeg",
        "size_bytes": 7822,
        "description": "This diagram shows a bar magnet (red rectangle labeled with S and N poles) surrounded by small compass needles (yellow circles with cross marks) positioned at various points around the magnet. The compass needles demonstrate how to trace magnetic field lines by following the direction each needle points when placed at different positions around the magnet, illustrating the step-by-step method described in the text for mapping magnetic fields.",
        "description_generated_at": "2025-07-19 12:22:58"
      },
      {
        "name": "_page_2_Figure_8.jpeg",
        "path": "/home/content/converted_books/images/jesc112/_page_2_Figure_8.jpeg",
        "size_bytes": 28075,
        "description": "This diagram shows the complete magnetic field pattern around a bar magnet, with curved blue lines representing magnetic field lines that emerge from the north pole (N) and curve around to enter the south pole (S). The arrows on the field lines indicate the direction of the magnetic field, demonstrating how the field lines form closed loops and are more densely packed near the poles where the magnetic field is stronger.",
        "description_generated_at": "2025-07-19 12:22:58"
      },
      {
        "name": "_page_2_Figure_9.jpeg",
        "path": "/home/content/converted_books/images/jesc112/_page_2_Figure_9.jpeg",
        "size_bytes": 5867,
        "description": "This diagram shows the magnetic field lines around a bar magnet, with curved lines emerging from the north pole (N) and converging at the south pole (S), demonstrating the invisible magnetic field pattern. The field lines are more densely packed near the poles, indicating stronger magnetic force in those regions, and illustrate how magnetic fields form closed loops around magnets.",
        "description_generated_at": "2025-07-19 12:22:58"
      },
      {
        "name": "_page_3_Figure_7.jpeg",
        "path": "/home/content/converted_books/images/jesc112/_page_3_Figure_7.jpeg",
        "size_bytes": 36066,
        "description": "This diagram shows two electric circuits (a) and (b) demonstrating how the direction of electric current affects the deflection of a compass needle placed beneath a current-carrying wire. In circuit (a), current flows from north to south and the compass needle deflects eastward, while in circuit (b), the reversed current direction (south to north) causes the needle to deflect westward, illustrating that the magnetic field direction changes with current direction.",
        "description_generated_at": "2025-07-19 12:22:58"
      },
      {
        "name": "_page_4_Figure_8.jpeg",
        "path": "/home/content/converted_books/images/jesc112/_page_4_Figure_8.jpeg",
        "size_bytes": 40321,
        "description": "This image shows a diagram and photograph demonstrating the magnetic field pattern around a current-carrying wire, with part (a) showing the experimental setup including a circuit with variable resistance and ammeter, and concentric circular field lines around a vertical wire, while part (b) shows the actual pattern of iron filings arranged in concentric circles around the wire. The image illustrates how electric current through a straight conductor creates a circular magnetic field pattern that can be visualized using iron filings.",
        "description_generated_at": "2025-07-19 12:22:58"
      },
      {
        "name": "_page_5_Figure_0.jpeg",
        "path": "/home/content/converted_books/images/jesc112/_page_5_Figure_0.jpeg",
        "size_bytes": 10457,
        "description": "This diagram illustrates the right-hand thumb rule, showing a hand gripping a current-carrying conductor with the thumb pointing in the direction of current flow and fingers wrapped around the wire. The curved arrows labeled \"Magnetic Field\" demonstrate how the magnetic field lines circle around the conductor in the direction indicated by the curled fingers.",
        "description_generated_at": "2025-07-19 12:22:58"
      },
      {
        "name": "_page_5_Figure_7.jpeg",
        "path": "/home/content/converted_books/images/jesc112/_page_5_Figure_7.jpeg",
        "size_bytes": 47408,
        "description": "This image shows a \"Questions\" section from the textbook with three practice questions listed in blue text. The questions ask students to draw magnetic field lines around a bar magnet, list properties of magnetic field lines, and explain why magnetic field lines don't intersect each other, helping reinforce key concepts about magnetic fields covered in the chapter.",
        "description_generated_at": "2025-07-19 12:22:58"
      },
      {
        "name": "_page_5_Picture_9.jpeg",
        "path": "/home/content/converted_books/images/jesc112/_page_5_Picture_9.jpeg",
        "size_bytes": 29307,
        "description": "This diagram illustrates the magnetic field pattern produced by a current-carrying circular loop, showing curved magnetic field lines that form closed loops around the wire and pass through the center of the loop. The field lines are labeled with N and S to indicate the north and south poles, demonstrating how the circular current creates a magnetic field similar to that of a bar magnet.",
        "description_generated_at": "2025-07-19 12:22:58"
      },
      {
        "name": "_page_6_Figure_7.jpeg",
        "path": "/home/content/converted_books/images/jesc112/_page_6_Figure_7.jpeg",
        "size_bytes": 15052,
        "description": "This diagram shows the experimental setup for Activity 12.6, illustrating a circular coil passing through holes in a cardboard connected to a battery and key, with iron filings sprinkled on the cardboard to visualize the magnetic field pattern. The image demonstrates how to observe the magnetic field lines produced by a current-carrying circular coil, with points A and B marking the holes in the cardboard where the coil passes through.",
        "description_generated_at": "2025-07-19 12:22:58"
      },
      {
        "name": "_page_6_Figure_12.jpeg",
        "path": "/home/content/converted_books/images/jesc112/_page_6_Figure_12.jpeg",
        "size_bytes": 53447,
        "description": "This image shows a \"Questions\" section from a science textbook with two practice problems about magnetic fields. The questions ask students to apply the right-hand rule to determine magnetic field direction around a current-carrying wire loop and to draw a diagram representing a uniform magnetic field.",
        "description_generated_at": "2025-07-19 12:22:58"
      },
      {
        "name": "_page_6_Picture_13.jpeg",
        "path": "/home/content/converted_books/images/jesc112/_page_6_Picture_13.jpeg",
        "size_bytes": 23093,
        "description": "This diagram shows the magnetic field pattern around a current-carrying solenoid (coil of wire), with field lines drawn as curved lines that loop around the outside of the coil and run straight and parallel through the interior. The image demonstrates how a solenoid creates a uniform magnetic field inside the coil, similar to the field pattern of a bar magnet, which is why solenoids can be used to create electromagnets.",
        "description_generated_at": "2025-07-19 12:22:58"
      },
      {
        "name": "_page_6_Figure_15.jpeg",
        "path": "/home/content/converted_books/images/jesc112/_page_6_Figure_15.jpeg",
        "size_bytes": 10257,
        "description": "This diagram shows a current-carrying solenoid (coil of wire wound around a cylindrical core) connected to a battery circuit with a key/switch. The image illustrates how an electromagnet is created when electric current flows through the solenoid, demonstrating the principle that a current-carrying coil can magnetize materials placed inside it.",
        "description_generated_at": "2025-07-19 12:22:58"
      },
      {
        "name": "_page_7_Figure_15.jpeg",
        "path": "/home/content/converted_books/images/jesc112/_page_7_Figure_15.jpeg",
        "size_bytes": 21522,
        "description": "This diagram shows an experimental setup demonstrating the force on a current-carrying conductor in a magnetic field, with an aluminum rod suspended between the poles of a horseshoe magnet and connected to a battery circuit. The setup illustrates how the rod experiences a force and gets displaced when current flows through it in the presence of the magnetic field, which is a key principle in electromagnetism.",
        "description_generated_at": "2025-07-19 12:22:58"
      },
      {
        "name": "_page_7_Figure_16.jpeg",
        "path": "/home/content/converted_books/images/jesc112/_page_7_Figure_16.jpeg",
        "size_bytes": 19263,
        "description": "This diagram shows an experimental setup demonstrating the magnetic force on a current-carrying conductor, featuring an aluminum rod AB suspended horizontally between the poles of a horseshoe magnet and connected to a battery circuit. The image illustrates how a current-carrying rod experiences a perpendicular force when placed in a magnetic field, with the rod's displacement direction depending on both the current direction and magnetic field orientation.",
        "description_generated_at": "2025-07-19 12:22:58"
      },
      {
        "name": "_page_8_Figure_2.jpeg",
        "path": "/home/content/converted_books/images/jesc112/_page_8_Figure_2.jpeg",
        "size_bytes": 20581,
        "description": "This image illustrates Fleming's left-hand rule, showing a left hand with the thumb, forefinger, and middle finger positioned perpendicular to each other, with labels indicating \"Thumb - Motion,\" \"Field,\" and \"Current.\" The diagram demonstrates how to use this hand rule to determine the direction of force on a current-carrying conductor in a magnetic field, where each finger represents one of the three mutually perpendicular directions (magnetic field, current, and resulting force).",
        "description_generated_at": "2025-07-19 12:22:58"
      },
      {
        "name": "_page_8_Figure_13.jpeg",
        "path": "/home/content/converted_books/images/jesc112/_page_8_Figure_13.jpeg",
        "size_bytes": 5823,
        "description": "This image shows the \"QUESTIONS\" section header from a science textbook chapter on magnetism and electric current. The header appears in large letters against a purple/lavender background, indicating the start of practice problems that test students' understanding of concepts like Fleming's left-hand rule and the behavior of charged particles in magnetic fields.",
        "description_generated_at": "2025-07-19 12:22:58"
      },
      {
        "name": "_page_10_Figure_0.jpeg",
        "path": "/home/content/converted_books/images/jesc112/_page_10_Figure_0.jpeg",
        "size_bytes": 54413,
        "description": "This schematic diagram shows a typical domestic electrical circuit with three main wires (live wire in red, neutral wire in black, and earth wire in green) connecting from the electricity board's fuse and meter through a distribution box to household electrical outlets. The diagram illustrates how appliances are connected in parallel across the live and neutral wires at 220V, with safety components like fuses and an earth wire for protection against electrical hazards.",
        "description_generated_at": "2025-07-19 12:22:58"
      },
      {
        "name": "_page_10_Figure_4.jpeg",
        "path": "/home/content/converted_books/images/jesc112/_page_10_Figure_4.jpeg",
        "size_bytes": 63260,
        "description": "This image shows a \"Questions\" section from a science textbook with three numbered practice questions about electrical safety and circuits. The questions cover topics like safety measures in electric circuits, power ratings and current calculations, and precautions to prevent electrical overloading, directly reinforcing the concepts about fuses and electrical safety discussed in the preceding text.",
        "description_generated_at": "2025-07-19 12:22:58"
      }
    ],
    "exercises": [
      {
        "question": "Why does a compass needle get deflected when brought near a bar magnet?",
        "answer": "A compass needle gets deflected when brought near a bar magnet because the compass needle itself is a small bar magnet with north and south poles. When placed in the magnetic field of a bar magnet, the compass needle experiences a magnetic force. Like poles repel and unlike poles attract, so the north pole of the compass needle is repelled by the north pole of the bar magnet and attracted to the south pole. This causes the needle to align itself along the magnetic field lines of the bar magnet, resulting in deflection from its original position."
      },
      {
        "question": "Choose the correct option. The magnetic field inside a long straight solenoid-carrying current: (a) is zero. (b) decreases as we move towards its end. (c) increases as we move towards its end. (d) is the same at all points.",
        "answer": "The correct answer is (d) is the same at all points. Inside a long straight current-carrying solenoid, the magnetic field lines are parallel and uniform. This means the magnetic field strength is constant throughout the interior of the solenoid. The field lines run parallel to the axis of the solenoid from one end to the other, creating a uniform magnetic field similar to that inside a bar magnet."
      },
      {
        "question": "Which of the following property of a proton can change while it moves freely in a magnetic field? (There may be more than one correct answer.) (a) mass (b) speed (c) velocity (d) momentum",
        "answer": "The correct answers are (c) velocity and (d) momentum. When a charged particle like a proton moves in a magnetic field, the magnetic force acts perpendicular to its velocity, causing it to move in a circular or helical path. While the magnitude of velocity (speed) remains constant, the direction of velocity continuously changes, so velocity changes. Since momentum is a vector quantity (mass × velocity), and velocity direction changes, momentum also changes. The mass remains constant, and speed (magnitude of velocity) remains constant because magnetic force does no work on the particle."
      },
      {
        "question": "In Activity 12.7, how do we think the displacement of rod AB will be affected if (i) current in rod AB is increased; (ii) a stronger horse-shoe magnet is used; and (iii) length of the rod AB is increased?",
        "answer": "(i) If current in rod AB is increased: The displacement will increase because the magnetic force on a current-carrying conductor is directly proportional to the current flowing through it. Greater current means greater force and thus greater displacement. (ii) If a stronger horse-shoe magnet is used: The displacement will increase because the magnetic force is directly proportional to the magnetic field strength. A stronger magnet produces a stronger magnetic field, resulting in greater force and displacement. (iii) If length of rod AB is increased: The displacement will increase because the magnetic force on a current-carrying conductor is directly proportional to the length of the conductor in the magnetic field. A longer rod experiences greater total force."
      },
      {
        "question": "A positively-charged particle (alpha-particle) projected towards west is deflected towards north by a magnetic field. The direction of magnetic field is (a) towards south (b) towards east (c) downward (d) upward",
        "answer": "The correct answer is (d) upward. Using Fleming's left-hand rule: Point the middle finger in the direction of current (same as the direction of motion of positive charge, which is west), point the thumb in the direction of force (north), then the forefinger points in the direction of the magnetic field, which is upward. This can also be determined using the right-hand rule for the cross product F = q(v × B), where the force is perpendicular to both velocity and magnetic field."
      },
      {
        "question": "Which of the following correctly describes the magnetic field near a long straight wire? (a) The field consists of straight lines perpendicular to the wire. (b) The field consists of straight lines parallel to the wire. (c) The field consists of radial lines originating from the wire. (d) The field consists of concentric circles centred on the wire.",
        "answer": "The correct answer is (d) The field consists of concentric circles centred on the wire. When current flows through a long straight wire, it produces a magnetic field in the form of concentric circles around the wire. The direction of these circular field lines can be determined using the right-hand thumb rule: if the thumb points in the direction of current, the fingers curl in the direction of the magnetic field lines. The strength of the field decreases as we move away from the wire, so the circles become larger and the field becomes weaker."
      },
      {
        "question": "At the time of short circuit, the current in the circuit (a) reduces substantially. (b) does not change. (c) increases heavily. (d) vary continuously.",
        "answer": "The correct answer is (c) increases heavily. During a short circuit, the live wire and neutral wire come into direct contact, usually due to damaged insulation or faulty appliances. This creates a path of very low resistance, and according to Ohm's law (I = V/R), when resistance decreases drastically, current increases dramatically. This sudden increase in current can damage appliances and create fire hazards, which is why fuses are used to break the circuit when such high currents flow."
      },
      {
        "question": "State whether the following statements are true or false. (a) The field at the centre of a long circular coil carrying current will be parallel straight lines. (b) A wire with a green insulation is usually the live wire of an electric supply.",
        "answer": "(a) True. At the center of a long circular coil (solenoid) carrying current, the magnetic field lines are parallel straight lines running along the axis of the coil. This creates a uniform magnetic field inside the solenoid. (b) False. A wire with green insulation is the earth wire, not the live wire. The live wire typically has red insulation, the neutral wire has black insulation, and the earth wire has green insulation. The earth wire is connected to the ground for safety purposes."
      },
      {
        "question": "List two methods of producing magnetic fields.",
        "answer": "Two methods of producing magnetic fields are: 1. Using permanent magnets - Natural magnets like magnetite or artificial permanent magnets made from materials like iron, nickel, cobalt, or their alloys create magnetic fields due to the alignment of magnetic domains in the material. 2. Using electric current - When electric current flows through a conductor (wire, coil, or solenoid), it produces a magnetic field around it. This is called electromagnetic induction and is the principle behind electromagnets, which can be turned on or off by controlling the current."
      },
      {
        "question": "When is the force experienced by a current–carrying conductor placed in a magnetic field largest?",
        "answer": "The force experienced by a current-carrying conductor placed in a magnetic field is largest when: 1. The current-carrying conductor is placed perpendicular (at 90°) to the magnetic field lines. When the angle between the current direction and magnetic field is 90°, the force is maximum. 2. Additionally, the force is directly proportional to the strength of the current, the strength of the magnetic field, and the length of the conductor in the field. The force becomes zero when the conductor is parallel to the magnetic field lines."
      },
      {
        "question": "Imagine that you are sitting in a chamber with your back to one wall. An electron beam, moving horizontally from back wall towards the front wall, is deflected by a strong magnetic field to your right side. What is the direction of magnetic field?",
        "answer": "The magnetic field is directed upward (towards the ceiling). To solve this, we use Fleming's left-hand rule, but remember that electrons carry negative charge, so the conventional current direction is opposite to electron motion. The electron beam moves from back to front wall, so conventional current flows from front to back wall. Using Fleming's left-hand rule: middle finger (current direction) points from front to back, thumb (force direction) points to the right, so the forefinger (magnetic field direction) points upward. Alternatively, this can be solved using the formula F = q(v × B) considering the negative charge of electrons."
      },
      {
        "question": "State the rule to determine the direction of a (i) magnetic field produced around a straight conductor-carrying current, (ii) force experienced by a current-carrying straight conductor placed in a magnetic field which is perpendicular to it, and (iii) current induced in a coil due to its rotation in a magnetic field.",
        "answer": "(i) Right-hand thumb rule (or Maxwell's corkscrew rule): Hold the current-carrying straight conductor in your right hand such that the thumb points in the direction of current. The fingers will curl around the conductor in the direction of the magnetic field lines. (ii) Fleming's left-hand rule: Stretch the thumb, forefinger, and middle finger of your left hand mutually perpendicular to each other. If the forefinger points in the direction of the magnetic field and the middle finger in the direction of current, then the thumb points in the direction of force (or motion) of the conductor. (iii) Fleming's right-hand rule: This rule is used for electromagnetic induction. Stretch the thumb, forefinger, and middle finger of the right hand mutually perpendicular. If the thumb points in the direction of motion of the conductor, forefinger in the direction of magnetic field, then the middle finger gives the direction of induced current."
      },
      {
        "question": "When does an electric short circuit occur?",
        "answer": "An electric short circuit occurs when the live wire and neutral wire come into direct contact with each other, bypassing the normal load/appliance. This can happen due to: 1. Damaged insulation of wires, causing them to touch each other directly. 2. Faulty appliances where internal components create an unintended connection between live and neutral wires. 3. Loose connections in electrical fittings. 4. Water entering electrical connections, providing a conducting path. When short circuit occurs, the electrical resistance drops dramatically, causing a sudden surge in current that can damage appliances, cause fires, or lead to electrical accidents. This is why fuses and circuit breakers are essential safety devices."
      },
      {
        "question": "What is the function of an earth wire? Why is it necessary to earth metallic appliances?",
        "answer": "The earth wire serves as a safety device with the following functions: 1. It provides a low-resistance path for leakage current to flow directly to the ground instead of through the human body. 2. It maintains the metallic body of appliances at earth potential (zero potential), preventing dangerous voltage buildup. 3. In case of insulation failure, any current leaking to the metallic body flows through the earth wire to the ground, preventing electric shock. It is necessary to earth metallic appliances because: 1. Metallic bodies can conduct electricity, and if live wire touches the metal body due to insulation failure, the entire appliance becomes electrically charged. 2. Without earthing, touching such an appliance would complete the circuit through the human body, causing severe electric shock or even death. 3. Earthing ensures that even if there's a fault, the potential difference between the metallic body and ground remains zero, making it safe to touch."
      }
    ],
    "summary": {
      "title": "Magnetic Effects of Electric Current",
      "key_concepts": [
        "Electric current produces magnetic fields around conductors",
        "Magnetic field patterns depend on conductor shape (straight wire, circular loop, solenoid)",
        "Current-carrying conductors experience force in magnetic fields (Fleming's left-hand rule)",
        "Electromagnets are created using current-carrying solenoids with iron cores",
        "Domestic electric circuits use live, neutral, and earth wires with safety devices like fuses"
      ],
      "summary": "This chapter explores the relationship between electricity and magnetism, demonstrating that electric current creates magnetic fields. The chapter covers how magnetic field patterns vary with conductor shapes - from concentric circles around straight wires to uniform fields inside solenoids. It explains the right-hand thumb rule for determining magnetic field direction and Fleming's left-hand rule for force direction on current-carrying conductors in magnetic fields. The chapter also covers practical applications including electromagnets and domestic electrical circuits. Safety aspects of household electricity are emphasized, including the importance of proper wiring with live, neutral, and earth connections, and the critical role of fuses in preventing damage from short circuits and overloading."
    }
  },
  "statistics": {
    "total_images": 25,
    "text_length": 27746,
    "processing_time": 11.2
  },
  "claude_processing": {
    "processed_at": "2025-07-19 12:22:58",
    "model_used": "claude-sonnet-4-20250514",
    "tasks_completed": [
      "exercises",
      "answers",
      "summary",
      "image_descriptions"
    ],
    "exercises_count": 14,
    "images_processed": 25
  }
}