{
    "id": "c497b490-f4d1-4769-8cfd-cf691e3bcbda",
    "title": "Electricity",
    "source_file": "/home/content/books/science/jesc111.pdf",
    "filename": "jesc111.pdf",
    "subject": "science",
    "conversion_timestamp": "2025-07-18T12:10:35.341916",
    "processing_time_seconds": 19.84,
    "metadata": "md",
    "content": {
        "markdown_text": "![](_page_0_Picture_0.jpeg)\n\n![](_page_0_Picture_1.jpeg)\n\nE lectricity has an important place in modern society. It is a controllable and convenient form of energy for a variety of uses in homes, schools, hospitals, industries and so on. What constitutes electricity? How does it flow in an electric circuit? What are the factors that control or regulate the current through an electric circuit? In this Chapter, we shall attempt to answer such questions. We shall also discuss the heating effect of electric current and its applications.\n\n## 11.1 ELECTRIC CURRENT AND CIRCUIT\n\nWe are familiar with air current and water current. We know that flowing water constitute water current in rivers. Similarly, if the electric charge flows through a conductor (for example, through a metallic wire), we say that there is an electric current in the conductor. In a torch, we know that the cells (or a battery, when placed in proper order) provide flow of charges or an electric current through the torch bulb to glow. We have also seen that the torch gives light only when its switch is *on*. What does a switch do? A switch makes a conducting link between the cell and the bulb. A continuous and closed path of an electric current is called an electric circuit. Now, if the circuit is broken anywhere (or the switch of the torch is turned *off*), the current stops flowing and the bulb does not glow.\n\nHow do we express electric current? Electric current is expressed by the amount of charge flowing through a particular area in unit time. In other words, it is the rate of flow of electric charges. In circuits using metallic wires, electrons constitute the flow of charges. However, electrons were not known at the time when the phenomenon of electricity was first observed. So, electric current was considered to be the flow of positive charges and the direction of flow of positive charges was taken to be the direction of electric current. Conventionally, in an electric circuit the direction of electric current is taken as opposite to the direction of the flow of electrons, which are negative charges.\n\nIf a net charge *Q,* flows across any cross-section of a conductor in time *t*, then the current *I,* through the cross-section is\n\n$$\nI = \\frac{Q}{t} \\tag{11.1}\n$$\n\nThe SI unit of electric charge is coulomb (C), which is equivalent to the charge contained in nearly 6 × 10<sup>18</sup> electrons. (We know that an electron possesses a negative charge of 1.6 × 10–19 C.) The electric current is expressed by a unit called ampere (A), named after the French scientist, Andre-Marie Ampere (1775–1836). One ampere is constituted by the flow of one coulomb of charge per second, that is, 1 A = 1 C/1 s. Small quantities of current are expressed in milliampere\n\n![](_page_1_Figure_3.jpeg)\n\n## (1 mA = 10–3 A) or in microampere (1 µA = 10–6 A). An instrument called ammeter measures electric current in a circuit. It is always connected in series in a circuit through which the current is to be measured. Figure 11.1 shows the schematic diagram of a typical electric circuit comprising a cell, an electric bulb, an ammeter and a plug key. Note that the electric current flows in the circuit from the positive terminal of the cell to the negative terminal of the cell through the bulb and ammeter.\n\n#### *Figure 11.1 A schematic diagram of an electric circuit*\n\n*comprising – cell, electric bulb, ammeter and plug key*\n\n#### Example 11.1\n\nA current of 0.5 A is drawn by a filament of an electric bulb for 10 minutes. Find the amount of electric charge that flows through the circuit.\n\n#### Solution\n\nWe are given, *I* = 0.5 A; *t* = 10 min = 600 s. From Eq. (11.1), we have *Q* = *It* = 0.5 A × 600 s = 300 C\n\n![](_page_1_Figure_11.jpeg)\n\n## 11.2 ELECTRIC POTENTIAL AND POTENTIAL DIFFERENCE\n\nWhat makes the electric charge to flow? Let us consider the analogy of flow of water. Charges do not flow in a copper wire by themselves, just as water in a perfectly horizontal tube does not flow. If one end of the tube is connected to a tank of water kept at a higher level, such that there is a pressure difference between the two ends of the tube, water flows out of the other end of the tube. For flow of charges in a conducting metallic wire, the gravity, of course, has no role to play; the electrons move only if there is a difference of electric pressure – called the *potential difference* – along the conductor. This difference of potential may be produced by a battery, consisting of one or more electric cells. The chemical action within a cell generates the potential difference across the terminals of the cell, even when no current is drawn from it. When the cell is connected to a conducting circuit element, the potential difference sets the charges in motion in the conductor and produces an electric current. In order to maintain the current in a given electric circuit, the cell has to expend its chemical energy stored in it.\n\nWe define the electric potential difference between two points in an electric circuit carrying some current as the work done to move a unit charge from one point to the other –\n\nPotential difference (*V*) between two points = Work done (*W*)/Charge (*Q*) *V = W/Q* (11.2)\n\nThe SI unit of electric potential difference is volt (V), named after Alessandro Volta (1745 –1827), an Italian physicist. One volt is the potential difference between two points in a current carrying conductor when 1 joule of work is done to move a charge of 1 coulomb from one point to the other.\n\nTherefore, 1 volt = 1 joule 1 coulomb\n\n(11.3)\n\n#### 1 V = 1 J C–1\n\nThe potential difference is measured by means of an instrument called the voltmeter. The voltmeter is always connected in parallel across the points between which the potential difference is to be measured.\n\n#### Example 11.2\n\nHow much work is done in moving a charge of 2 C across two points having a potential difference 12 V?\n\n#### Solution\n\nThe amount of charge *Q,* that flows between two points at potential difference *V* (= 12 V) is 2 C. Thus, the amount of work *W,* done in moving the charge [from Eq. (11.2)] is\n\n![](_page_3_Figure_0.jpeg)\n\n# QUESTIONS\n\n- 1. Name a device that helps to maintain a potential difference across a conductor.\n- 2. What is meant by saying that the potential difference between two points is 1 V?\n- 3. How much energy is given to each coulomb of charge passing through a 6 V battery?\n\n## 11.3 CIRCUIT DIAGRAM\n\nWe know that an electric circuit, as shown in Fig. 11.1, comprises a cell (or a battery), a plug key, electrical component(s), and connecting wires. It is often convenient to draw a schematic diagram, in which different components of the circuit are represented by the symbols conveniently used. Conventional symbols used to represent some of the most commonly used electrical components are given in Table 11.1.\n\nTable 11.1 Symbols of some commonly used components in circuit diagrams\n\n| Sl.<br>No. | Components                          | Symbols |\n|------------|-------------------------------------|---------|\n| 1          | An electric cell                    |         |\n| 2          | A battery or a combination of cells |         |\n| 3          | Plug key or switch (open)           |         |\n| 4          | Plug key or switch (closed)         |         |\n| 5          | A wire joint                        |         |\n| 6          | Wires crossing without joining      |         |\n\n?\n\n| 7  | Electric bulb                   | or |\n|----|---------------------------------|----|\n| 8  | A resistor of resistance R      |    |\n| 9  | Variable resistance or rheostat | or |\n| 10 | Ammeter                         |    |\n| 11 | Voltmeter                       |    |\n\n## 11.4 OHM'S LAW\n\nIs there a relationship between the potential difference across a conductor and the current through it? Let us explore with an Activity.\n\n## Activity 11.1\n\n- n Set up a circuit as shown in Fig. 11.2, consisting of a nichrome wire XY of length, say 0.5 m, an ammeter, a voltmeter and four cells of 1.5 V each. (Nichrome is an alloy of nickel, chromium, manganese, and iron metals.)\n- n First use only one cell as the source in the circuit. Note the reading in the ammeter *I,* for the current and reading of the voltmeter *V* for the potential difference across the nichrome wire XY in the circuit. Tabulate them in the Table given.\n\n![](_page_4_Figure_6.jpeg)\n\n*Figure 11.2 Electric circuit for studying Ohm's law*\n\n- n Next connect two cells in the circuit and note the respective readings of the ammeter and voltmeter for the values of current through the nichrome wire and potential difference across the nichrome wire.\n- n Repeat the above steps using three cells and then four cells in the circuit separately.\n- n Calculate the ratio of *V* to *I* for each pair of potential difference *V* and current *I*.\n\n| S.<br>No. | Number of cells<br>used in the<br>circuit<br>(ampere) | Current through<br>the nichrome<br>wire, I<br>wire, V (volt) | Potential difference<br>across the<br>nichrome | V/I<br>(volt/ampere) |\n|-----------|-------------------------------------------------------|--------------------------------------------------------------|------------------------------------------------|----------------------|\n| 1         | 1                                                     |                                                              |                                                |                      |\n| 2         | 2                                                     |                                                              |                                                |                      |\n| 3         | 3                                                     |                                                              |                                                |                      |\n| 4         | 4                                                     |                                                              |                                                |                      |\n\nn Plot a graph between *V* and *I*, and observe the nature of the graph.\n\n![](_page_5_Figure_0.jpeg)\n\n#### *Figure 11.3*\n\n*V–I graph for a nichrome wire. A straight line plot shows that as the current through a wire increases, the potential difference across the wire increases linearly – this is Ohm's law.*\n\nIn this Activity, you will find that approximately the same value for *V/I* is obtained in each case. Thus the *V–I* graph is a straight line that passes through the origin of the graph, as shown in Fig. 11.3. Thus, *V/I* is a constant ratio.\n\nIn 1827, a German physicist Georg Simon Ohm (1787–1854) found out the relationship between the current *I,* flowing in a metallic wire and the potential difference across its terminals. The potential difference, *V*, across the ends of a given metallic wire in an electric circuit is directly proportional to the current flowing through it, provided its temperature remains the same. This is called Ohm's law. In other words –\n\n|    | V ∝<br>I |   |          | (11.4) |\n|----|----------|---|----------|--------|\n| or | V/I      | = | constant |        |\n|    |          | = | R        |        |\n| or | V        | = | IR       | (11.5) |\n\nIn Eq. (11.4), *R* is a constant for the given metallic wire\n\nat a given temperature and is called its resistance. It is the property of a conductor to resist the flow of charges through it. Its SI unit is ohm, represented by the Greek letter Ω. According to Ohm's law,\n\n$$\nR = V/I \\tag{11.6}\n$$\n\nIf the potential difference across the two ends of a conductor is 1 V and the current through it is 1 A, then the resistance *R,* of the conductor\n\nis 1 \n$$\n\\Omega\n$$\n. That is, 1 ohm =  $\\frac{1 \\text{ volt}}{1 \\text{ ampere}}$ \n\nAlso from Eq. (11.5) we get\n\n## *I = V/R* (11.7)\n\nIt is obvious from Eq. (11.7) that the current through a resistor is inversely proportional to its resistance. If the resistance is doubled the current gets halved. In many practical cases it is necessary to increase or decrease the current in an electric circuit. A component used to regulate current without changing the voltage source is called variable resistance. In an electric circuit, a device called rheostat is often used to change the resistance in the circuit. We will now study about electrical resistance of a conductor with the help of following Activity.\n\n## Activity 11.2\n\n- n Take a nichrome wire, a torch bulb, a 10 W bulb and an ammeter (0 5 A range), a plug key and some connecting wires.\n- n Set up the circuit by connecting four dry cells of 1.5 V each in series with the ammeter leaving a gap XY in the circuit, as shown in Fig. 11.4.\n\n#### 176 Science\n\n![](_page_6_Figure_0.jpeg)\n\n#### *Figure 11.4*\n\n- n Complete the circuit by connecting the nichrome wire in the gap XY. Plug the key. Note down the ammeter reading. Take out the key from the plug. [Note: *Always take out the key from the plug after measuring the current through the circuit.*]\n- n Replace the nichrome wire with the torch bulb in the circuit and find the current through it by measuring the reading of the ammeter.\n- n Now repeat the above step with the 10 W bulb in the gap XY.\n- n Are the ammeter readings different for different components connected in the gap XY? What do the above observations indicate?\n- n You may repeat this Activity by keeping any material component in the gap. Observe the ammeter readings in each case. Analyse the observations.\n\nIn this Activity we observe that the current is different for different components. Why do they differ? Certain components offer an easy path for the flow of electric current while the others resist the flow. We know that motion of electrons in an electric circuit constitutes an electric current. The electrons, however, are not completely free to move within a conductor. They are restrained by the attraction of the atoms among which they move. Thus, motion of electrons through a conductor is retarded by its resistance. A component of a given size that offers a low resistance is a good conductor. A conductor having some appreciable resistance is called a resistor. A component of identical size that offers a higher resistance is a poor conductor. An insulator of the same size offers even higher resistance.\n\n## 11.5 FA FACTORS ON WHICH THE RESISTANCE OF A CONDUCTOR DEPENDS\n\n## Activity 11.3\n\nn Complete an electric circuit consisting of a cell, an ammeter, a nichrome wire of length *l* [say, marked (1)] and a plug key, as shown in Fig. 11.5.\n\n![](_page_7_Picture_0.jpeg)\n\n*Figure 11.5 Electric circuit to study the factors on which the resistance of conducting wires depends*\n\n- n Now, plug the key. Note the current in the ammeter.\n- n Replace the nichrome wire by another nichrome wire of same thickness but twice the length, that is 2*l* [marked (2) in the Fig. 11.5].\n- n Note the ammeter reading.\n- n Now replace the wire by a thicker nichrome wire, of the same length *l* [marked (3)]. A thicker wire has a larger cross-sectional area. Again note down the current through the circuit.\n- n Instead of taking a nichrome wire, connect a copper wire [marked (4) in Fig. 11.5] in the circuit. Let the wire be of the same length and same area of cross-section as that of the first nichrome wire [marked (1)]. Note the value of the current.\n- n Notice the difference in the current in all cases.\n- n Does the current depend on the length of the conductor?\n- n Does the current depend on the area of cross-section of the wire used?\n\nIt is observed that the ammeter reading decreases to one-half when the length of the wire is doubled. The ammeter reading is increased when a thicker wire of the same material and of the same length is used in the circuit. A change in ammeter reading is observed when a wire of different material of the same length and the same area of cross-section is used. On applying Ohm's law [Eqs. (11.5) – (11.7)], we observe that the resistance of the conductor depends (i) on its length, (ii) on its area of cross-section, and (iii) on the nature of its material. Precise measurements have shown that resistance of a uniform metallic conductor is directly proportional to its length (*l*) and inversely proportional to the area of cross-section (*A*). That is,\n\n$$\nR \\propto l\n$$\n (11.8)  \nand \n$$\nR \\propto 1/A\n$$\n (11.9)\n\nCombining Eqs. (11.8) and (11.9) we get\n\n*R* ∝ *l A* or, *R* = ρ *l A* (11.10)\n\nwhere ρ (rho) is a constant of proportionality and is called the electrical resistivity of the material of the conductor. The SI unit of resistivity is Ω m. It is a characteristic property of the material. The metals and alloys have very low resistivity in the range of 10–8 Ω m to 10–6 Ω m. They are good conductors of electricity. Insulators like rubber and glass have resistivity of the order of 10<sup>12</sup> to 10<sup>17</sup> Ω m. Both the resistance and resistivity of a material vary with temperature.\n\nTable 11.2 reveals that the resistivity of an alloy is generally higher than that of its constituent metals. Alloys do not oxidise (burn) readily at high temperatures. For this reason, they are commonly used in electrical heating devices, like electric iron, toasters etc. Tungsten is used almost exclusively for filaments of electric bulbs, whereas copper and aluminium are generally used for electrical transmission lines.\n\n|            | Material                     | Resistivity (Ω m) |  |\n|------------|------------------------------|-------------------|--|\n| Conductors | Silver                       | 1.60 × 10–8       |  |\n|            | Copper                       | 1.62 × 10–8       |  |\n|            | Aluminium                    | 2.63 × 10–8       |  |\n|            | Tungsten                     | 5.20 × 10–8       |  |\n|            | Nickel                       | 6.84 × 10–8       |  |\n|            | Iron                         | 10.0 × 10–8       |  |\n|            | Chromium                     | 12.9 × 10–8       |  |\n|            | Mercury                      | 94.0 × 10–8       |  |\n|            | Manganese                    | 1.84 × 10–6       |  |\n| Alloys     | Constantan                   | 49 × 10–6         |  |\n|            | (alloy of Cu and Ni)         |                   |  |\n|            | Manganin                     | 44 × 10–6         |  |\n|            | (alloy of Cu, Mn and Ni)     |                   |  |\n|            | Nichrome                     | 100 × 10–6        |  |\n|            | (alloy of Ni, Cr, Mn and Fe) |                   |  |\n| Insulators | Glass                        | 1010 – 1014       |  |\n|            | Hard rubber                  | 1013 – 1016       |  |\n|            | Ebonite                      | 1015 – 1017       |  |\n|            | Diamond                      | 1012 - 1013       |  |\n|            | Paper (dry)                  | 1012              |  |\n|            |                              |                   |  |\n\nTable 11.2 Electrical resistivity\\* of some substances at 20°C\n\n\\* *You need not memorise these values. You can use these values for solving numerical problems.*\n\n## Example 11.3\n\n(a) How much current will an electric bulb draw from a 220 V source, if the resistance of the bulb filament is 1200 Ω? (b) How much current will an electric heater coil draw from a 220 V source, if the resistance of the heater coil is 100 Ω?\n\n## Solution\n\n- (a) We are given *V* = 220 V; *R* = 1200 Ω. From Eq. (12.6), we have the current *I* = 220 V/1200 Ω = 0.18 A.\n- (b) We are given, *V* = 220 V, *R* = 100 Ω. From Eq. (11.6), we have the current *I* = 220 V/100 Ω = 2.2 A. Note the difference of current drawn by an electric bulb and electric heater from the same 220 V source!\n\n#### Example 11.4\n\nThe potential difference between the terminals of an electric heater is 60 V when it draws a current of 4 A from the source. What current will the heater draw if the potential difference is increased to 120 V? Solution\n\nWe are given, potential difference *V* = 60 V, current *I* = 4 A.\n\nAccording to Ohm's law, \n$$\nR = \\frac{V}{I} = \\frac{60 \\text{ V}}{4 \\text{ A}} = 15 \\Omega\n$$\n.\n\nWhen the potential difference is increased to 120 V the current is given by\n\ncurrent = \n$$\n\\frac{V}{R} = \\frac{120 \\text{ V}}{15 \\Omega} = 8 \\text{ A}.\n$$\n\nThe current through the heater becomes 8 A.\n\n#### Example 11.5\n\nResistance of a metal wire of length 1 m is 26 Ω at 20°C. If the diameter of the wire is 0.3 mm, what will be the resistivity of the metal at that temperature? Using Table 11.2, predict the material of the wire.\n\n#### Solution\n\nWe are given the resistance *R* of the wire = 26 Ω, the diameter *d* = 0.3 mm = 3 × 10-4 m, and the length *l* of the wire = 1 m.\n\nTherefore, from Eq. (11.10), the resistivity of the given metallic wire is\n\nρ *=* (*RA/l*) = (*R*π*d2/*4*l* )\n\nSubstitution of values in this gives\n\n$$\n\\rho = 1.84 \\times 10^{-6} \\,\\Omega \\,\\text{m}\n$$\n\nThe resistivity of the metal at 20°C is 1.84 × 10–6 Ω m. From Table 11.2, we see that this is the resistivity of manganese.\n\n#### Example 11.6\n\nA wire of given material having length *l* and area of cross-section *A* has a resistance of 4 Ω. What would be the resistance of another wire of the same material having length *l*/2 and area of cross-section 2*A*?\n\n## Solution\n\nFor first wire\n\n$$\nR_{1} = \\rho \\frac{l}{A} = 4\\Omega\n$$\n\nNow for second wire\n\n$$\nR_2 = \\rho \\frac{l/2}{2A} = \\frac{1}{4} \\rho \\frac{l}{A}\n$$\n  \n$$\nR_2 = \\frac{1}{4} R_1\n$$\n  \n$$\nR_2 = 1\\Omega\n$$\n\nThe resistance of the new wire is 1Ω.\n\n# QUESTIONS\n\n?\n\n- 1. On what factors does the resistance of a conductor depend?\n- 2. Will current flow more easily through a thick wire or a thin wire of the same material, when connected to the same source? Why?\n- 3. Let the resistance of an electrical component remains constant while the potential difference across the two ends of the component decreases to half of its former value. What change will occur in the current through it?\n- 4. Why are coils of electric toasters and electric irons made of an alloy rather than a pure metal?\n- 5. Use the data in Table 11.2 to answer the following –\n  - (a) Which among iron and mercury is a better conductor?\n  - (b) Which material is the best conductor?\n\n## 11.6 RESISTANCE OF A SYSTEM OF RESISTORS\n\nIn preceding sections, we learnt about some simple electric circuits. We have noticed how the current through a conductor depends upon its resistance and the potential difference across its ends. In various electrical gadgets, we often use resistors in various combinations. We now therefore intend to see how Ohm's law can be applied to combinations of resistors.\n\nThere are two methods of joining the resistors together. Figure 11.6 shows an electric circuit in which three resistors having resistances *R<sup>1</sup>* , *R2* and *R<sup>3</sup>* , respectively, are joined end to end. Here the resistors are said to be connected in series.\n\n![](_page_10_Figure_11.jpeg)\n\n*Figure 11.6 Resistors in series*\n\nFigure 11.7 shows a combination of resistors in which three resistors are connected together between points X and Y. Here, the resistors are said to be connected in parallel.\n\n![](_page_11_Figure_1.jpeg)\n\n*Figure 11.7 Resistors in parallel*\n\n## 11.6.1 Resistors in Series\n\nWhat happens to the value of current when a number of resistors are connected in series in a circuit? What would be their equivalent resistance? Let us try to understand these with the help of the following activities.\n\n## Activity 11.4\n\nn Join three resistors of different values in series. Connect them with a battery, an ammeter and a plug key, as shown in Fig. 11.6. You may use the resistors of values like 1 Ω, 2 Ω, 3 Ω etc., and a battery of 6 V for performing this Activity.\n\n- n Plug the key. Note the ammeter reading.\n- n Change the position of ammeter to anywhere in between the resistors. Note the ammeter reading each time.\n- n Do you find any change in the value of current through the ammeter?\n\nYou will observe that the value of the current in the ammeter is the same, independent of its position in the electric circuit. It means that in a series combination of resistors the current is the same in every part of the circuit or the same current through each resistor.\n\n## Activity 11.5\n\n- n In Activity 11.4, insert a voltmeter across the ends X and Y of the series combination of three resistors, as shown in Fig. 11.6.\n- n Plug the key in the circuit and note the voltmeter reading. It gives the potential difference across the series combination of resistors. Let it be *V*. Now measure the potential difference across the two terminals of the battery. Compare the two values.\n- n Take out the plug key and disconnect the voltmeter. Now insert the voltmeter across the ends X and P of the first resistor, as shown in Fig. 11.8.\n\n![](_page_12_Figure_4.jpeg)\n\n*Figure 11.8*\n\n- n Plug the key and measure the potential difference across the first resistor. Let it be *V<sup>1</sup>* .\n- n Similarly, measure the potential difference across the other two resistors, separately. Let these values be *V<sup>2</sup>* and *V<sup>3</sup>* , respectively.\n- <sup>n</sup> Deduce a relationship between *V*, *V<sup>1</sup>* , *V<sup>2</sup>* and *V<sup>3</sup>* .\n\nYou will observe that the potential difference *V* is equal to the sum of potential differences *V<sup>1</sup>* , *V<sup>2</sup>* , and *V<sup>3</sup>* . That is the total potential difference across a combination of resistors in series is equal to the sum of potential difference across the individual resistors. That is,\n\n$$\nV = V1 + V2 + V3\n$$\n\n(11.11)\n\nIn the electric circuit shown in Fig. 11.8, let *I* be the current through the circuit. The current through each resistor is also *I*. It is possible to replace the three resistors joined in series by an equivalent single resistor of resistance *R*, such that the potential difference *V* across it, and the current *I* through the circuit remains the same. Applying the Ohm's law to the entire circuit, we have\n\n$$\nV = IR \\tag{11.12}\n$$\n\nOn applying Ohm's law to the three resistors separately, we further have\n\n|     | V1<br>=<br>I R1                | [11.13(a)] |\n|-----|--------------------------------|------------|\n|     | V2<br>=<br>I R2                | [11.13(b)] |\n| and | V3<br>=<br>I R3                | [11.13(c)] |\n|     | From Eq. (11.11),              |            |\n|     | I R = I R1<br>+ I R2<br>+ I R3 |            |\n| or  | Rs<br>= R1<br>+R2<br>+ R3      | (11.14)    |\n\nWe can conclude that when several resistors are joined in series, the resistance of the combination *R<sup>s</sup>* equals the sum of their individual resistances, *R<sup>1</sup> , R<sup>2</sup> , R<sup>3</sup> ,* and is thus greater than any individual resistance.\n\n## Example 11.7\n\nAn electric lamp, whose resistance is 20 Ω, and a conductor of 4 Ω resistance are connected to a 6 V battery (Fig. 11.9). Calculate (a) the total resistance of the circuit, (b) the current through the circuit, and (c) the potential difference across the electric lamp and conductor.\n\n![](_page_13_Figure_5.jpeg)\n\n*Figure 11.9 An electric lamp connected in series with a resistor of 4* Ω *to a 6* V *battery*\n\n#### Solution\n\nThe resistance of electric lamp, *R<sup>1</sup>* = 20 Ω, The resistance of the conductor connected in series, *R<sup>2</sup>* = 4 Ω. Then the total resistance in the circuit\n\n*R = R<sup>1</sup> + R<sup>2</sup>*\n\n$$\nR_s = 20 \\Omega + 4 \\Omega = 24 \\Omega.\n$$\n\nThe total potential difference across the two terminals of the battery *V* = 6 V.\n\nNow by Ohm's law, the current through the circuit is given by\n\n- *I* = *V*/*R*<sup>s</sup>\n  - *=* 6 V/24 Ω\n  - = 0.25 A.\n\nApplying Ohm's law to the electric lamp and conductor separately, we get potential difference across the electric lamp,\n\n$$\nV_1 = 20 \\Omega \\times 0.25 \\text{ A}\n$$\n  \n= 5 V;\n\nand, that across the conductor, *V<sup>2</sup>* = 4 Ω × 0.25 A = 1 V.\n\nSuppose that we like to replace the series combination of electric lamp and conductor by a single and equivalent resistor. Its resistance must be such that a potential difference of 6 V across the battery terminals will cause a current of 0.25 A in the circuit. The resistance *R* of this equivalent resistor would be\n\n$$\nR = V/I\n$$\n  \n= 6 V/ 0.25 A  \n= 24 Ω.\n\nThis is the total resistance of the series circuit; it is equal to the sum of the two resistances.\n\n![](_page_14_Figure_6.jpeg)\n\n## 11.6.2 Resistors in Parallel\n\nNow, let us consider the arrangement of three resistors joined in parallel with a combination of cells (or a battery), as shown in Fig.11.7.\n\n## Activity 11.6\n\n- n Make a parallel combination, XY, of three resistors having resistances *R<sup>1</sup>* , *R<sup>2</sup>* , and *R<sup>3</sup>* , respectively. Connect it with a battery, a plug key and an ammeter, as shown in Fig. 11.10. Also connect a voltmeter in parallel with the combination of resistors.\n- n Plug the key and note the ammeter reading. Let the current be *I*. Also take the voltmeter reading. It gives the potential difference *V,* across the combination. The potential difference across each resistor is also *V*. This can be checked by connecting the voltmeter across each individual resistor (see Fig. 11.11). *Figure 11.10*\n\n![](_page_14_Figure_12.jpeg)\n\nn Take out the plug from the key. Remove the ammeter and voltmeter from the circuit. Insert the ammeter in series with the resistor *R<sup>1</sup> ,* as shown in Fig. 11.11. Note the ammeter reading, *I 1* .\n\n![](_page_15_Figure_1.jpeg)\n\n*Figure 11.11*\n\n<sup>n</sup> Similarly, measure the currents through *R<sup>2</sup>* and *R<sup>3</sup>* . Let these be *I 2* and *I 3* , respectively. What is the relationship between *I*, *I* 1 , *I* 2 and *I* 3 ?\n\n> It is observed that the total current *I*, is equal to the sum of the separate currents through each branch of the combination.\n\n$$\nI = I_1 + I_2 + I_3 \\tag{11.15}\n$$\n\nLet *R<sup>p</sup>* be the equivalent resistance of the parallel combination of resistors. By applying Ohm's law to the parallel combination of resistors, we have\n\n$$\nI = V/R_p \\tag{11.16}\n$$\n\nOn applying Ohm's law to each resistor, we have\n\n *+ V/R<sup>2</sup>*\n\n$$\nI_1 = V / R_1; \\quad I_2 = V / R_2; \\text{ and } I_3 = V / R_3 \\tag{11.17}\n$$\n\n *+ V/R<sup>3</sup>*\n\nFrom Eqs. (11.15) to (11.17), we have\n\n *= V/R<sup>1</sup>*\n\n *V/R<sup>p</sup>*\n\nor\n\n$$\n1/R_p = 1/R_1 + 1/R_2 + 1/R_3 \\tag{11.18}\n$$\n\nThus, we may conclude that the reciprocal of the equivalent resistance of a group of resistances joined in parallel is equal to the sum of the reciprocals of the individual resistances.\n\n#### Example 11.8\n\nIn the circuit diagram given in Fig. 11.10, suppose the resistors *R<sup>1</sup>* , *R2* and *R<sup>3</sup>* have the values 5 Ω, 10 Ω, 30 Ω, respectively, which have been connected to a battery of 12 V. Calculate (a) the current through each resistor, (b) the total current in the circuit, and (c) the total circuit resistance.\n\n#### Solution\n\n*R1* = 5 Ω, *R<sup>2</sup>* = 10 Ω, and *R<sup>3</sup>* = 30 Ω. Potential difference across the battery, *V* = 12 V.\n\nThis is also the potential difference across each of the individual resistor; therefore, to calculate the current in the resistors, we use Ohm's law.\n\nThe current *I 1* , through *R<sup>1</sup> = V/ R<sup>1</sup> I 1 =* 12 V/5 Ω = 2.4 A. The current *I 2* , through *R<sup>2</sup> = V/ R<sup>2</sup> I 2 =* 12 V/10 Ω = 1.2 A. The current *I 3* , through *R<sup>3</sup> = V/R<sup>3</sup> I 3 =* 12 V/30 Ω = 0.4 A. The total current in the circuit, *I* = *I 1* + *I<sup>2</sup>* + *I<sup>3</sup>* = (2.4 + 1.2 + 0.4) A = 4 A The total resistance *R<sup>p</sup>* , is given by [Eq. (11.18)] 1 1 1 1 1 *R<sup>p</sup>* 5 10 30 3 = + + =\n\nThus, *R<sup>p</sup>* = 3 Ω.\n\n## Example 11.9\n\nIf in Fig. 11.12, *R<sup>1</sup>* = 10 Ω, *R<sup>2</sup> =* 40 Ω, *R<sup>3</sup> =* 30 Ω, *R<sup>4</sup> =* 20 Ω, *R<sup>5</sup> =* 60 Ω, and a 12 V battery is connected to the arrangement. Calculate (a) the total resistance in the circuit, and (b) the total current flowing in the circuit.\n\n## Solution\n\nSuppose we replace the parallel resistors *R<sup>1</sup>* and *R<sup>2</sup>* by an equivalent resistor of resistance, *R*′. Similarly we replace the parallel resistors *R<sup>3</sup>* , *R<sup>4</sup>* and *R<sup>5</sup>* by an equivalent single resistor of resistance *R*″. Then using Eq. (11.18), we have 1/ *R*′ = 1/10 + 1/40 = 5/40; that is *R*′ = 8 Ω. Similarly, 1/ *R*″ = 1/30 + 1/20 + 1/60 = 6/60; that is, *R*″ = 10 Ω. Thus, the total resistance, *R = R*′ *+ R*″ = 18 Ω. To calculate the current, we use Ohm's law, and get\n\n *I = V/R =* 12 V/18 Ω = 0.67 A.\n\nWe have seen that in a series circuit the current is constant throughout the electric circuit. Thus it is obviously impracticable to connect an electric bulb and an electric heater in series, because they need currents of widely different values to operate properly (see Example 11.3). Another major disadvantage of a series circuit is that when one component fails the circuit is broken and none of the components works. If you have used 'fairy lights' to decorate buildings on festivals, on marriage celebrations etc., you might have seen the electrician spending lot of time in trouble-locating and replacing the 'dead' bulb – each has to be tested to find which has fused or gone. On the other hand, a parallel circuit divides the current through the electrical gadgets. The total resistance in a parallel circuit is decreased as per Eq. (11.18). This is helpful particularly when each gadget has different resistance and requires different current to operate properly.\n\n![](_page_16_Figure_9.jpeg)\n\n# QUESTIONS\n\n- 1. Judge the equivalent resistance when the following are connected in parallel – (a) 1 Ω and 10<sup>6</sup> Ω, (b) 1 Ω and 10<sup>3</sup> Ω, and 10<sup>6</sup> Ω.\n- 2. An electric lamp of 100 Ω, a toaster of resistance 50 Ω, and a water filter of resistance 500 Ω are connected in parallel to a 220 V source. What is the resistance of an electric iron connected to the same source that takes as much current as all three appliances, and what is the current through it?\n- 3. What are the advantages of connecting electrical devices in parallel with the battery instead of connecting them in series?\n- 4. How can three resistors of resistances 2 Ω, 3 Ω, and 6 Ω be connected to give a total resistance of (a) 4 Ω, (b) 1 Ω?\n- 5. What is (a) the highest, (b) the lowest total resistance that can be secured by combinations of four coils of resistance 4 Ω, 8 Ω, 12 Ω, 24 Ω?\n\n## 11.7 HEA 11.7 HEA11.7 HEATING EFFECT OF ELECTRIC CURRENT\n\nWe know that a battery or a cell is a source of electrical energy. The chemical reaction within the cell generates the potential difference between its two terminals that sets the electrons in motion to flow the current through a resistor or a system of resistors connected to the battery. We have also seen, in Section 11.2, that to maintain the current, the source has to keep expending its energy. Where does this energy go? A part of the source energy in maintaining the current may be consumed into useful work (like in rotating the blades of an electric fan). Rest of the source energy may be expended in heat to raise the temperature of gadget. We often observe this in our everyday life. For example, an electric fan becomes warm if used continuously for longer time etc. On the other hand, if the electric circuit is purely resistive, that is, a configuration of resistors only connected to a battery; the source energy continually gets dissipated entirely in the form of heat. This is known as the heating effect of electric current. This effect is utilised in devices such as electric heater, electric iron etc.\n\nConsider a current *I* flowing through a resistor of resistance *R*. Let the potential difference across it be *V* (Fig. 11.13). Let *t* be the time during which a charge *Q* flows across. The work done in moving the charge *Q* through a potential difference *V* is *VQ*. Therefore, the source must supply energy equal to *VQ* in time *t.* Hence the power input to the circuit by the source is\n\n$$\nP = V \\frac{Q}{t} = VI \\tag{11.19}\n$$\n\nOr the energy supplied to the circuit by the source in time *t* is *P* × *t*, that is, *VIt.* What happens to this energy expended by the source? This energy gets dissipated in the resistor as heat. Thus for a steady current *I*, the amount of heat *H* produced in time *t* is\n\n*H = VIt* (11.20)\n\n?\n\nApplying Ohm's law [Eq. (11.5)], we get\n\n## *H = I<sup>2</sup>*\n\n *Rt* (11.21)\n\nThis is known as Joule's law of heating. The law implies that heat produced in a resistor is (i) directly proportional to the square of current for a given resistance, (ii) directly proportional to resistance for a given current, and (iii) directly proportional to the time for which the current flows through the resistor. In practical situations, when an electric appliance is connected to a known voltage source, Eq. (11.21) is used after calculating the current through it, using the relation *I = V/R*.\n\n![](_page_18_Figure_4.jpeg)\n\n![](_page_18_Figure_5.jpeg)\n\n## Example 11.10\n\nAn electric iron consumes energy at a rate of 840 W when heating is at the maximum rate and 360 W when the heating is at the minimum. The voltage is 220 V. What are the current and the resistance in each case?\n\n## Solution\n\nFrom Eq. (11.19), we know that the power input is *P = V I* Thus the current *I = P/V*\n\n- (a) When heating is at the maximum rate, *I =* 840 W/220 V = 3.82 A; and the resistance of the electric iron is *R = V/I* = 220 V/3.82 A = 57.60 Ω.\n- (b) When heating is at the minimum rate, *I =* 360 W/220 V = 1.64 A; and the resistance of the electric iron is *R = V/I* = 220 V/1.64 A = 134.15 Ω.\n\n## Example 11.11\n\n100 J of heat is produced each second in a 4 Ω resistance. Find the potential difference across the resistor.\n\n#### Solution\n\n*H* = 100 J, *R* = 4 Ω, *t* = 1 s, *V* = ? From Eq. (11.21) we have the current through the resistor as *I =* √(*H/Rt*) = √[100 J/(4 Ω × 1 s)] = 5 A Thus the potential difference across the resistor, *V* [from Eq. (11.5)] is\n\n*V* = *IR* = 5 A × 4 Ω = 20 V.\n\n# QUESTIONS\n\n- 1. Why does the cord of an electric heater not glow while the heating element does?\n- 2. Compute the heat generated while transferring 96000 coulomb of charge in one hour through a potential difference of 50 V.\n- 3. An electric iron of resistance 20 Ω takes a current of 5 A. Calculate the heat developed in 30 s.\n\n## 11.7.1 Practical Applications of Heating Effect of Electric Current\n\nThe generation of heat in a conductor is an inevitable consequence of electric current. In many cases, it is undesirable as it converts useful electrical energy into heat. In electric circuits, the unavoidable heating can increase the temperature of the components and alter their properties. However, heating effect of electric current has many useful applications. The electric laundry iron, electric toaster, electric oven, electric kettle and electric heater are some of the familiar devices based on Joule's heating.\n\nThe electric heating is also used to produce light, as in an electric bulb. Here, the filament must retain as much of the heat generated as is possible, so that it gets very hot and emits light. It must not melt at such high temperature. A strong metal with high melting point such as tungsten (melting point 3380°C) is used for making bulb filaments. The filament should be thermally isolated as much as possible, using insulating support, etc. The bulbs are usually filled with chemically inactive nitrogen and argon gases to prolong the life of filament. Most of the power consumed by the filament appears as heat, but a small part of it is in the form of light radiated.\n\nAnother common application of Joule's heating is the fuse used in electric circuits. It protects circuits and appliances by stopping the flow of any unduly high electric current. The fuse is placed in series with the device. It consists of a piece of wire made of a metal or an alloy of appropriate melting point, for example aluminium, copper, iron, lead etc. If a current larger than the specified value flows through the circuit, the temperature of the fuse wire increases. This melts the fuse wire and breaks the circuit. The fuse wire is usually encased in a cartridge of porcelain or similar material with metal ends. The fuses used for domestic purposes are rated as 1 A, 2 A, 3 A, 5 A, 10 A, etc. For an electric iron which consumes 1 kW electric power when operated at 220 V, a current of (1000/220) A, that is, 4.54 A will flow in the circuit. In this case, a 5 A fuse must be used.\n\n?\n\n## 11.8 ELECTRIC POWER\n\nYou have studied in your earlier Class that the rate of doing work is power. This is also the rate of consumption of energy.\n\nEquation (11.21) gives the rate at which electric energy is dissipated or consumed in an electric circuit. This is also termed as electric power. The power *P* is given by\n\n$$\nP = VI\n$$\n  \nOr \n$$\nP = P^2R = V^2/R\n$$\n (11.22)\n\nThe SI unit of electric power is watt (W). It is the power consumed by a device that carries 1 A of current when operated at a potential difference of 1 V. Thus,\n\n```\n 1 W = 1 volt × 1 ampere = 1 V A (11.23)\n```\n\nThe unit 'watt' is very small. Therefore, in actual practice we use a much larger unit called 'kilowatt'. It is equal to 1000 watts. Since electrical energy is the product of power and time, the unit of electric energy is, therefore, watt hour (W h). One watt hour is the energy consumed when 1 watt of power is used for 1 hour. The commercial unit of electric energy is kilowatt hour (kW h), commonly known as 'unit'.\n\n1 kW h = 1000 watt × 3600 second\n\n- = 3.6 × 10<sup>6</sup> watt second\n- = 3.6 × 10<sup>6</sup> joule (J)\n\n# More to Know!\n\nMany people think that electrons are consumed in an electric circuit. This is wrong! We pay the electricity board or electric company to provide energy to move electrons through the electric gadgets like electric bulb, fan and engines. We pay for the energy that we use.\n\n## Example 11.12\n\nAn electric bulb is connected to a 220 V generator. The current is 0.50 A. What is the power of the bulb?\n\n## Solution\n\n- *P = VI*\n  - = 220 V × 0.50 A\n  - = 110 J/s\n  - = 110 W.\n\n#### Example 11.13\n\nAn electric refrigerator rated 400 W operates 8 hour/day. What is the cost of the energy to operate it for 30 days at Rs 3.00 per kW h?\n\n## Solution\n\nThe total energy consumed by the refrigerator in 30 days would be 400 W × 8.0 hour/day × 30 days = 96000 W h\n\n$$\n= 96 \\text{ kW h}\n$$\n\n?\n\nThus the cost of energy to operate the refrigerator for 30 days is 96 kW h × Rs 3.00 per kW h = Rs 288.00\n\n# QUESTIONS\n\n1. What determines the rate at which energy is delivered by a current?\n\n2. An electric motor takes 5 A from a 220 V line. Determine the power of the motor and the energy consumed in 2 h.\n\n# What you have learnt\n\n- n A stream of electrons moving through a conductor constitutes an electric current. Conventionally, the direction of current is taken opposite to the direction of flow of electrons.\n- n The SI unit of electric current is ampere.\n- n To set the electrons in motion in an electric circuit, we use a cell or a battery. A cell generates a potential difference across its terminals. It is measured in volts (V).\n- n Resistance is a property that resists the flow of electrons in a conductor. It controls the magnitude of the current. The SI unit of resistance is ohm (Ω).\n- n Ohm's law: The potential difference across the ends of a resistor is directly proportional to the current through it, provided its temperature remains the same.\n- n The resistance of a conductor depends directly on its length, inversely on its area of cross-section, and also on the material of the conductor.\n- n The equivalent resistance of several resistors in series is equal to the sum of their individual resistances.\n- <sup>n</sup> A set of resistors connected in parallel has an equivalent resistance *R<sup>p</sup>* given by\n\n$$\n\\frac{1}{R_p} = \\frac{1}{R_1} + \\frac{1}{R_2} + \\frac{1}{R_3} + \\dots\n$$\n\n- n The electrical energy dissipated in a resistor is given by *W = V* × *I* × *t*\n- n The unit of power is watt (W). One watt of power is consumed when 1 A of current flows at a potential difference of 1 V.\n- n The commercial unit of electrical energy is kilowatt hour (kWh). 1 kW h = 3,600,000 J = 3.6 × 10<sup>6</sup> J.\n\n# EXERCISES\n\n- 1. A piece of wire of resistance *R* is cut into five equal parts. These parts are then connected in parallel. If the equivalent resistance of this combination is *R*′, then the ratio *R/R*′ is –\n- (a) 1/25 (b) 1/5 (c) 5 (d) 25 2. Which of the following terms does not represent electrical power in a circuit?\n  - (a) *I <sup>2</sup>R* (b) *IR<sup>2</sup>* (c) *VI* (d) *V <sup>2</sup>/R*\n- 3. An electric bulb is rated 220 V and 100 W. When it is operated on 110 V, the power consumed will be –\n  - (a) 100 W (b) 75 W (c) 50 W (d) 25 W\n\n4. Two conducting wires of the same material and of equal lengths and equal diameters are first connected in series and then parallel in a circuit across the same potential difference. The ratio of heat produced in series and parallel combinations would be – (a) 1:2 (b) 2:1 (c) 1:4 (d) 4:1\n\n- 5. How is a voltmeter connected in the circuit to measure the potential difference between two points?\n- 6. A copper wire has diameter 0.5 mm and resistivity of 1.6 × 10–8 Ω m. What will be the length of this wire to make its resistance 10 Ω? How much does the resistance change if the diameter is doubled?\n- 7. The values of current *I* flowing in a given resistor for the corresponding values of potential difference *V* across the resistor are given below –\n\n| I (amperes) | 0.5 | 1.0 | 2.0 | 3.0  | 4.0  |\n|-------------|-----|-----|-----|------|------|\n| V (volts)   | 1.6 | 3.4 | 6.7 | 10.2 | 13.2 |\n\nPlot a graph between *V* and *I* and calculate the resistance of that resistor.\n\n- 8. When a 12 V battery is connected across an unknown resistor, there is a current of 2.5 mA in the circuit. Find the value of the resistance of the resistor.\n- 9. A battery of 9 V is connected in series with resistors of 0.2 Ω, 0.3 Ω, 0.4 Ω , 0.5 Ω and 12 Ω, respectively. How much current would flow through the 12 Ω resistor?\n- 10. How many 176 Ω resistors (in parallel) are required to carry 5 A on a 220 V line?\n- 11. Show how you would connect three resistors, each of resistance 6 Ω, so that the combination has a resistance of (i) 9 Ω, (ii) 4 Ω.\n- 12. Several electric bulbs designed to be used on a 220 V electric supply line, are rated 10 W. How many lamps can be connected in parallel with each other across the two wires of 220 V line if the maximum allowable current is 5 A?\n- 13. A hot plate of an electric oven connected to a 220 V line has two resistance coils A and B, each of 24 Ω resistance, which may be used separately, in series, or in parallel. What are the currents in the three cases?\n- 14. Compare the power used in the 2 Ω resistor in each of the following circuits: (i) a 6 V battery in series with 1 Ω and 2 Ω resistors, and (ii) a 4 V battery in parallel with 12 Ω and 2 Ω resistors.\n\n- 15. Two lamps, one rated 100 W at 220 V, and the other 60 W at 220 V, are connected in parallel to electric mains supply. What current is drawn from the line if the supply voltage is 220 V?\n- 16. Which uses more energy, a 250 W TV set in 1 hr, or a 1200 W toaster in 10 minutes?\n- 17. An electric heater of resistance 44 Ω draws 5 A from the service mains for 2 hours. Calculate the rate at which heat is developed in the heater.\n- 18. Explain the following.\n  - (a) Why is the tungsten used almost exclusively for filament of electric lamps?\n  - (b) Why are the conductors of electric heating devices, such as bread-toasters and electric irons, made of an alloy rather than a pure metal?\n  - (c) Why is the series arrangement not used for domestic circuits?\n  - (d) How does the resistance of a wire vary with its area of cross-section?\n  - (e) Why are copper and aluminium wires usually employed for electricity transmission?",
        "structured_data": {
            "error": "No structured data available"
        },
        "images": [
            {
                "name": "_page_0_Picture_0.jpeg",
                "path": "/home/content/converted_books/images/jesc111/_page_0_Picture_0.jpeg",
                "size_bytes": 17114,
                "description": "This image shows the chapter title page for \"Chapter 11: Electricity\" with a simple electric circuit diagram on the left side. The circuit diagram includes a battery, wires, resistors (shown as zigzag lines), and what appears to be a light bulb or measuring device, illustrating the basic components that will be studied in this electricity chapter.",
                "description_generated_at": "2025-07-19 12:11:25"
            },
            {
                "name": "_page_0_Picture_1.jpeg",
                "path": "/home/content/converted_books/images/jesc111/_page_0_Picture_1.jpeg",
                "size_bytes": 11133,
                "description": "This image shows a QR code labeled \"1064CH12\" at the bottom, which appears to be a digital resource link for students to access additional materials related to Chapter 12 on electricity. The QR code serves as a quick way for students to connect their mobile devices to supplementary online content that supports the chapter's topics on electric current, circuits, and electrical applications.",
                "description_generated_at": "2025-07-19 12:11:25"
            },
            {
                "name": "_page_1_Figure_3.jpeg",
                "path": "/home/content/converted_books/images/jesc111/_page_1_Figure_3.jpeg",
                "size_bytes": 10350,
                "description": "This diagram shows a simple electric circuit schematic containing a cell/battery (marked with + and - terminals), an electric bulb, an ammeter (marked with \"A\"), and a plug key/switch (marked with \"K\"). The arrows indicate the direction of conventional current flow from the positive terminal of the cell through the circuit components and back to the negative terminal, illustrating how current flows in a complete electrical circuit.",
                "description_generated_at": "2025-07-19 12:11:25"
            },
            {
                "name": "_page_1_Figure_11.jpeg",
                "path": "/home/content/converted_books/images/jesc111/_page_1_Figure_11.jpeg",
                "size_bytes": 44177,
                "description": "This image shows a \"Questions\" section from the textbook with three review questions listed in blue text. The questions ask students to define what an electric circuit means, define the unit of current, and calculate the number of electrons in one coulomb of charge, serving as practice problems to reinforce the concepts about electric circuits and current discussed in the chapter.",
                "description_generated_at": "2025-07-19 12:11:25"
            },
            {
                "name": "_page_3_Figure_0.jpeg",
                "path": "/home/content/converted_books/images/jesc111/_page_3_Figure_0.jpeg",
                "size_bytes": 5123,
                "description": "This image shows a mathematical calculation demonstrating how to find the work done in moving an electric charge, using the formula W = VQ where work equals 12 V × 2 C = 24 J. The calculation serves as a worked example to illustrate the relationship between potential difference, charge, and work done in an electrical context.",
                "description_generated_at": "2025-07-19 12:11:25"
            },
            {
                "name": "_page_4_Figure_6.jpeg",
                "path": "/home/content/converted_books/images/jesc111/_page_4_Figure_6.jpeg",
                "size_bytes": 18773,
                "description": "This circuit diagram shows the experimental setup for studying Ohm's law, featuring a nichrome wire (XY) connected to variable voltage sources (cells), with an ammeter (A) to measure current and a voltmeter (V) to measure potential difference across the wire. The setup allows students to investigate the relationship between voltage and current by using different numbers of cells and measuring the corresponding electrical values.",
                "description_generated_at": "2025-07-19 12:11:25"
            },
            {
                "name": "_page_5_Figure_0.jpeg",
                "path": "/home/content/converted_books/images/jesc111/_page_5_Figure_0.jpeg",
                "size_bytes": 15856,
                "description": "This graph shows the linear relationship between voltage (V) and current (I) for a nichrome wire, with voltage on the y-axis (0-2.0 V) and current on the x-axis (0-0.6 A). The straight line passing through the origin with plotted data points demonstrates Ohm's law, illustrating that voltage and current are directly proportional in a metallic conductor.",
                "description_generated_at": "2025-07-19 12:11:25"
            },
            {
                "name": "_page_6_Figure_0.jpeg",
                "path": "/home/content/converted_books/images/jesc111/_page_6_Figure_0.jpeg",
                "size_bytes": 28622,
                "description": "This circuit diagram shows an experimental setup with four 1.5V batteries connected in series, an ammeter (marked 'A'), and a gap XY where different components can be inserted, along with separate illustrations of the three components to be tested: a nichrome wire, a torch bulb, and a 10W bulb. The diagram is designed to help students understand how different materials have different electrical resistances by measuring the current flow through each component when placed in the circuit.",
                "description_generated_at": "2025-07-19 12:11:25"
            },
            {
                "name": "_page_7_Picture_0.jpeg",
                "path": "/home/content/converted_books/images/jesc111/_page_7_Picture_0.jpeg",
                "size_bytes": 17267,
                "description": "This circuit diagram shows an experimental setup with a cell, ammeter (A), and plug key (K) connected to four different wires labeled (1) through (4) that vary in length, thickness, and material (nichrome vs. copper). The diagram illustrates Activity 11.3, which demonstrates how a conductor's resistance depends on factors like length, cross-sectional area, and material type by measuring current changes when different wires are connected in the circuit.",
                "description_generated_at": "2025-07-19 12:11:25"
            },
            {
                "name": "_page_10_Figure_11.jpeg",
                "path": "/home/content/converted_books/images/jesc111/_page_10_Figure_11.jpeg",
                "size_bytes": 18369,
                "description": "This circuit diagram illustrates three resistors (R₁, R₂, and R₃) connected in series with a battery, ammeter (A), voltmeter (V), and switch (K). The diagram demonstrates how resistors are arranged end-to-end in a series configuration, where current flows through each resistor sequentially in a single path.",
                "description_generated_at": "2025-07-19 12:11:25"
            },
            {
                "name": "_page_11_Figure_1.jpeg",
                "path": "/home/content/converted_books/images/jesc111/_page_11_Figure_1.jpeg",
                "size_bytes": 22928,
                "description": "This circuit diagram shows three resistors (R₁, R₂, and R₃) connected in parallel between points X and Y, with a voltmeter measuring the voltage across them and an ammeter (A) measuring the total current in the circuit. The diagram illustrates how resistors are arranged in parallel configuration, where each resistor provides a separate path for current to flow between the same two points.",
                "description_generated_at": "2025-07-19 12:11:25"
            },
            {
                "name": "_page_12_Figure_4.jpeg",
                "path": "/home/content/converted_books/images/jesc111/_page_12_Figure_4.jpeg",
                "size_bytes": 24312,
                "description": "This circuit diagram shows three resistors (R₁, R₂, R₃) connected in series with a battery, ammeter (A), and key (K), with three voltmeters (V₁, V₂, V₃) connected across each individual resistor to measure their respective potential differences. The diagram illustrates how to experimentally verify that the total voltage across resistors in series equals the sum of individual voltage drops across each resistor.",
                "description_generated_at": "2025-07-19 12:11:25"
            },
            {
                "name": "_page_13_Figure_5.jpeg",
                "path": "/home/content/converted_books/images/jesc111/_page_13_Figure_5.jpeg",
                "size_bytes": 22127,
                "description": "This circuit diagram shows a series circuit with a 6V battery connected to a 4Ω resistor and an electric lamp, with an ammeter (A) and switch (K) included to measure current and control the circuit. The diagram illustrates Example 11.7, demonstrating how to calculate total resistance, current, and voltage drops in a series circuit with two resistors.",
                "description_generated_at": "2025-07-19 12:11:25"
            },
            {
                "name": "_page_14_Figure_6.jpeg",
                "path": "/home/content/converted_books/images/jesc111/_page_14_Figure_6.jpeg",
                "size_bytes": 70354,
                "description": "This image shows a \"Questions\" section from a physics textbook with two practice problems about electrical circuits. The questions ask students to draw circuit diagrams with batteries, resistors, and measuring instruments (ammeters and voltmeters) in series configurations, helping them apply the concepts of series resistance and Ohm's law that were just explained in the preceding text.",
                "description_generated_at": "2025-07-19 12:11:25"
            },
            {
                "name": "_page_14_Figure_12.jpeg",
                "path": "/home/content/converted_books/images/jesc111/_page_14_Figure_12.jpeg",
                "size_bytes": 23370,
                "description": "This circuit diagram shows three resistors (R₁, R₂, and R₃) connected in parallel between points X and Y, with a battery, ammeter (A), voltmeter (V), and plug key (K) to demonstrate how to measure total current and voltage in a parallel circuit. The diagram illustrates the experimental setup for Activity 11.6, where students learn that in parallel circuits, each resistor experiences the same voltage while the total current equals the sum of individual branch currents.",
                "description_generated_at": "2025-07-19 12:11:25"
            },
            {
                "name": "_page_15_Figure_1.jpeg",
                "path": "/home/content/converted_books/images/jesc111/_page_15_Figure_1.jpeg",
                "size_bytes": 16771,
                "description": "This circuit diagram shows three resistors (R₁, R₂, and R₃) connected in parallel between points X and Y, with a voltmeter measuring voltage across the combination and an ammeter measuring current through resistor R₁. The diagram illustrates how to measure individual branch currents in a parallel circuit, demonstrating that each resistor has the same voltage across it while carrying different currents.",
                "description_generated_at": "2025-07-19 12:11:25"
            },
            {
                "name": "_page_16_Figure_9.jpeg",
                "path": "/home/content/converted_books/images/jesc111/_page_16_Figure_9.jpeg",
                "size_bytes": 10251,
                "description": "This figure shows an electric circuit diagram that demonstrates how resistors can be connected in both series and parallel combinations within the same circuit. The diagram illustrates the practical application of mixed circuit configurations, helping students understand how electrical components can be arranged to achieve different resistance values and current distributions.",
                "description_generated_at": "2025-07-19 12:11:25"
            },
            {
                "name": "_page_18_Figure_4.jpeg",
                "path": "/home/content/converted_books/images/jesc111/_page_18_Figure_4.jpeg",
                "size_bytes": 13722,
                "description": "This circuit diagram shows a simple electrical circuit with a resistor (R) connected to a battery, with a voltmeter (V) measuring the voltage across the resistor and an ammeter (A) measuring the current flowing through it. The diagram illustrates the experimental setup used to demonstrate Joule's law of heating, showing how electrical energy is converted to heat energy in the resistor when current flows through it.",
                "description_generated_at": "2025-07-19 12:11:25"
            },
            {
                "name": "_page_18_Figure_5.jpeg",
                "path": "/home/content/converted_books/images/jesc111/_page_18_Figure_5.jpeg",
                "size_bytes": 7494,
                "description": "This figure shows a simple electric circuit diagram illustrating a steady current flowing through a purely resistive circuit. The diagram demonstrates the basic setup used to understand Joule's law of heating, where electrical energy is converted to heat energy in a resistor when current flows through it.",
                "description_generated_at": "2025-07-19 12:11:25"
            }
        ],
        "exercises": [
            {
                "question": "Name a device that helps to maintain a potential difference across a conductor.",
                "answer": "A battery or cell helps to maintain a potential difference across a conductor. The chemical action within a cell generates the potential difference across its terminals, which sets the charges in motion in the conductor and produces an electric current. When the cell is connected to a conducting circuit element, the potential difference drives the flow of electrons through the conductor."
            },
            {
                "question": "What is meant by saying that the potential difference between two points is 1 V?",
                "answer": "When we say the potential difference between two points is 1 V, it means that 1 joule of work is done to move 1 coulomb of charge from one point to the other. In other words, 1 volt is the potential difference between two points in a current-carrying conductor when 1 joule of work is done to move a charge of 1 coulomb from one point to the other. This is expressed as: 1 V = 1 J/C."
            },
            {
                "question": "How much energy is given to each coulomb of charge passing through a 6 V battery?",
                "answer": "Each coulomb of charge passing through a 6 V battery is given 6 joules of energy. This is because potential difference (V) = Work done (W) / Charge (Q), so W = V × Q. For 1 coulomb of charge: W = 6 V × 1 C = 6 J. Therefore, each coulomb of charge gains 6 joules of energy when it passes through a 6 V battery."
            },
            {
                "question": "On what factors does the resistance of a conductor depend?",
                "answer": "The resistance of a conductor depends on three main factors: (1) Length (l) - resistance is directly proportional to the length of the conductor, (2) Area of cross-section (A) - resistance is inversely proportional to the area of cross-section, and (3) Nature of material - different materials have different resistivities (ρ). The relationship is given by R = ρl/A, where ρ is the resistivity of the material."
            },
            {
                "question": "Will current flow more easily through a thick wire or a thin wire of the same material, when connected to the same source? Why?",
                "answer": "Current will flow more easily through a thick wire than a thin wire of the same material. This is because resistance is inversely proportional to the area of cross-section (R ∝ 1/A). A thick wire has a larger cross-sectional area, which means lower resistance. According to Ohm's law (I = V/R), for the same voltage, lower resistance allows more current to flow. Therefore, a thick wire offers less opposition to current flow compared to a thin wire."
            },
            {
                "question": "Let the resistance of an electrical component remains constant while the potential difference across the two ends of the component decreases to half of its former value. What change will occur in the current through it?",
                "answer": "According to Ohm's law, I = V/R. If the resistance R remains constant and the potential difference V decreases to half its former value (V/2), then the new current will be: I' = (V/2)/R = (1/2) × (V/R) = I/2. Therefore, the current through the component will also decrease to half of its former value."
            },
            {
                "question": "Why are coils of electric toasters and electric irons made of an alloy rather than a pure metal?",
                "answer": "Coils of electric toasters and electric irons are made of alloys rather than pure metals because: (1) Alloys have higher resistivity than pure metals, which helps generate more heat for the same current, (2) Alloys do not oxidize (burn) readily at high temperatures, making them more durable, (3) Alloys can withstand high temperatures without melting or degrading, and (4) The resistance of alloys remains relatively stable at high temperatures, ensuring consistent performance."
            },
            {
                "question": "Use the data in Table 11.2 to answer the following – (a) Which among iron and mercury is a better conductor? (b) Which material is the best conductor?",
                "answer": "(a) Iron is a better conductor than mercury. From Table 11.2, iron has a resistivity of 10.0 × 10⁻⁸ Ω m while mercury has 94.0 × 10⁻⁸ Ω m. Since lower resistivity means better conductivity, iron is the better conductor. (b) Silver is the best conductor among all materials listed in the table, with the lowest resistivity of 1.60 × 10⁻⁸ Ω m."
            },
            {
                "question": "Judge the equivalent resistance when the following are connected in parallel – (a) 1 Ω and 10⁶ Ω, (b) 1 Ω and 10³ Ω, and 10⁶ Ω.",
                "answer": "For parallel combinations, 1/Rp = 1/R₁ + 1/R₂ + ... (a) For 1 Ω and 10⁶ Ω: 1/Rp = 1/1 + 1/10⁶ = 1 + 0.000001 ≈ 1, so Rp ≈ 1 Ω. (b) For 1 Ω, 10³ Ω, and 10⁶ Ω: 1/Rp = 1/1 + 1/10³ + 1/10⁶ = 1 + 0.001 + 0.000001 ≈ 1.001, so Rp ≈ 1 Ω. In parallel combinations, the equivalent resistance is always less than the smallest individual resistance and is dominated by the smallest resistor."
            },
            {
                "question": "An electric lamp of 100 Ω, a toaster of resistance 50 Ω, and a water filter of resistance 500 Ω are connected in parallel to a 220 V source. What is the resistance of an electric iron connected to the same source that takes as much current as all three appliances, and what is the current through it?",
                "answer": "First, find the equivalent resistance of the parallel combination: 1/Rp = 1/100 + 1/50 + 1/500 = 0.01 + 0.02 + 0.002 = 0.032, so Rp = 31.25 Ω. Current through this combination: I = V/Rp = 220/31.25 = 7.04 A. For the electric iron to take the same current (7.04 A) from the same source (220 V): R = V/I = 220/7.04 = 31.25 Ω. Therefore, the resistance of the electric iron should be 31.25 Ω, and the current through it will be 7.04 A."
            },
            {
                "question": "What are the advantages of connecting electrical devices in parallel with the battery instead of connecting them in series?",
                "answer": "Advantages of parallel connection: (1) Each device gets the full battery voltage, ensuring proper operation, (2) Each device can be controlled independently with separate switches, (3) If one device fails, others continue to work normally, (4) Different devices can draw different currents as per their requirements, (5) Total resistance decreases, allowing more current to flow, (6) More practical for household wiring where different appliances need different operating conditions."
            },
            {
                "question": "How can three resistors of resistances 2 Ω, 3 Ω, and 6 Ω be connected to give a total resistance of (a) 4 Ω, (b) 1 Ω?",
                "answer": "(a) To get 4 Ω: Connect 3 Ω and 6 Ω in parallel first: 1/R = 1/3 + 1/6 = 3/6 = 1/2, so R = 2 Ω. Then connect this 2 Ω in series with the 2 Ω resistor: Total = 2 + 2 = 4 Ω. (b) To get 1 Ω: Connect 2 Ω and 3 Ω in series first: R = 2 + 3 = 5 Ω. Then connect this 5 Ω in parallel with 6 Ω: 1/R = 1/5 + 1/6 = (6+5)/(5×6) = 11/30, so R = 30/11 ≈ 2.73 Ω. Actually, to get exactly 1 Ω, connect all three in parallel: 1/R = 1/2 + 1/3 + 1/6 = (3+2+1)/6 = 1, so R = 1 Ω."
            },
            {
                "question": "What is (a) the highest, (b) the lowest total resistance that can be secured by combinations of four coils of resistance 4 Ω, 8 Ω, 12 Ω, 24 Ω?",
                "answer": "(a) Highest resistance is obtained by connecting all resistors in series: R = 4 + 8 + 12 + 24 = 48 Ω. (b) Lowest resistance is obtained by connecting all resistors in parallel: 1/R = 1/4 + 1/8 + 1/12 + 1/24. Finding LCM of denominators (24): 1/R = 6/24 + 3/24 + 2/24 + 1/24 = 12/24 = 1/2. Therefore, R = 2 Ω."
            },
            {
                "question": "Why does the cord of an electric heater not glow while the heating element does?",
                "answer": "The cord of an electric heater does not glow while the heating element does because: (1) The cord is made of good conducting material (like copper) with very low resistance, so it produces minimal heat according to H = I²Rt, (2) The heating element is made of high-resistance material (like nichrome) which produces much more heat for the same current, (3) The cord is designed to carry current with minimum energy loss, while the heating element is designed to convert electrical energy into heat, (4) The heating element gets hot enough to glow (red hot), while the cord remains relatively cool."
            },
            {
                "question": "Compute the heat generated while transferring 96000 coulomb of charge in one hour through a potential difference of 50 V.",
                "answer": "Given: Charge Q = 96000 C, Time t = 1 hour = 3600 s, Potential difference V = 50 V. Heat generated = Work done = V × Q = 50 V × 96000 C = 4,800,000 J = 4.8 × 10⁶ J. Alternatively, we can find current first: I = Q/t = 96000/3600 = 26.67 A. Then H = VIt = 50 × 26.67 × 3600 = 4.8 × 10⁶ J. Therefore, the heat generated is 4.8 × 10⁶ J or 4.8 MJ."
            },
            {
                "question": "An electric iron of resistance 20 Ω takes a current of 5 A. Calculate the heat developed in 30 s.",
                "answer": "Given: Resistance R = 20 Ω, Current I = 5 A, Time t = 30 s. Using Joule's law of heating: H = I²Rt = (5)² × 20 × 30 = 25 × 20 × 30 = 15,000 J = 15 kJ. Therefore, the heat developed in the electric iron in 30 seconds is 15,000 J or 15 kJ."
            },
            {
                "question": "What determines the rate at which energy is delivered by a current?",
                "answer": "The rate at which energy is delivered by a current is called electric power, and it is determined by: (1) The potential difference (V) across the circuit, (2) The current (I) flowing through the circuit. Power P = VI. It can also be expressed as P = I²R or P = V²/R using Ohm's law. The power represents how quickly electrical energy is being consumed or converted to other forms of energy (like heat, light, or mechanical work) in the circuit."
            },
            {
                "question": "An electric motor takes 5 A from a 220 V line. Determine the power of the motor and the energy consumed in 2 h.",
                "answer": "Given: Current I = 5 A, Voltage V = 220 V, Time t = 2 hours. Power of the motor: P = VI = 220 × 5 = 1100 W = 1.1 kW. Energy consumed in 2 hours: Energy = Power × Time = 1.1 kW × 2 h = 2.2 kWh. Converting to joules: Energy = 2.2 × 3.6 × 10⁶ J = 7.92 × 10⁶ J. Therefore, the motor has a power of 1.1 kW and consumes 2.2 kWh or 7.92 × 10⁶ J of energy in 2 hours."
            },
            {
                "question": "A piece of wire of resistance R is cut into five equal parts. These parts are then connected in parallel. If the equivalent resistance of this combination is R′, then the ratio R/R′ is – (a) 1/25 (b) 1/5 (c) 5 (d) 25",
                "answer": "When a wire of resistance R is cut into 5 equal parts, each part has resistance R/5. When these 5 parts are connected in parallel: 1/R′ = 1/(R/5) + 1/(R/5) + 1/(R/5) + 1/(R/5) + 1/(R/5) = 5/(R/5) = 25/R. Therefore, R′ = R/25. The ratio R/R′ = R/(R/25) = 25. The answer is (d) 25."
            },
            {
                "question": "Which of the following terms does not represent electrical power in a circuit? (a) I²R (b) IR² (c) VI (d) V²/R",
                "answer": "The correct answer is (b) IR². The expressions for electrical power are: P = VI (basic definition), P = I²R (using Ohm's law V = IR), and P = V²/R (using Ohm's law I = V/R). The term IR² has units of ampere × ohm² = volt × ohm, which does not equal watts (the unit of power). Therefore, IR² does not represent electrical power."
            },
            {
                "question": "An electric bulb is rated 220 V and 100 W. When it is operated on 110 V, the power consumed will be – (a) 100 W (b) 75 W (c) 50 W (d) 25 W",
                "answer": "First, find the resistance of the bulb: R = V²/P = (220)²/100 = 484 Ω. When operated at 110 V, the power consumed is: P = V²/R = (110)²/484 = 12100/484 = 25 W. The answer is (d) 25 W. Note that when voltage is halved, power becomes one-fourth of the original value."
            },
            {
                "question": "Two conducting wires of the same material and of equal lengths and equal diameters are first connected in series and then parallel in a circuit across the same potential difference. The ratio of heat produced in series and parallel combinations would be – (a) 1:2 (b) 2:1 (c) 1:4 (d) 4:1",
                "answer": "Let each wire have resistance R. In series: Total resistance = R + R = 2R, Current I₁ = V/(2R), Heat H₁ = I₁²(2R)t = [V/(2R)]²(2R)t = V²t/(2R). In parallel: Total resistance = R/2, Current I₂ = V/(R/2) = 2V/R, Heat H₂ = I₂²(R/2)t = [2V/R]²(R/2)t = 2V²t/R. Ratio H₁:H₂ = [V²t/(2R)] : [2V²t/R] = 1:4. The answer is (c) 1:4."
            },
            {
                "question": "How is a voltmeter connected in the circuit to measure the potential difference between two points?",
                "answer": "A voltmeter is always connected in parallel across the two points between which the potential difference is to be measured. This parallel connection ensures that: (1) The voltmeter measures the same potential difference as exists between those two points, (2) The voltmeter has very high resistance, so it draws minimal current and doesn't significantly affect the circuit, (3) The current through the main circuit remains essentially unchanged, (4) The voltmeter can measure the voltage across any component or combination of components in the circuit."
            },
            {
                "question": "A copper wire has diameter 0.5 mm and resistivity of 1.6 × 10⁻⁸ Ω m. What will be the length of this wire to make its resistance 10 Ω? How much does the resistance change if the diameter is doubled?",
                "answer": "Given: d = 0.5 mm = 0.5 × 10⁻³ m, ρ = 1.6 × 10⁻⁸ Ω m, R = 10 Ω. Area A = πd²/4 = π(0.5 × 10⁻³)²/4 = 1.96 × 10⁻⁷ m². Using R = ρl/A: l = RA/ρ = (10 × 1.96 × 10⁻⁷)/(1.6 × 10⁻⁸) = 122.5 m. When diameter is doubled (d' = 1.0 mm), new area A' = π(1.0 × 10⁻³)²/4 = 7.85 × 10⁻⁷ m². New resistance R' = ρl/A' = (1.6 × 10⁻⁸ × 122.5)/(7.85 × 10⁻⁷) = 2.5 Ω. The resistance decreases from 10 Ω to 2.5 Ω (becomes one-fourth)."
            },
            {
                "question": "The values of current I flowing in a given resistor for the corresponding values of potential difference V across the resistor are given below – Plot a graph between V and I and calculate the resistance of that resistor.",
                "answer": "From the given data, plotting V (y-axis) vs I (x-axis) will give a straight line passing through the origin, confirming Ohm's law. To calculate resistance, use any data point: R = V/I. Using the first point: R = 1.6 V / 0.5 A = 3.2 Ω. Checking with other points: R = 3.4/1.0 = 3.4 Ω, R = 6.7/2.0 = 3.35 Ω, R = 10.2/3.0 = 3.4 Ω, R = 13.2/4.0 = 3.3 Ω. The average resistance is approximately 3.3 Ω. The slight variations are due to experimental errors."
            },
            {
                "question": "When a 12 V battery is connected across an unknown resistor, there is a current of 2.5 mA in the circuit. Find the value of the resistance of the resistor.",
                "answer": "Given: Voltage V = 12 V, Current I = 2.5 mA = 2.5 × 10⁻³ A. Using Ohm's law: R = V/I = 12 V / (2.5 × 10⁻³ A) = 12 / 0.0025 = 4800 Ω = 4.8 kΩ. Therefore, the resistance of the unknown resistor is 4800 Ω or 4.8 kΩ."
            },
            {
                "question": "A battery of 9 V is connected in series with resistors of 0.2 Ω, 0.3 Ω, 0.4 Ω, 0.5 Ω and 12 Ω, respectively. How much current would flow through the 12 Ω resistor?",
                "answer": "In a series circuit, the current is the same through all components. Total resistance = 0.2 + 0.3 + 0.4 + 0.5 + 12 = 13.4 Ω. Using Ohm's law: I = V/R = 9 V / 13.4 Ω = 0.67 A. Therefore, the current flowing through the 12 Ω resistor (and all other resistors) is 0.67 A."
            },
            {
                "question": "How many 176 Ω resistors (in parallel) are required to carry 5 A on a 220 V line?",
                "answer": "Given: V = 220 V, Total current I = 5 A, Each resistor R = 176 Ω. Total resistance needed: R_total = V/I = 220/5 = 44 Ω. For n resistors of 176 Ω each in parallel: 1/R_total = n/176, so 1/44 = n/176. Therefore: n = 176/44 = 4. We need 4 resistors of 176 Ω each connected in parallel. Verification: Current through each resistor = 220/176 = 1.25 A. Total current = 4 × 1.25 = 5 A ✓"
            },
            {
                "question": "Show how you would connect three resistors, each of resistance 6 Ω, so that the combination has a resistance of (i) 9 Ω, (ii) 4 Ω.",
                "answer": "(i) To get 9 Ω: Connect two 6 Ω resistors in parallel first: 1/R = 1/6 + 1/6 = 2/6 = 1/3, so R = 3 Ω. Then connect this 3 Ω combination in series with the third 6 Ω resistor: Total = 3 + 6 = 9 Ω. (ii) To get 4 Ω: Connect two 6 Ω resistors in series first: R = 6 + 6 = 12 Ω. Then connect this 12 Ω combination in parallel with the third 6 Ω resistor: 1/R = 1/12 + 1/6 = 1/12 + 2/12 = 3/12 = 1/4, so R = 4 Ω."
            },
            {
                "question": "Several electric bulbs designed to be used on a 220 V electric supply line, are rated 10 W. How many lamps can be connected in parallel with each other across the two wires of 220 V line if the maximum allowable current is 5 A?",
                "answer": "Given: Each bulb: 10 W at 220 V, Maximum current = 5 A. Current through each bulb: I = P/V = 10 W / 220 V = 0.045 A. Maximum number of bulbs = Maximum total current / Current per bulb = 5 A / 0.045 A = 111.11. Since we can't have a fraction of a bulb, the maximum number of lamps that can be connected is 111. Verification: Total current = 111 × 0.045 = 4.995 A < 5 A ✓"
            },
            {
                "question": "A hot plate of an electric oven connected to a 220 V line has two resistance coils A and B, each of 24 Ω resistance, which may be used separately, in series, or in parallel. What are the currents in the three cases?",
                "answer": "Given: V = 220 V, Each coil R = 24 Ω. Case 1 - Using coil A or B separately: I = V/R = 220/24 = 9.17 A. Case 2 - Coils in series: Total resistance = 24 + 24 = 48 Ω, I = 220/48 = 4.58 A. Case 3 - Coils in parallel: 1/R = 1/24 + 1/24 = 2/24 = 1/12, so R = 12 Ω, I = 220/12 = 18.33 A. Therefore, the currents are: separately 9.17 A, in series 4.58 A, in parallel 18.33 A."
            },
            {
                "question": "Compare the power used in the 2 Ω resistor in each of the following circuits: (i) a 6 V battery in series with 1 Ω and 2 Ω resistors, and (ii) a 4 V battery in parallel with 12 Ω and 2 Ω resistors.",
                "answer": "(i) Series circuit: Total resistance = 1 + 2 = 3 Ω, Current I = 6/3 = 2 A. Power in 2 Ω resistor: P₁ = I²R = 2² × 2 = 8 W. (ii) Parallel circuit: In parallel, voltage across 2 Ω resistor = 4 V. Power in 2 Ω resistor: P₂ = V²/R = 4²/2 = 8 W. Interestingly, the power used in the 2 Ω resistor is the same (8 W) in both circuits, though the circuit configurations and total power consumption are different."
            },
            {
                "question": "Two lamps, one rated 100 W at 220 V, and the other 60 W at 220 V, are connected in parallel to electric mains supply. What current is drawn from the line if the supply voltage is 220 V?",
                "answer": "Given: Lamp 1: 100 W at 220 V, Lamp 2: 60 W at 220 V, Supply voltage = 220 V. Current through lamp 1: I₁ = P₁/V = 100/220 = 0.45 A. Current through lamp 2: I₂ = P₂/V = 60/220 = 0.27 A. In parallel connection, total current = I₁ + I₂ = 0.45 + 0.27 = 0.72 A. Therefore, the current drawn from the line is 0.72 A."
            },
            {
                "question": "Which uses more energy, a 250 W TV set in 1 hr, or a 1200 W toaster in 10 minutes?",
                "answer": "TV set: Energy = Power × Time = 250 W × 1 hr = 250 Wh. Toaster: Energy = Power × Time = 1200 W × (10/60) hr = 1200 W × 0.167 hr = 200 Wh. Comparing: TV set uses 250 Wh while toaster uses 200 Wh. Therefore, the 250 W TV set in 1 hour uses more energy than the 1200 W toaster in 10 minutes."
            },
            {
                "question": "An electric heater of resistance 44 Ω draws 5 A from the service mains for 2 hours. Calculate the rate at which heat is developed in the heater.",
                "answer": "Given: Resistance R = 44 Ω, Current I = 5 A, Time t = 2 hours. The rate at which heat is developed is the power. Power P = I²R = (5)² × 44 = 25 × 44 = 1100 W = 1.1 kW. Therefore, heat is developed at a rate of 1100 W or 1.1 kW. Note: The time given (2 hours) is not needed to calculate the rate - it would be needed to calculate the total energy consumed."
            },
            {
                "question": "Explain the following: (a) Why is tungsten used almost exclusively for filament of electric lamps? (b) Why are the conductors of electric heating devices, such as bread-toasters and electric irons, made of an alloy rather than a pure metal? (c) Why is the series arrangement not used for domestic circuits? (d) How does the resistance of a wire vary with its area of cross-section? (e) Why are copper and aluminium wires usually employed for electricity transmission?",
                "answer": "(a) Tungsten is used for lamp filaments because: it has a very high melting point (3380°C), allowing it to glow white-hot without melting; it has high resistivity to produce sufficient heat; and it doesn't oxidize readily at high temperatures. (b) Alloys are used in heating devices because: they have higher resistivity than pure metals, generating more heat; they don't oxidize at high temperatures; they maintain stable resistance at elevated temperatures; and they have good mechanical strength. (c) Series arrangement isn't used domestically because: all appliances would get different voltages; if one device fails, all stop working; appliances can't be controlled independently; and different appliances need different currents to operate properly. (d) Resistance varies inversely with cross-sectional area (R ∝ 1/A) - larger area means lower resistance because more space allows easier current flow. (e) Copper and aluminum are used for transmission because: they have very low resistivity (good conductors); they minimize power losses during transmission; copper has excellent conductivity and aluminum is lightweight and cost-effective for long-distance lines."
            }
        ],
        "summary": {
            "title": "Electricity - Electric Current and its Effects",
            "key_concepts": [
                "Electric current as the flow of charge and Ohm's law relating voltage, current, and resistance",
                "Factors affecting resistance: length, cross-sectional area, and material properties (resistivity)",
                "Series and parallel combinations of resistors and their equivalent resistances",
                "Electric power and the heating effect of current with practical applications",
                "Electrical energy consumption and its measurement in kilowatt-hours"
            ],
            "summary": "This chapter introduces the fundamental concepts of electricity, starting with electric current as the flow of electric charges through conductors. It establishes Ohm's law as the relationship between voltage, current, and resistance, and explores how resistance depends on the physical properties of conductors. The chapter covers series and parallel combinations of resistors, showing how to calculate equivalent resistances and currents in different circuit configurations. It concludes with the heating effect of electric current, explaining Joule's law and its applications in everyday electrical devices, along with concepts of electric power and energy consumption measurement."
        }
    },
    "statistics": {
        "total_images": 19,
        "text_length": 48008,
        "processing_time": 19.87
    },
    "claude_processing": {
        "processed_at": "2025-07-19 12:11:25",
        "model_used": "claude-sonnet-4-20250514",
        "tasks_completed": [
            "exercises",
            "answers",
            "summary",
            "image_descriptions"
        ],
        "exercises_count": 36,
        "images_processed": 19
    }
}