{
    "id": "bcdd34bd-9d7d-4872-9b38-c40fe27ff7ac",
    "title": "Acids, Bases and Salts",
    "source_file": "/home/content/books/science/jesc102.pdf",
    "filename": "jesc102.pdf",
    "subject": "science",
    "conversion_timestamp": "2025-07-18T12:07:14.073160",
    "processing_time_seconds": 20.6,
    "metadata": "md",
    "content": {
        "markdown_text": "![](_page_0_Picture_0.jpeg)\n\n![](_page_0_Picture_1.jpeg)\n\nY ou have learnt in your previous classes that the sour and bitter tastes of food are due to acids and bases, respectively, present in them. If someone in the family is suffering from a problem of acidity after overeating, which of the following would you suggest as a remedy– lemon juice, vinegar or baking soda solution?\n\n- n Which property did you think of while choosing the remedy? Surely you must have used your knowledge about the ability of acids and bases to nullify each other's effect.\n- n Recall how we tested sour and bitter substances without tasting them.\n\nYou already know that acids are sour in taste and change the colour of blue litmus to red, whereas, bases are bitter and change the colour of the red litmus to blue. Litmus is a natural indicator, turmeric is another such indicator. Have you noticed that a stain of curry on a white cloth becomes reddish-brown when soap, which is basic in nature, is scrubbed on it? It turns yellow again when the cloth is washed with plenty of water. You can also use synthetic indicators such as methyl orange and phenolphthalein to test for acids and bases.\n\nIn this Chapter, we will study the reactions of acids and bases, how acids and bases cancel out each other's effects and many more interesting things that we use and see in our day-to-day life.\n\nLitmus solution is a purple dye, which is extracted from lichen, a plant belonging to the division Thallophyta, and is commonly used as an indicator. When the litmus solution is neither acidic nor basic, its colour is purple. There are many other natural materials like red cabbage leaves, turmeric, coloured petals of some flowers such as *Hydrangea*, *Petunia* and *Geranium*, which indicate the presence of acid or base in a solution. These are called acid-base indicators or sometimes simply indicators.\n\n# QUESTION\n\n1. You have been provided with three test tubes. One of them contains distilled water and the other two contain an acidic solution and a basic solution, respectively. If you are given only red litmus paper, how will you identify the contents of each test tube?\n\n# 2.1 UNDERSTANDING THE CHEMICAL PROPERTIES OF ACIDS AND BASES\n\n2.1.1 Acids and Bases in the Laboratory\n\n# Activity 2.1\n\n- n Collect the following solutions from the science laboratory– hydrochloric acid (HCl), sulphuric acid (H2SO<sup>4</sup> ), nitric acid (HNO<sup>3</sup> ), acetic acid (CH3COOH), sodium hydroxide (NaOH), calcium hydroxide [Ca(OH)<sup>2</sup> ], potassium hydroxide (KOH), magnesium hydroxide [Mg(OH)<sup>2</sup> ], and ammonium hydroxide (NH4OH).\n- n Put a drop of each of the above solutions on a watch-glass one by one and test with a drop of the indicators shown in Table 2.1.\n- n What change in colour did you observe with red litmus, blue litmus, phenolphthalein and methyl orange solutions for each of the solutions taken?\n- n Tabulate your observations in Table 2.1.\n\n### Table 2.1\n\n![](_page_1_Figure_10.jpeg)\n\nThese indicators tell us whether a substance is acidic or basic by change in colour. There are some substances whose odour changes in acidic or basic media. These are called olfactory indicators. Let us try out some of these indicators.\n\n# Activity 2.2\n\n- n Take some finely chopped onions in a plastic bag along with some strips of clean cloth. Tie up the bag tightly and leave overnight in the fridge. The cloth strips can now be used to test for acids and bases.\n- n Take two of these cloth strips and check their odour.\n- n Keep them on a clean surface and put a few drops of dilute HCl solution on one strip and a few drops of dilute NaOH solution on the other.\n\n- n Rinse both cloth strips with water and again check their odour.\n- n Note your observations.\n- n Now take some dilute vanilla essence and clove oil and check their odour.\n- n Take some dilute HCl solution in one test tube and dilute NaOH solution in another. Add a few drops of dilute vanilla essence to both test tubes and shake well. Check the odour once again and record changes in odour, if any.\n- n Similarly, test the change in the odour of clove oil with dilute HCl and dilute NaOH solutions and record your observations.\n\nWhich of these – vanilla, onion and clove, can be used as olfactory indicators on the basis of your observations?\n\nLet us do some more activities to understand the chemical properties of acids and bases.\n\n## 2.1.2 How do Acids and Bases React with Metals?\n\n# Activity 2.3\n\nCAUTION: This activity needs the teacher's assistance.\n\n- n Set the apparatus as shown in Fig. 2.1.\n- n Take about 5 mL of dilute sulphuric acid in a test tube and add a few pieces of zinc granules to it.\n- n What do you observe on the surface of zinc granules?\n- n Pass the gas being evolved through the soap solution.\n- n Why are bubbles formed in the soap solution?\n- n Take a burning candle near a gas filled bubble.\n- n What do you observe?\n- <sup>n</sup> Repeat this Activity with some more acids like HCl, HNO<sup>3</sup> and CH3COOH.\n- n Are the observations in all the cases the same or different?\n\n![](_page_2_Figure_19.jpeg)\n\n*Figure 2.1 Reaction of zinc granules with dilute sulphuric acid and testing hydrogen gas by burning*\n\nNote that the metal in the above reactions displaces hydrogen atoms from the acids as hydrogen gas and forms a compound called a salt. Thus, the reaction of a metal with an acid can be summarised as –\n\nAcid + Metal → Salt + Hydrogen gas\n\nCan you now write the equations for the reactions you have observed?\n\n# Activity 2.4\n\n- n Place a few pieces of granulated zinc metal in a test tube.\n- n Add 2 mL of sodium hydroxide solution and warm the contents of the test tube.\n- n Repeat the rest of the steps as in Activity 2.3 and record your observations.\n\nThe reaction that takes place can be written as follows.\n\n2NaOH(aq) + Zn(s) → Na2ZnO<sup>2</sup> (s) + H<sup>2</sup> (g) (Sodium zincate)\n\nYou find again that hydrogen is formed in the reaction. However, such reactions are not possible with all metals.\n\n2.1.3 How do Metal Carbonates and Metal Hydrogencarbonates React with Acids?\n\n![](_page_3_Figure_11.jpeg)\n\n#### *Figure 2.2*\n\n*Passing carbon dioxide gas through calcium hydroxide solution*\n\n# Activity 2.5\n\n- n Take two test tubes, label them as A and B.\n- n Take about 0.5 g of sodium carbonate (Na2CO<sup>3</sup> ) in test tube A and about 0.5 g of sodium hydrogencarbonate (NaHCO<sup>3</sup> ) in test tube B.\n- n Add about 2 mL of dilute HCl to both the test tubes.\n- n What do you observe?\n- n Pass the gas produced in each case through lime water (calcium hydroxide solution) as shown in Fig. 2.2 and record your observations.\n\nThe reactions occurring in the above Activity are written as –\n\nTest tube A: Na CO HCl(aq) Cl(aq) H O(l) + CO 2 3 <sup>2</sup> <sup>2</sup> (s) + 2 → 2Na + (g) Test tube B: NaHCO HCl(aq) Cl(aq) H O(l) + CO <sup>3</sup> 2 2 (s) Na + → + (g)\n\nOn passing the carbon dioxide gas evolved through lime water,\n\nCa(OH) CO H O(l) <sup>2</sup> <sup>2</sup> <sup>2</sup> (aq) (g) CaCO s + → <sup>3</sup> ( ) + (Lime water) (White precipitate)\n\nOn passing excess carbon dioxide the following reaction takes place:\n\nCaCO s <sup>3</sup> Ca(HCO aq <sup>3</sup> ( )+ H O(l)+ CO (g) → ) ( ) <sup>2</sup> <sup>2</sup> <sup>2</sup> (Soluble in water)\n\nLimestone, chalk and marble are different forms of calcium carbonate. All metal carbonates and hydrogencarbonates react with acids to give a corresponding salt, carbon dioxide and water.\n\nThus, the reaction can be summarised as –\n\nMetal carbonate/Metal hydrogencarbonate + Acid → Salt + Carbon dioxide + Water\n\n## 2.1.4 How do Acids and Bases React with each other?\n\nActivity 2.6\n\n- n Take about 2 mL of dilute NaOH solution in a test tube and add two drops of phenolphthalein solution.\n- n What is the colour of the solution?\n- n Add dilute HCl solution to the above solution drop by drop.\n- n Is there any colour change for the reaction mixture?\n- n Why did the colour of phenolphthalein change after the addition of an acid?\n- n Now add a few drops of NaOH to the above mixture.\n- n Does the pink colour of phenolphthalein reappear?\n- n Why do you think this has happened?\n\nIn the above Activity, we have observed that the effect of a base is nullified by an acid and vice-versa. The reaction taking place is written as –\n\nNaOH(aq) + HCl(aq) → NaCl(aq) + H2O(l)\n\nThe reaction between an acid and a base to give a salt and water is known as a neutralisation reaction. In general, a neutralisation reaction can be written as –\n\nBase + Acid → Salt + Water\n\n### 2.1.5 Reaction of Metallic Oxides with Acids\n\n## Activity 2.7\n\n- n Take a small amount of copper oxide in a beaker and add dilute hydrochloric acid slowly while stirring.\n- n Note the colour of the solution. What has happened to the copper oxide?\n\nYou will notice that the colour of the solution becomes blue-green and the copper oxide dissolves. The blue-green colour of the solution is due to the formation of copper(II) chloride in the reaction. The general reaction between a metal oxide and an acid can be written as –\n\nMetal oxide + Acid → Salt + Water\n\nNow write and balance the equation for the above reaction. Since metallic oxides react with acids to give salts and water, similar to the reaction of a base with an acid, metallic oxides are said to be basic oxides.\n\n## 2.1.6 Reaction of a Non-metallic Oxide with Base\n\nYou saw the reaction between carbon dioxide and calcium hydroxide (lime water) in Activity 2.5. Calcium hydroxide, which is a base, reacts with carbon dioxide to produce a salt and water. Since this is similar to the reaction between a base and an acid, we can conclude that nonmetallic oxides are acidic in nature.\n\n# QUESTIONS\n\n- 1. Why should curd and sour substances not be kept in brass and copper vessels?\n- 2. Which gas is usually liberated when an acid reacts with a metal? Illustrate with an example. How will you test for the presence of this gas?\n- 3. Metal compound A reacts with dilute hydrochloric acid to produce effervescence. The gas evolved extinguishes a burning candle. Write a balanced chemical equation for the reaction if one of the compounds formed is calcium chloride.\n\n# 2.2 WHAT DO ALL ACIDS AND ALL BASES HAVE IN COMMON?\n\nIn Section 2.1 we have seen that all acids have similar chemical properties. What leads to this similarity in properties? We saw in Activity 2.3 that all acids generate hydrogen gas on reacting with metals, so hydrogen seems to be common to all acids. Let us perform an Activity to investigate whether all compounds containing hydrogen are acidic.\n\n![](_page_5_Figure_9.jpeg)\n\n*Figure 2.3 Acid solution in water conducts electricity*\n\n# Activity 2.8\n\n- n Take solutions of glucose, alcohol, hydrochloric acid, sulphuric acid, etc.\n- n Fix two nails on a cork, and place the cork in a 100 mL beaker.\n- n Connect the nails to the two terminals of a 6 volt battery through a bulb and a switch, as shown in Fig. 2.3.\n- n Now pour some dilute HCl in the beaker and switch on the current.\n- n Repeat with dilute sulphuric acid.\n- n What do you observe?\n- n Repeat the experiment separately with glucose and alcohol solutions. What do you observe now?\n- n Does the bulb glow in all cases?\n\nThe bulb will start glowing in the case of acids, as shown in Fig. 2.3. But you will observe that glucose and alcohol solutions do not conduct electricity. Glowing of the bulb indicates that there is a flow of electric current through the solution. The electric current is carried through the acidic solution by ions.\n\nAcids contain H<sup>+</sup> ion as cation and anion such as Cl– in HCl, NO<sup>3</sup> – in HNO<sup>3</sup> , SO2– 4 in H<sup>2</sup> SO<sup>4</sup> , CH3COO– in CH3COOH. Since the cation present in acids is H<sup>+</sup> , this suggests that acids produce hydrogen ions, H<sup>+</sup> (aq), in solution, which are responsible for their acidic properties.\n\nRepeat the same Activity using alkalis such as sodium hydroxide, calcium hydroxide, etc. What can you conclude from the results of this Activity?\n\n### 2.2.1 What Happens to an Acid or a Base in a Water Solution?\n\nDo acids produce ions only in aqueous solution? Let us test this.\n\n# Activity 2.9\n\n- n Take about 1g solid NaCl in a clean and dry test tube and set up the apparatus as shown in Fig. 2.4.\n- n Add some concentrated sulphuric acid to the test tube.\n- n What do you observe? Is there a gas coming out of the delivery tube?\n- n Test the gas evolved successively with dry and wet blue litmus paper.\n- n In which case does the litmus paper change colour?\n- n On the basis of the above Activity, what do you infer about the acidic character of:\n  - (i) dry HCl gas\n\n![](_page_6_Figure_13.jpeg)\n\n(ii) HCl solution? *Figure 2.4 Preparation of* HCl *gas*\n\nNote to teachers: If the climate is very humid, you will have to pass the gas produced through a guard tube (drying tube) containing calcium chloride to dry the gas.\n\nThis experiment suggests that hydrogen ions in HCl are produced in the presence of water. The separation of H<sup>+</sup> ion from HCl molecules cannot occur in the absence of water.\n\nHCl + H2O → H3O<sup>+</sup> + Cl–\n\nHydrogen ions cannot exist alone, but they exist after combining with water molecules. Thus hydrogen ions must always be shown as H<sup>+</sup> (aq) or hydronium ion (H3O<sup>+</sup> ).\n\n#### H<sup>+</sup> + H2O → H3O<sup>+</sup>\n\nWe have seen that acids give H3O<sup>+</sup> or H<sup>+</sup> (aq) ion in water. Let us see what happens when a base is dissolved in water.\n\nNaOH(s) → H O<sup>2</sup> Na<sup>+</sup>(aq) + OH– (aq) KOH(s) K (aq)+OH (aq) → H O<sup>2</sup> <sup>+</sup> –\n\n#### Mg(OH)<sup>2</sup> (s) → H O<sup>2</sup> Mg2+(aq)+2OH– (aq)\n\nBases generate hydroxide (OH– ) ions in water. Bases which are soluble in water are called alkalis.\n\nAll bases do not dissolve in water. An alkali is a base that dissolves in water. They are soapy to touch, bitter and corrosive. Never taste or touch them as they may cause harm. Which of the bases in the Table 2.1 are alkalis?\n\n> Now as we have identified that all acids generate H<sup>+</sup> (aq) and all bases generate OH– (aq), we can view the neutralisation reaction as follows –\n\nAcid + Base → Salt + Water\n\nH X + M OH → MX + HOH\n\nH<sup>+</sup> (aq) + OH – (aq) → H2O(l)\n\nLet us see what is involved when water is mixed with an acid or a base.\n\n![](_page_7_Picture_10.jpeg)\n\nDo You Know?\n\n*Warning sign displayed on containers containing concentrated acids and*\n\n# Activity 2.10\n\n- n Take 10 mL water in a beaker.\n- <sup>n</sup> Add a few drops of concentrated H2SO<sup>4</sup> to it and swirl the beaker slowly.\n- n Touch the base of the beaker.\n- n Is there a change in temperature?\n- n Is this an exothermic or endothermic process?\n- n Repeat the above Activity with sodium hydroxide pellets and record your observations. *Figure 2.5*\n\n*bases* The process of dissolving an acid or a base in water is a highly exothermic one. Care must be taken while mixing concentrated nitric acid or sulphuric acid with water. The acid must always be added slowly to water with constant stirring. If water is added to a concentrated acid, the heat generated may cause the mixture to splash out and cause burns. The glass container may also break due to excessive local heating. Look out for the warning sign (shown in Fig. 2.5) on the can of concentrated sulphuric acid and on the bottle of sodium hydroxide pellets.\n\n> Mixing an acid or base with water results in decrease in the concentration of ions (H3O<sup>+</sup>/OH– ) per unit volume. Such a process is called dilution and the acid or the base is said to be diluted.\n\n# QUESTIONS\n\n- 1. Why do HCl, HNO<sup>3</sup> , etc., show acidic characters in aqueous solutions while solutions of compounds like alcohol and glucose do not show acidic character?\n- 2. Why does an aqueous solution of an acid conduct electricity?\n- 3. Why does dry HCl gas not change the colour of the dry litmus paper?\n- 4. While diluting an acid, why is it recommended that the acid should be added to water and not water to the acid?\n- 5. How is the concentration of hydronium ions (H3O<sup>+</sup> ) affected when a solution of an acid is diluted?\n- 6. How is the concentration of hydroxide ions (OH – ) affected when excess base is dissolved in a solution of sodium hydroxide?\n\n# 2.3 HOW STRONG ARE ACID OR BASE SOLUTIONS?\n\nWe know how acid-base indicators can be used to distinguish between an acid and a base. We have also learnt in the previous section about dilution and decrease in concentration of H<sup>+</sup> or OH– ions in solutions. Can we quantitatively find the amount of these ions present in a solution? Can we judge how strong a given acid or base is?\n\nWe can do this by making use of a universal indicator, which is a mixture of several indicators. The universal indicator shows different colours at different concentrations of hydrogen ions in a solution.\n\nA scale for measuring hydrogen ion concentration in a solution, called pH scale has been developed. The p in pH stands for '*potenz*' in German, meaning power. On the pH scale we can measure pH generally from 0 (very acidic) to 14 (very alkaline). pH should be thought of simply as a number which indicates the acidic or basic nature of a solution. Higher the hydronium ion concentration, lower is the pH value.\n\nThe pH of a neutral solution is 7. Values less than 7 on the pH scale represent an acidic solution. As the pH value increases from 7 to 14, it represents an increase in OH– ion concentration in the solution, that is, increase in the strength of alkali (Fig. 2.6). Generally paper impregnated with the universal indicator is used for measuring pH.\n\n![](_page_8_Figure_12.jpeg)\n\n![](_page_8_Figure_13.jpeg)\n\n![](_page_9_Figure_0.jpeg)\n\n*Figure 2.7* pH *of some common substances shown on a* pH *paper (colours are only a rough guide)*\n\nThe strength of acids and bases depends on the number of H<sup>+</sup> ions and OH– ions produced, respectively. If we take hydrochloric acid and acetic acid of the same concentration, say one molar, then these produce different amounts of hydrogen ions. Acids that give rise to more H<sup>+</sup> ions are said to be strong acids, and acids that give less H<sup>+</sup> ions are said to be weak acids. Can you now say what weak and strong bases are?\n\n# 2.3.1 Importance of pH in Everyday Life yday Lifeyday\n\n#### Are plants and animals pH sensitive?\n\nOur body works within the pH range of 7.0 to 7.8. Living organisms can survive only in a narrow range of pH change. When pH of rain water is less than 5.6, it is called acid rain. When acid rain flows into the rivers, it lowers the pH of the river water. The survival of aquatic life in such rivers becomes difficult.\n\n# Acids in other planets The atmosphere of venus is made up of thick white and yellowish clouds of sulphuric acid. Do you think life can exist on this planet?\n\n## What is the pH of the soil in your backyard?\n\nPlants require a specific pH range for their healthy growth. To find out the pH required for the healthy growth of a plant, you can collect the soil from various places and check the pH in the manner described below in Activity 2.12. Also, you can note down which plants are growing in the region from which you have collected the soil.\n\n# Activity 2.12\n\n- n Put about 2 g soil in a test tube and add 5 mL water to it.\n- n Shake the contents of the test tube.\n- n Filter the contents and collect the filtrate in a test tube.\n- n Check the pH of this filtrate with the help of universal indicator paper.\n- n What can you conclude about the ideal soil pH for the growth of plants in your region?\n\n#### pH in our digestive system\n\nIt is very interesting to note that our stomach produces hydrochloric acid. It helps in the digestion of food without harming the stomach. During indigestion the stomach produces too much acid and this causes pain and irritation. To get rid of this pain, people use bases called antacids. One such remedy must have been suggested by you at the beginning of this Chapter. These antacids neutralise the excess acid. Magnesium hydroxide (Milk of magnesia), a mild base, is often used for this purpose.\n\n#### pH change as the cause of tooth decay\n\nTooth decay starts when the pH of the mouth is lower than 5.5. Tooth enamel, made up of calcium hydroxyapatite (a crystalline form of calcium phosphate) is the hardest substance in the body. It does not dissolve in water, but is corroded when the pH in the mouth is below 5.5. Bacteria present in the mouth produce acids by degradation of sugar and food particles remaining in the mouth after eating. The best way to prevent this is to clean the mouth after eating food. Using toothpastes, which are generally basic, for cleaning the teeth can neutralise the excess acid and prevent tooth decay. methanoic acid causing burning pain. Do You Know?\n\n#### Self defence by animals and plants through chemical warfare\n\nHave you ever been stung by a honey-bee? Bee-sting leaves an acid which causes pain and irritation. Use of a mild base like baking soda on the stung area gives relief. Stinging hair of nettle leaves inject\n\n### Nature provides neutralisation options\n\nNettle is a herbaceous plant which grows in the wild. Its leaves have stinging hair, which cause painful stings when touched accidentally. This is due to the methanoic\n\nDo You Know?\n\nacid secreted by them. A traditional remedy is rubbing the area with the leaf of the dock plant, which often grows beside the nettle in the wild. Can you guess the nature of the dock plant? So next time you know what to look out for if you accidentally touch a nettle plant while trekking. Are you aware of any other effective traditional remedies for such stings?\n\n### Table 2.3 Some naturally occurring acids\n\n| Natural source | Acid          | Natural source   | Acid           |\n|----------------|---------------|------------------|----------------|\n| Vinegar        | Acetic acid   | Sour milk (Curd) | Lactic acid    |\n| Orange         | Citric acid   | Lemon            | Citric acid    |\n| Tamarind       | Tartaric acid | Ant sting        | Methanoic acid |\n| Tomato         | Oxalic acid   | Nettle sting     | Methanoic acid |\n\n# QUESTIONS\n\n- 1. You have two solutions, A and B. The pH of solution A is 6 and pH of solution B is 8. Which solution has more hydrogen ion concentration? Which of this is acidic and which one is basic?\n- 2. What effect does the concentration of H<sup>+</sup> (aq) ions have on the nature of the solution?\n- 3. Do basic solutions also have H<sup>+</sup> (aq) ions? If yes, then why are these basic?\n- 4. Under what soil condition do you think a farmer would treat the soil of his fields with quick lime (calcium oxide) or slaked lime (calcium hydroxide) or chalk (calcium carbonate)?\n\n# 2.4 MORE ABOUT SALTS\n\nIn the previous sections we have seen the formation of salts during various reactions. Let us understand more about their preparation, properties and uses.\n\n2.4.1 Family of Salts\n\n### Activity 2.13\n\nn Write the chemical formulae of the salts given below. Potassium sulphate, sodium sulphate, calcium sulphate, magnesium sulphate, copper sulphate, sodium chloride, sodium nitrate, sodium carbonate and ammonium chloride.\n\n- n Identify the acids and bases from which the above salts may be obtained.\n- n Salts having the same positive or negative radicals are said to belong to a family. For example, NaCl and Na2SO<sup>4</sup> belong to the family of sodium salts. Similarly, NaCl and KCl belong to the family of chloride salts. How many families can you identify among the salts given in this Activity?\n\n### 2.4.2 pH of Salts\n\n# Activity 2.14\n\n- n Collect the following salt samples sodium chloride, potassium nitrate, aluminium chloride, zinc sulphate, copper sulphate, sodium acetate, sodium carbonate and sodium hydrogencarbonate (some other salts available can also be taken).\n- n Check their solubility in water (use distilled water only).\n- n Check the action of these solutions on litmus and find the pH using a pH paper.\n- n Which of the salts are acidic, basic or neutral?\n- n Identify the acid or base used to form the salt.\n- n Report your observations in Table 2.4.\n\nSalts of a strong acid and a strong base are neutral with pH value of 7. On the other hand, salts of a strong acid and weak base are acidic with pH value less than 7 and those of a strong base and weak acid are basic in nature, with pH value more than 7.\n\n# 2.4.3 Chemicals from Common Salt\n\nBy now you have learnt that the salt formed by the combination of hydrochloric acid and sodium hydroxide solution is called sodium chloride. This is the salt that you use in food. You must have observed in the above Activity that it is a neutral salt.\n\nSeawater contains many salts dissolved in it. Sodium chloride is separated from these salts. Deposits of solid salt are also found in several parts of the world. These large crystals are often brown due to impurities. This is called rock salt. Beds of rock salt were formed when seas of bygone ages dried up. Rock salt is mined like coal.\n\n![](_page_12_Picture_14.jpeg)\n\nYou must have heard about Mahatma Gandhi's *Dandi March*. Did you know that sodium chloride was such an important symbol in our struggle for freedom?\n\n| Table 2.4 |    |           |           |  |  |\n|-----------|----|-----------|-----------|--|--|\n| Salt      | pH | Acid used | Base used |  |  |\n|           |    |           |           |  |  |\n\n#### **Common salt — A raw material for chemicals**\n\nThe common salt thus obtained is an important raw material for various materials of daily use, such as sodium hydroxide, baking soda, washing soda, bleaching powder and many more. Let us see how one substance is used for making all these different substances.\n\n#### **Sodium hydroxide**\n\nWhen electricity is passed through an aqueous solution of sodium chloride (called brine), it decomposes to form sodium hydroxide. The process is called the chlor-alkali process because of the products formed– chlor for chlorine and alkali for sodium hydroxide.\n\n#### 2NaCl(aq) + 2H2O(l) ® 2NaOH(aq) + Cl<sup>2</sup> (g) + H<sup>2</sup> (g)\n\nChlorine gas is given off at the anode, and hydrogen gas at the cathode. Sodium hydroxide solution is formed near the cathode. The three products produced in this process are all useful. Figure 2.8 shows the different uses of these products.\n\n![](_page_13_Figure_6.jpeg)\n\n**Figure 2.8** *Important products from the chlor-alkali process*\n\n#### **Bleaching powder**\n\nYou have already come to know that chlorine is produced during the electrolysis of aqueous sodium chloride (brine). This chlorine gas is used for the manufacture of bleaching powder. Bleaching powder is produced by the action of chlorine on dry slaked lime [Ca(OH)<sup>2</sup> ]. Bleaching powder is represented as Ca(ClO)<sup>2</sup> , though the actual composition is quite complex.\n\n```\n2Ca(OH)2\n          + 2Cl2 ® Ca(ClO)2\n                             + CaCl2\n                                      + 2H2O\n```\n\n### Bleaching powder is used –\n\n- (i) for bleaching cotton and linen in the textile industry, for bleaching wood pulp in paper factories and for bleaching washed clothes in laundry;\n- (ii) as an oxidising agent in many chemical industries; and\n- (iii) to make drinking water free from germs.\n\n#### Baking soda\n\nThe baking soda is commonly used in the kitchen for making tasty crispy pakoras, etc. Sometimes it is added for faster cooking. The chemical name of the compound is sodium hydrogencarbonate (NaHCO<sup>3</sup> ). It is produced using sodium chloride as one of the raw materials.\n\nNaCl + H O + CO + NH NH Cl + NaHCO 2 2 3 → <sup>4</sup> <sup>3</sup> (Ammonium (Sodium chloride) hydrogencarbonate)\n\nDid you check the pH of sodium hydrogencarbonate in Activity 2.14? Can you correlate why it can be used to neutralise an acid? It is a mild non-corrosive basic salt. The following reaction takes place when it is heated during cooking –\n\n2NaHCO<sup>3</sup> Na CO + H O+CO 2 3 2 <sup>2</sup> → Heat (Sodium (Sodium hydrogencarbonate) carbonate)\n\nSodium hydrogencarbonate has got various uses in the household.\n\n#### Uses of Baking soda\n\n(i) For making baking powder, which is a mixture of baking soda (sodium hydrogencarbonate) and a mild edible acid such as tartaric acid. When baking powder is heated or mixed in water, the following reaction takes place –\n\nNaHCO<sup>3</sup> + H<sup>+</sup> <sup>→</sup>CO<sup>2</sup> + H2O + Sodium salt of acid (From any acid)\n\nCarbon dioxide produced during the reaction can cause bread or cake to rise making them soft and spongy.\n\n- (ii) Sodium hydrogencarbonate is also an ingredient in antacids. Being alkaline, it neutralises excess acid in the stomach and provides relief.\n- (iii) It is also used in soda-acid fire extinguishers.\n\n#### Washing soda\n\nAnother chemical that can be obtained from sodium chloride is Na2CO<sup>3</sup> .10H2O (washing soda). You have seen above that sodium carbonate can be obtained by heating baking soda; recrystallisation of sodium carbonate gives washing soda. It is also a basic salt.\n\n```\nNa CO H O Na CO H O\nSodium\ncarbonate\n  2 3 + → 10 2 2 3 2 .10\n(\n      )\n```\n\nWhat does 10H2O signify? Does it make Na2CO<sup>3</sup> wet? We will address this question in the next section.\n\nSodium carbonate and sodium hydrogencarbonate are useful chemicals for many industrial processes as well.\n\n#### Uses of washing soda\n\n- (i) Sodium carbonate (washing soda) is used in glass, soap and paper industries.\n- (ii) It is used in the manufacture of sodium compounds such as borax.\n- (iii) Sodium carbonate can be used as a cleaning agent for domestic purposes.\n- (iv) It is used for removing permanent hardness of water.\n\n### 2.4.4 Are the Crystals of Salts really Dry?\n\n![](_page_15_Figure_8.jpeg)\n\n# Activity 2.15\n\n- n Heat a few crystals of copper sulphate in a dry boiling tube.\n- n What is the colour of the copper sulphate after heating?\n- n Do you notice water droplets in the boiling tube? Where have these come from?\n- n Add 2-3 drops of water on the sample of copper sulphate obtained after heating.\n- n What do you observe? Is the blue colour of copper sulphate restored?\n\n*Figure 2.9 Removing water of crystallisation*\n\nCopper sulphate crystals which seem to be dry contain water of crystallisation. When we heat the crystals, this water is removed and the salt turns white.\n\nIf you moisten the crystals again with water, you will find that blue colour of the crystals reappears.\n\nWater of crystallisation is the fixed number of water molecules present in one formula unit of a salt. Five water molecules are present in one formula unit of copper sulphate. Chemical formula for hydrated copper sulphate is Cu SO<sup>4</sup> . 5H2O. Now you would be able to answer the question whether the molecule of Na2CO<sup>3</sup> .10H2O is wet.\n\nOne other salt, which possesses water of crystallisation is gypsum. It has two water molecules as water of cyrstallisation. It has the chemical formula CaSO<sup>4</sup> .2H2O. Let us look into the use of this salt.\n\n#### Plaster of Paris\n\nOn heating gypsum at 373 K, it loses water molecules and becomes\n\ncalcium sulphate hemihydrate ( 4 2 1 CaSO . H O 2 ). This is called Plaster of Paris, the substance which doctors use as plaster for supporting fractured bones in the right position. Plaster of Paris is a white powder and on mixing with water, it changes to gypsum once again giving a hard solid mass.\n\nCaSO .<sup>1</sup> 2 H O +1<sup>1</sup> 2 <sup>4</sup> <sup>2</sup> H O CaSO .2H O <sup>2</sup> <sup>4</sup> <sup>2</sup> (Plaster of Paris) Gypsum) → (\n\nNote that only half a water molecule is shown to be attached as water of crystallisation. How can you get half a water molecule? It is written in this form because two formula units of CaSO<sup>4</sup> share one molecule of water. Plaster of Paris is used for making toys, materials for decoration and for making surfaces smooth. Try to find out why is calcium sulphate hemihydrate called 'Plaster of Paris' ?\n\n# **QUESTIONS**\n\n- 1. What is the common name of the compound Ca(ClO)<sup>2</sup> ?\n- 2. Name the substance which on treatment with chlorine yields bleaching powder.\n- 3. Name the sodium compound which is used for softening hard water.\n- 4. What will happen if a solution of sodium hydrocarbonate is heated? Give the equation of the reaction involved.\n- 5. Write an equation to show the reaction between Plaster of Paris and water.\n\n# What you have learnt\n\n- n Acid-base indicators are dyes or mixtures of dyes which are used to indicate the presence of acids and bases.\n- <sup>n</sup> Acidic nature of a substance is due to the formation of H<sup>+</sup> (aq) ions in solution. Formation of OH– (aq) ions in solution is responsible for the basic nature of a substance.\n- n When an acid reacts with a metal, hydrogen gas is evolved and a corresponding salt is formed.\n- n When a base reacts with a metal, along with the evolution of hydrogen gas a salt is formed which has a negative ion composed of the metal and oxygen.\n- n When an acid reacts with a metal carbonate or metal hydrogencarbonate, it gives the corresponding salt, carbon dioxide gas and water.\n- n Acidic and basic solutions in water conduct electricity because they produce hydrogen and hydroxide ions respectively.\n\n- n The strength of an acid or an alkali can be tested by using a scale called the pH scale (0-14) which gives the measure of hydrogen ion concentration in a solution.\n- n A neutral solution has a pH of exactly 7, while an acidic solution has a pH less than 7 and a basic solution a pH more than 7.\n- n Living beings carry out their metabolic activities within an optimal pH range.\n- n Mixing concentrated acids or bases with water is a highly exothermic process.\n- n Acids and bases neutralise each other to form corresponding salts and water.\n- n Water of crystallisation is the fixed number of water molecules present in one formula unit of a salt.\n- n Salts have various uses in everyday life and in industries.\n\n# EXERCISES\n\n- 1. A solution turns red litmus blue, its pH is likely to be\n- (a) 1 (b) 4 (c) 5 (d) 10\n- 2. A solution reacts with crushed egg-shells to give a gas that turns lime-water milky. The solution contains\n  - (a) NaCl (b) HCl (c) LiCl (d) KCl\n\n3. 10 mL of a solution of NaOH is found to be completely neutralised by 8 mL of a given solution of HCl. If we take 20 mL of the same solution of NaOH, the amount HCl solution (the same solution as before) required to neutralise it will be\n\n(a) 4 mL (b) 8 mL (c) 12 mL (d) 16 mL\n\n- 4. Which one of the following types of medicines is used for treating indigestion?\n  - (a) Antibiotic\n  - (b) Analgesic\n  - (c) Antacid\n  - (d) Antiseptic\n- 5. Write word equations and then balanced equations for the reaction taking place when –\n  - (a) dilute sulphuric acid reacts with zinc granules.\n  - (b) dilute hydrochloric acid reacts with magnesium ribbon.\n  - (c) dilute sulphuric acid reacts with aluminium powder.\n  - (d) dilute hydrochloric acid reacts with iron filings.\n- 6. Compounds such as alcohols and glucose also contain hydrogen but are not categorised as acids. Describe an Activity to prove it.\n- 7. Why does distilled water not conduct electricity, whereas rain water does?\n\n- 8. Why do acids not show acidic behaviour in the absence of water?\n- 9. Five solutions A,B,C,D and E when tested with universal indicator showed pH as\n  - 4,1,11,7 and 9, respectively. Which solution is\n  - (a) neutral?\n  - (b) strongly alkaline?\n  - (c) strongly acidic?\n  - (d) weakly acidic?\n  - (e) weakly alkaline?\n  - Arrange the pH in increasing order of hydrogen-ion concentration.\n- 10. Equal lengths of magnesium ribbons are taken in test tubes A and B. Hydrochloric acid (HCl) is added to test tube A, while acetic acid (CH3COOH) is added to test tube B. Amount and concentration taken for both the acids are same. In which test tube will the fizzing occur more vigorously and why?\n- 11. Fresh milk has a pH of 6. How do you think the pH will change as it turns into curd? Explain your answer.\n- 12. A milkman adds a very small amount of baking soda to fresh milk.\n  - (a) Why does he shift the pH of the fresh milk from 6 to slightly alkaline?\n  - (b) Why does this milk take a long time to set as curd?\n- 13. Plaster of Paris should be stored in a moisture-proof container. Explain why?\n- 14. What is a neutralisation reaction? Give two examples.\n- 15. Give two important uses of washing soda and baking soda.\n\n# Group Activity\n\n#### (I) Prepare your own indicator\n\n- n Crush beetroot in a mortar.\n- n Add sufficient water to obtain the extract.\n- n Filter the extract by the procedure learnt by you in earlier classes.\n- n Collect the filtrate to test the substances you may have tasted earlier.\n- n Arrange four test tubes in a test tube stand and label them as A,B,C and D. Pour 2 mL each of lemon juice solution, soda-water, vinegar and baking soda solution in them respectively.\n- n Put 2-3 drops of the beetroot extract in each test tube and note the colour change if any. Write your observation in a Table.\n- n You can prepare indicators by using other natural materials like extracts of red cabbage leaves, coloured petals of some flowers such as *Petunia*, *Hydrangea* and *Geranium*.\n\n#### (II) Preparing a soda-acid fire extinguisher\n\nThe reaction of acids with metal hydrogencarbonates is used in the fire extinguishers which produce carbon dioxide.\n\n- <sup>n</sup> Take 20 mL of sodium hydrogencarbonate (NaHCO<sup>3</sup> ) solution in a wash-bottle.\n- n Suspend an ignition tube containing dilute sulphuric acid in the wash-bottle (Fig. 2.10).\n- n Close the mouth of the wash-bottle.\n- n Tilt the wash-bottle so that the acid from the ignition tube mixes with the sodium hydrogencarbonate solution below.\n- n You will notice discharge coming out of the nozzle.\n- n Direct this discharge on a burning candle. What happens?\n\n![](_page_19_Figure_8.jpeg)\n\n*Figure 2.10 (a) Ignition tube containing dilute sulphuric acid suspended in a wash-bottle containing sodium hydrogencarbonate, (b) Discharge coming out of the nozzle*",
        "structured_data": {
            "error": "No structured data available"
        },
        "images": [
            {
                "name": "_page_0_Picture_0.jpeg",
                "path": "/home/content/converted_books/images/jesc102/_page_0_Picture_0.jpeg",
                "size_bytes": 23639,
                "description": "This image shows the chapter title page for \"Chapter 2: Acids, Bases and Salts\" with a simple diagram of laboratory equipment (appears to be a burette or similar apparatus used in titration experiments). The image serves as an introduction to the chemistry chapter that will cover the properties and interactions of acids, bases, and salts, including laboratory methods for testing and measuring these substances.",
                "description_generated_at": "2025-07-19 12:17:11"
            },
            {
                "name": "_page_0_Picture_1.jpeg",
                "path": "/home/content/converted_books/images/jesc102/_page_0_Picture_1.jpeg",
                "size_bytes": 11117,
                "description": "This image shows a QR code labeled \"1064CH02\" that likely provides digital access to additional educational resources or interactive content related to Chapter 2 on acids and bases. The QR code serves as a modern learning tool that students can scan with their devices to access supplementary materials about acid-base chemistry concepts discussed in the textbook.",
                "description_generated_at": "2025-07-19 12:17:11"
            },
            {
                "name": "_page_1_Figure_10.jpeg",
                "path": "/home/content/converted_books/images/jesc102/_page_1_Figure_10.jpeg",
                "size_bytes": 26399,
                "description": "This image shows Table 2.1, which is a data collection table with columns for \"Sample solution,\" \"Red litmus solution,\" \"Blue litmus solution,\" \"Phenolphthalein solution,\" and \"Methyl orange solution.\" The table is designed for students to record their observations of color changes when testing various acids and bases with different chemical indicators during the laboratory activity.",
                "description_generated_at": "2025-07-19 12:17:11"
            },
            {
                "name": "_page_2_Figure_19.jpeg",
                "path": "/home/content/converted_books/images/jesc102/_page_2_Figure_19.jpeg",
                "size_bytes": 60222,
                "description": "This diagram shows the experimental setup for testing the reaction between zinc granules and dilute sulfuric acid, where hydrogen gas is produced and collected through a delivery tube into a soap solution to form bubbles. The setup demonstrates how to safely test for hydrogen gas by bringing a burning candle near the gas-filled soap bubbles, which will produce a characteristic \"pop\" sound when the hydrogen ignites.",
                "description_generated_at": "2025-07-19 12:17:11"
            },
            {
                "name": "_page_3_Figure_11.jpeg",
                "path": "/home/content/converted_books/images/jesc102/_page_3_Figure_11.jpeg",
                "size_bytes": 35024,
                "description": "This diagram shows the experimental setup for testing the reaction between metal carbonates and acids, where carbon dioxide gas produced from the reaction of sodium carbonate with dilute hydrochloric acid is passed through a delivery tube into calcium hydroxide solution (lime water). The apparatus includes labeled components like a thistle funnel, cork, stand, test tubes, and delivery tube to demonstrate how the CO₂ gas can be collected and identified by bubbling it through lime water.",
                "description_generated_at": "2025-07-19 12:17:11"
            },
            {
                "name": "_page_5_Figure_9.jpeg",
                "path": "/home/content/converted_books/images/jesc102/_page_5_Figure_9.jpeg",
                "size_bytes": 22670,
                "description": "This diagram shows an experimental setup to test electrical conductivity of acid solutions, featuring a circuit with a 6-volt battery, bulb, and switch connected to two nails inserted through a rubber cork into a beaker containing dilute HCl solution. The experiment demonstrates that acid solutions conduct electricity (making the bulb glow), which helps students understand the ionic nature of acids in water.",
                "description_generated_at": "2025-07-19 12:17:11"
            },
            {
                "name": "_page_6_Figure_13.jpeg",
                "path": "/home/content/converted_books/images/jesc102/_page_6_Figure_13.jpeg",
                "size_bytes": 42608,
                "description": "This diagram illustrates the experimental setup for preparing HCl gas by adding concentrated sulfuric acid to solid sodium chloride in a test tube. The setup includes a delivery tube to collect the evolved gas and test it with moist litmus paper, demonstrating that acids produce hydrogen ions only in the presence of water (aqueous solution).",
                "description_generated_at": "2025-07-19 12:17:11"
            },
            {
                "name": "_page_7_Picture_10.jpeg",
                "path": "/home/content/converted_books/images/jesc102/_page_7_Picture_10.jpeg",
                "size_bytes": 16120,
                "description": "This image shows a red triangular warning sign with a yellow background depicting a hand being damaged by a corrosive liquid dripping from a test tube or container. The warning symbol is used to indicate the presence of corrosive acids and bases that can cause chemical burns and must be handled with extreme caution during laboratory activities.",
                "description_generated_at": "2025-07-19 12:17:11"
            },
            {
                "name": "_page_8_Figure_12.jpeg",
                "path": "/home/content/converted_books/images/jesc102/_page_8_Figure_12.jpeg",
                "size_bytes": 33296,
                "description": "This diagram illustrates the pH scale from 0 to 14, showing how the concentration of H⁺ ions (represented by the blue triangular area) decreases as pH increases, while OH⁻ ion concentration increases on the basic side. The scale clearly marks pH 7 as neutral, with acidic solutions below 7 and basic solutions above 7, visually demonstrating the inverse relationship between H⁺ and OH⁻ ion concentrations.",
                "description_generated_at": "2025-07-19 12:17:11"
            },
            {
                "name": "_page_8_Figure_13.jpeg",
                "path": "/home/content/converted_books/images/jesc102/_page_8_Figure_13.jpeg",
                "size_bytes": 10591,
                "description": "This figure illustrates the pH scale from 0 to 14, showing how pH varies with the concentration of H⁺ and OH⁻ ions in aqueous solutions. The diagram demonstrates that as H⁺ ion concentration increases (making solutions more acidic), pH decreases toward 0, while as OH⁻ ion concentration increases (making solutions more basic/alkaline), pH increases toward 14, with neutral solutions having a pH of 7.",
                "description_generated_at": "2025-07-19 12:17:11"
            },
            {
                "name": "_page_9_Figure_0.jpeg",
                "path": "/home/content/converted_books/images/jesc102/_page_9_Figure_0.jpeg",
                "size_bytes": 118040,
                "description": "This image shows a pH activity table (Activity 2.11) with 10 common solutions like saliva, lemon juice, and coffee that students can test, along with columns to record pH paper colors and values. Below the table is a colorful pH scale from 0-14 showing how different substances like gastric juice (very acidic, red) to sodium hydroxide (very basic, blue) correspond to specific colors and pH values.",
                "description_generated_at": "2025-07-19 12:17:11"
            },
            {
                "name": "_page_12_Picture_14.jpeg",
                "path": "/home/content/converted_books/images/jesc102/_page_12_Picture_14.jpeg",
                "size_bytes": 42687,
                "description": "This black and white historical photograph shows Mahatma Gandhi and his followers during the famous Dandi March, walking along what appears to be a beach or coastal area. The image illustrates the historical significance of sodium chloride (common salt) in India's freedom struggle, as mentioned in the surrounding text about Gandhi's salt march protest.",
                "description_generated_at": "2025-07-19 12:17:11"
            },
            {
                "name": "_page_13_Figure_6.jpeg",
                "path": "/home/content/converted_books/images/jesc102/_page_13_Figure_6.jpeg",
                "size_bytes": 58260,
                "description": "This diagram illustrates the chlor-alkali process, showing an electrolytic cell where brine (sodium chloride solution) is electrolyzed using electrodes separated by a membrane. The image labels the three main products produced - chlorine gas (Cl₂) at the anode, hydrogen gas (H₂) at the cathode, and sodium hydroxide (NaOH) in solution - along with their various industrial uses like water treatment, fertilizers, soaps, and detergents.",
                "description_generated_at": "2025-07-19 12:17:11"
            },
            {
                "name": "_page_15_Figure_8.jpeg",
                "path": "/home/content/converted_books/images/jesc102/_page_15_Figure_8.jpeg",
                "size_bytes": 34076,
                "description": "This diagram shows the experimental setup for demonstrating water of crystallization in copper sulfate crystals, with a labeled boiling tube containing copper sulfate crystals being heated over a Bunner burner while held by tongs. The illustration shows water droplets forming inside the tube as the \"dry\" crystals are heated, proving that salt crystals actually contain water molecules within their structure.",
                "description_generated_at": "2025-07-19 12:17:11"
            },
            {
                "name": "_page_19_Figure_8.jpeg",
                "path": "/home/content/converted_books/images/jesc102/_page_19_Figure_8.jpeg",
                "size_bytes": 57456,
                "description": "This diagram shows the construction and operation of a homemade soda-acid fire extinguisher, with part (a) displaying the setup where dilute sulphuric acid in an ignition tube is suspended above sodium hydrogencarbonate solution in a wash-bottle, and part (b) showing the tilted bottle producing a discharge of carbon dioxide gas through the nozzle. The image demonstrates how the chemical reaction between an acid and a metal hydrogencarbonate produces CO₂ gas that can be used to extinguish fires.",
                "description_generated_at": "2025-07-19 12:17:11"
            }
        ],
        "exercises": [
            {
                "question": "You have been provided with three test tubes. One of them contains distilled water and the other two contain an acidic solution and a basic solution, respectively. If you are given only red litmus paper, how will you identify the contents of each test tube?",
                "answer": "To identify the contents using only red litmus paper: 1) Test each solution with red litmus paper. 2) The acidic solution will keep the red litmus paper red (no change). 3) The basic solution will turn the red litmus paper blue. 4) For distilled water, the red litmus will remain red initially. 5) To confirm distilled water, take the blue litmus paper that was created by the basic solution and test it with the remaining unknown solution. If it turns red, that solution is acidic. If it remains blue, that solution is distilled water (neutral). This method uses the principle that acids keep red litmus red, bases turn red litmus blue, and neutral substances cause no color change."
            },
            {
                "question": "Which of these – vanilla, onion and clove, can be used as olfactory indicators on the basis of your observations?",
                "answer": "Based on Activity 2.2, onion and vanilla can be used as olfactory indicators. Onion-treated cloth strips change their odor when exposed to acids and bases - the characteristic onion smell diminishes in acidic medium and becomes more pronounced in basic medium. Vanilla essence also shows odor change - its sweet smell is retained in basic medium but diminishes or changes in acidic medium. These substances work as olfactory indicators because their odor changes in different pH environments. Clove oil may show some change but is less reliable compared to onion and vanilla for detecting acids and bases through smell."
            },
            {
                "question": "Why should curd and sour substances not be kept in brass and copper vessels?",
                "answer": "Curd and sour substances contain acids (like lactic acid in curd and citric acid in citrus fruits). These acids react with metals like copper and brass (which contains copper) to form metal salts that can be toxic and harmful to health. The reaction can be represented as: Metal + Acid → Metal salt + Hydrogen gas. The metal salts formed can cause food poisoning and other health problems. Additionally, this reaction can corrode the metal vessels, damaging them. Therefore, acidic substances should be stored in glass, ceramic, or food-grade plastic containers instead of metal vessels."
            },
            {
                "question": "Which gas is usually liberated when an acid reacts with a metal? Illustrate with an example. How will you test for the presence of this gas?",
                "answer": "Hydrogen gas (H₂) is usually liberated when an acid reacts with a metal. Example: When zinc reacts with dilute hydrochloric acid: Zn(s) + 2HCl(aq) → ZnCl₂(aq) + H₂(g). To test for hydrogen gas: 1) Collect the gas in a test tube by downward displacement of water or through a delivery tube. 2) Bring a burning matchstick or candle near the mouth of the test tube containing the gas. 3) If hydrogen is present, it will burn with a 'pop' sound and a pale blue flame. This 'pop' sound is the characteristic test for hydrogen gas. The reaction can be generalized as: Metal + Acid → Salt + Hydrogen gas."
            },
            {
                "question": "Metal compound A reacts with dilute hydrochloric acid to produce effervescence. The gas evolved extinguishes a burning candle. Write a balanced chemical equation for the reaction if one of the compounds formed is calcium chloride.",
                "answer": "The metal compound A is calcium carbonate (CaCO₃). The effervescence indicates gas evolution, and since the gas extinguishes a burning candle, it must be carbon dioxide (CO₂). Carbon dioxide extinguishes flames because it is denser than air and cuts off oxygen supply. Since one product is calcium chloride, the complete reaction is: CaCO₃(s) + 2HCl(aq) → CaCl₂(aq) + H₂O(l) + CO₂(g). This follows the general pattern: Metal carbonate + Acid → Salt + Water + Carbon dioxide. The CO₂ gas can be confirmed by passing it through lime water, which turns milky due to formation of calcium carbonate precipitate."
            },
            {
                "question": "Why do HCl, HNO₃, etc., show acidic characters in aqueous solutions while solutions of compounds like alcohol and glucose do not show acidic character?",
                "answer": "HCl, HNO₃, and other acids show acidic character in aqueous solutions because they ionize in water to produce H⁺ (or H₃O⁺) ions. For example: HCl(aq) → H⁺(aq) + Cl⁻(aq). These H⁺ ions are responsible for acidic properties like turning blue litmus red, conducting electricity, and reacting with metals. In contrast, compounds like alcohol (C₂H₅OH) and glucose (C₆H₁₂O₆) do not ionize in water to produce H⁺ ions, even though they contain hydrogen atoms. The hydrogen in these compounds is covalently bonded and does not dissociate as H⁺ ions in aqueous solution. Therefore, they do not show acidic behavior and do not conduct electricity."
            },
            {
                "question": "Why does an aqueous solution of an acid conduct electricity?",
                "answer": "An aqueous solution of an acid conducts electricity because acids ionize in water to produce ions. When acids dissolve in water, they dissociate to form H⁺ (hydronium H₃O⁺) ions and corresponding anions. For example: HCl → H⁺ + Cl⁻, H₂SO₄ → 2H⁺ + SO₄²⁻. These free-moving ions act as charge carriers and allow electric current to flow through the solution. The movement of positive ions (cations) toward the negative electrode (cathode) and negative ions (anions) toward the positive electrode (anode) constitutes the electric current. Pure water does not conduct electricity well because it has very few ions, but the presence of acids increases the ion concentration significantly."
            },
            {
                "question": "Why does dry HCl gas not change the colour of the dry litmus paper?",
                "answer": "Dry HCl gas does not change the color of dry litmus paper because acids show their acidic properties only in the presence of water. In dry conditions, HCl exists as molecules and does not dissociate into H⁺ and Cl⁻ ions. The acidic behavior of HCl is due to the formation of H₃O⁺ ions when it reacts with water: HCl + H₂O → H₃O⁺ + Cl⁻. Without water, this ionization cannot occur, so no H⁺ ions are produced. Litmus paper changes color only when it comes in contact with H⁺ ions. Therefore, both the HCl gas and litmus paper must be in the presence of moisture (water) for the color change to occur."
            },
            {
                "question": "While diluting an acid, why is it recommended that the acid should be added to water and not water to the acid?",
                "answer": "When diluting an acid, acid should always be added to water (not water to acid) because the process of dissolving an acid in water is highly exothermic and releases a large amount of heat. If water is added to concentrated acid: 1) The small amount of water will absorb all the heat generated, causing it to boil violently and splash out dangerous acid droplets. 2) The glass container may crack due to sudden heating. 3) This can cause severe burns and injuries. When acid is added slowly to water with constant stirring: 1) The large volume of water absorbs the heat safely. 2) The temperature rise is gradual and controlled. 3) The risk of splashing and accidents is minimized. Remember: 'Add acid to water, not water to acid' - this is a fundamental safety rule in chemistry."
            },
            {
                "question": "How is the concentration of hydronium ions (H₃O⁺) affected when a solution of an acid is diluted?",
                "answer": "When an acid solution is diluted by adding water, the concentration of hydronium ions (H₃O⁺) decreases. This happens because: 1) The total number of H₃O⁺ ions remains the same, but they are now distributed in a larger volume of solution. 2) Concentration = Number of ions/Volume, so as volume increases, concentration decreases. 3) As H₃O⁺ concentration decreases, the pH of the solution increases (becomes less acidic). 4) The solution becomes weaker in terms of its acidic strength. For example, if 1M HCl is diluted by adding equal volume of water, the concentration becomes 0.5M, meaning the H₃O⁺ concentration is halved. This principle is used in laboratories to prepare solutions of desired strength from concentrated acids."
            },
            {
                "question": "How is the concentration of hydroxide ions (OH⁻) affected when excess base is dissolved in a solution of sodium hydroxide?",
                "answer": "When excess base is dissolved in a solution of sodium hydroxide, the concentration of hydroxide ions (OH⁻) increases. This occurs because: 1) More base molecules dissociate to produce additional OH⁻ ions: NaOH(s) → Na⁺(aq) + OH⁻(aq). 2) The total number of OH⁻ ions in the solution increases. 3) Higher OH⁻ concentration makes the solution more basic (alkaline). 4) The pH of the solution increases (becomes more than 7, moving toward 14). 5) The solution becomes stronger in terms of its basic strength. However, there's a limit to how much base can dissolve (solubility limit), and beyond saturation, no more base will dissolve, so OH⁻ concentration will reach a maximum value."
            },
            {
                "question": "You have two solutions, A and B. The pH of solution A is 6 and pH of solution B is 8. Which solution has more hydrogen ion concentration? Which of this is acidic and which one is basic?",
                "answer": "Solution A (pH = 6) has more hydrogen ion concentration than solution B (pH = 8). This is because pH is inversely related to H⁺ ion concentration - lower pH means higher H⁺ concentration. Solution A (pH = 6) is acidic because its pH is less than 7. Solution B (pH = 8) is basic because its pH is greater than 7. The pH scale works such that: pH < 7 = acidic, pH = 7 = neutral, pH > 7 = basic. As pH decreases from 7 to 0, the solution becomes more acidic (higher H⁺ concentration). As pH increases from 7 to 14, the solution becomes more basic (lower H⁺ concentration, higher OH⁻ concentration)."
            },
            {
                "question": "What effect does the concentration of H⁺(aq) ions have on the nature of the solution?",
                "answer": "The concentration of H⁺(aq) ions directly determines the acidic or basic nature of a solution: 1) Higher H⁺ concentration → More acidic solution → Lower pH (0-7). 2) Lower H⁺ concentration → Less acidic/more basic solution → Higher pH (7-14). 3) When H⁺ concentration equals OH⁻ concentration → Neutral solution → pH = 7. 4) Very high H⁺ concentration → Strong acid → pH close to 0. 5) Very low H⁺ concentration → Strong base → pH close to 14. The relationship is logarithmic: each unit change in pH represents a 10-fold change in H⁺ concentration. This concentration also affects the solution's ability to conduct electricity, react with metals, change indicator colors, and neutralize bases."
            },
            {
                "question": "Do basic solutions also have H⁺(aq) ions? If yes, then why are these basic?",
                "answer": "Yes, basic solutions also contain H⁺(aq) ions, but in very low concentrations. In any aqueous solution, water undergoes self-ionization: H₂O ⇌ H⁺ + OH⁻. At 25°C, the product [H⁺][OH⁻] = 10⁻¹⁴ (constant). In basic solutions: 1) OH⁻ concentration is much higher than H⁺ concentration. 2) For example, if [OH⁻] = 10⁻⁴ M, then [H⁺] = 10⁻¹⁰ M. 3) Since [OH⁻] > [H⁺], the solution is basic. 4) The high concentration of OH⁻ ions dominates the solution's properties. 5) pH = -log[H⁺] = 10, which is basic (>7). So basic solutions are called 'basic' not because they lack H⁺ ions, but because OH⁻ ions are present in much higher concentration than H⁺ ions."
            },
            {
                "question": "Under what soil condition do you think a farmer would treat the soil of his fields with quick lime (calcium oxide) or slaked lime (calcium hydroxide) or chalk (calcium carbonate)?",
                "answer": "A farmer would treat soil with quick lime (CaO), slaked lime [Ca(OH)₂], or chalk (CaCO₃) when the soil is acidic (pH < 7). Acidic soil conditions occur due to: 1) Excessive use of chemical fertilizers. 2) Acid rain. 3) Decomposition of organic matter producing organic acids. 4) Leaching of basic nutrients. Effects of acidic soil: 1) Poor plant growth. 2) Reduced nutrient availability. 3) Toxic effects on plant roots. Treatment mechanism: 1) CaO + H₂O → Ca(OH)₂ (quick lime forms slaked lime). 2) Ca(OH)₂ neutralizes soil acids: Ca(OH)₂ + 2H⁺ → Ca²⁺ + 2H₂O. 3) CaCO₃ also neutralizes acids: CaCO₃ + 2H⁺ → Ca²⁺ + H₂O + CO₂. This process increases soil pH to optimal range (6.5-7.5) for most crops, improving nutrient availability and plant growth."
            },
            {
                "question": "What is the common name of the compound Ca(ClO)₂?",
                "answer": "The common name of the compound Ca(ClO)₂ is bleaching powder. It is also known as chloride of lime or calcium hypochlorite. Bleaching powder is produced by the action of chlorine gas on dry slaked lime [Ca(OH)₂]: Ca(OH)₂ + Cl₂ → Ca(ClO)₂ + H₂O. However, the actual composition is more complex than the simple formula Ca(ClO)₂ suggests. It's widely used for bleaching cotton and linen in textile industry, bleaching wood pulp in paper factories, as an oxidizing agent in chemical industries, and for disinfecting drinking water to make it free from germs."
            },
            {
                "question": "Name the substance which on treatment with chlorine yields bleaching powder.",
                "answer": "The substance that yields bleaching powder when treated with chlorine is slaked lime or calcium hydroxide [Ca(OH)₂]. The reaction is: Ca(OH)₂ + Cl₂ → Ca(ClO)₂ + H₂O. Slaked lime is prepared by adding water to quick lime (calcium oxide): CaO + H₂O → Ca(OH)₂. The dry slaked lime is then treated with chlorine gas to produce bleaching powder. This process is carried out industrially to manufacture bleaching powder on a large scale for various applications including textile bleaching, paper manufacturing, and water treatment."
            },
            {
                "question": "Name the sodium compound which is used for softening hard water.",
                "answer": "The sodium compound used for softening hard water is washing soda or sodium carbonate (Na₂CO₃·10H₂O). Hard water contains dissolved calcium and magnesium salts (like CaCl₂, MgSO₄) which form scum with soap and prevent lather formation. Washing soda removes these hardness-causing ions by precipitation: Na₂CO₃ + CaCl₂ → CaCO₃↓ + 2NaCl, Na₂CO₃ + MgSO₄ → MgCO₃↓ + Na₂SO₄. The calcium and magnesium carbonates precipitate out, leaving soft water that readily forms lather with soap. This process removes permanent hardness of water."
            },
            {
                "question": "What will happen if a solution of sodium hydrogencarbonate is heated? Give the equation of the reaction involved.",
                "answer": "When a solution of sodium hydrogencarbonate (baking soda) is heated, it decomposes to form sodium carbonate, water, and carbon dioxide gas. The reaction equation is: 2NaHCO₃(s) → Na₂CO₃(s) + H₂O(l) + CO₂(g). This is a thermal decomposition reaction. The carbon dioxide gas evolved during this reaction is what makes bread and cakes rise and become soft and spongy during baking. The reaction is also utilized in baking powder, where sodium hydrogencarbonate is mixed with a mild edible acid like tartaric acid. When heated or mixed with water during cooking, CO₂ is released, creating the desired texture in baked goods."
            },
            {
                "question": "Write an equation to show the reaction between Plaster of Paris and water.",
                "answer": "The equation for the reaction between Plaster of Paris and water is: CaSO₄·½H₂O + 1½H₂O → CaSO₄·2H₂O. This can also be written as: CaSO₄·½H₂O + 1½H₂O → CaSO₄·2H₂O (Plaster of Paris + Water → Gypsum). When Plaster of Paris (calcium sulfate hemihydrate) is mixed with water, it rapidly sets and hardens by forming gypsum (calcium sulfate dihydrate). This reaction is exothermic and the setting process is irreversible under normal conditions. This property makes Plaster of Paris useful for making casts for broken bones, decorative materials, toys, and for creating smooth surfaces."
            }
        ],
        "summary": {
            "title": "Acids, Bases and Salts",
            "key_concepts": [
                "Acid-base indicators and their color changes in different pH environments",
                "Chemical properties of acids and bases - reactions with metals, carbonates, and each other",
                "pH scale and its importance in everyday life and biological systems",
                "Formation and properties of salts, including water of crystallization",
                "Industrial preparation of important chemicals from common salt (sodium chloride)"
            ],
            "summary": "This chapter explores the fundamental concepts of acids, bases, and salts, starting with natural and synthetic indicators that help identify these substances. It covers the chemical properties of acids and bases, including their reactions with metals (producing hydrogen gas), metal carbonates (producing carbon dioxide), and their neutralization reactions with each other. The chapter introduces the pH scale as a measure of acidity and alkalinity, emphasizing its crucial role in biological processes, soil chemistry, and everyday applications like digestion and tooth care. The latter part focuses on salts, their classification into families, and their pH characteristics. A significant portion is dedicated to the industrial chemistry of common salt, showing how sodium chloride serves as a raw material for producing essential chemicals like sodium hydroxide (through chlor-alkali process), bleaching powder, baking soda, and washing soda. The chapter concludes with the concept of water of crystallization in salt crystals, exemplified by copper sulfate and gypsum, and the practical application of Plaster of Paris."
        }
    },
    "statistics": {
        "total_images": 15,
        "text_length": 38057,
        "processing_time": 20.63
    },
    "claude_processing": {
        "processed_at": "2025-07-19 12:17:11",
        "model_used": "claude-sonnet-4-20250514",
        "tasks_completed": [
            "exercises",
            "answers",
            "summary",
            "image_descriptions"
        ],
        "exercises_count": 20,
        "images_processed": 15
    }
}