{
    "id": "9c2ae5a5-de1a-490a-a015-3cebaa4104b8",
    "title": "Metals and Non-metals",
    "source_file": "/home/content/books/science/jesc103.pdf",
    "filename": "jesc103.pdf",
    "subject": "science",
    "conversion_timestamp": "2025-07-18T12:07:33.277646",
    "processing_time_seconds": 19.16,
    "metadata": "md",
    "content": {
        "markdown_text": "![](_page_0_Picture_0.jpeg)\n\n![](_page_0_Picture_1.jpeg)\n\n![](_page_0_Picture_2.jpeg)\n\nI n Class IX you have learnt about various elements. You have seen that elements can be classified as metals or non-metals on the basis of their properties.\n\n- n Think of some uses of metals and non-metals in your daily life.\n- n What properties did you think of while categorising elements as metals or non-metals?\n- n How are these properties related to the uses of these elements? Let us look at some of these properties in detail.\n\n### 3.1 PHYSICAL PROPERTIES\n\n#### 3.1.1 Metals\n\nThe easiest way to start grouping substances is by comparing their physical properties. Let us study this with the help of the following activities. For performing Activities 3.1 to 3.6, collect the samples of following metals – iron, copper, aluminium, magnesium, sodium, lead, zinc and any other metal that is easily available.\n\n## Activity 3.1\n\n- n Take samples of iron, copper, aluminium and magnesium. Note the appearance of each sample.\n- n Clean the surface of each sample by rubbing them with sand paper and note their appearance again.\n\nMetals, in their pure state, have a shining surface. This property is called metallic lustre.\n\n## Activity 3.2\n\n- n Take small pieces of iron, copper, aluminium, and magnesium. Try to cut these metals with a sharp knife and note your observations.\n- n Hold a piece of sodium metal with a pair of tongs. CAUTION: Always handle sodium metal with care. Dry it by pressing between the folds of a filter paper.\n- n Put it on a watch-glass and try to cut it with a knife.\n- n What do you observe?\n\nYou will find that metals are generally hard. The hardness varies from metal to metal.\n\n### Activity 3.3\n\n- n Take pieces of iron, zinc, lead and copper.\n- n Place any one metal on a block of iron and strike it four or five times with a hammer. What do you observe?\n- n Repeat with other metals.\n- n Record the change in the shape of these metals.\n\nYou will find that some metals can be beaten into thin sheets. This property is called malleability. Did you know that gold and silver are the most malleable metals?\n\n#### Activity 3.4\n\nn List the metals whose wires you have seen in daily life.\n\nThe ability of metals to be drawn into thin wires is called ductility. Gold is the most ductile metal. You will be surprised to know that a wire of about 2 km length can be drawn from one gram of gold.\n\nIt is because of their malleability and ductility that metals can be given different shapes according to our needs.\n\nCan you name some metals that are used for making cooking vessels? Do you know why these metals are used for making vessels? Let us do the following Activity to find out the answer.\n\n![](_page_1_Figure_12.jpeg)\n\n*Metals are good conductors of heat.*\n\nThe above activity shows that metals are good conductors of heat and have high melting points. The best conductors of heat are silver and copper. Lead and mercury are comparatively poor conductors of heat.\n\nDo metals also conduct electricity? Let us find out.\n\n### Activity 3.6\n\n- n Set up an electric circuit as shown in Fig. 3.2.\n- n Place the metal to be tested in the circuit\n- between terminals A and B as shown.\n- n Does the bulb glow? What does this indicate?\n\nYou must have seen that the wires that carry current in your homes have a coating of polyvinylchloride (PVC) or a rubber-like material. Why are electric wires coated with such substances?\n\nWhat happens when metals strike a hard surface? Do they produce a sound? The metals that produce a sound on striking a hard surface are said to be sonorous. Can you now say why school bells are made of metals?\n\n#### 3.1.2 Non-metals\n\nIn the previous Class you have learnt that there are very few non-metals as compared to metals. Some of the examples of non-metals are carbon, sulphur, iodine, oxygen, hydrogen, etc. The non-metals are either solids or gases except bromine which is a liquid.\n\nDo non-metals also have physical properties similar to that of metals? Let us find out.\n\n### Activity 3.7\n\n- n Collect samples of carbon (coal or graphite), sulphur and iodine.\n- n Carry out the Activities 3.1 to 3.4 and 3.6 with these non-metals and record your observations.\n\nCompile your observations regarding metals and non-metals in Table 3.1.\n\n#### Table 3.1\n\n| Element | Symbol | Type of<br>surface | Hardness | Malleability | Ductility | Conducts<br>Electricity | Sonority |\n|---------|--------|--------------------|----------|--------------|-----------|-------------------------|----------|\n|         |        |                    |          |              |           |                         |          |\n\nOn the bases of the observations recorded in Table 3.1, discuss the general physical properties of metals and non-metals in the class. You must have concluded that we cannot group elements according to their physical properties alone, as there are many exceptions. For example –\n\n(i) All metals except mercury exist as solids at room temperature. In Activity 3.5, you have observed that metals have high melting\n\n![](_page_2_Figure_18.jpeg)\n\n*Figure 3.2 Metals are good conductors of electricity.*\n\npoints but gallium and caesium have very low melting points. These two metals will melt if you keep them on your palm.\n\n- (ii) Iodine is a non-metal but it is lustrous.\n- (iii) Carbon is a non-metal that can exist in different forms. Each form is called an allotrope. Diamond, an allotrope of carbon, is the hardest natural substance known and has a very high melting and boiling point. Graphite, another allotrope of carbon, is a conductor of electricity.\n- (iv) Alkali metals (lithium, sodium, potassium) are so soft that they can be cut with a knife. They have low densities and low melting points.\n\nElements can be more clearly classified as metals and non-metals on the basis of their chemical properties.\n\n#### Activity 3.8\n\n- n Take a magnesium ribbon and some sulphur powder.\n- n Burn the magnesium ribbon. Collect the ashes formed and dissolve them in water.\n- n Test the resultant solution with both red and blue litmus paper.\n- n Is the product formed on burning magnesium acidic or basic?\n- n Now burn sulphur powder. Place a test tube over the burning sulphur to collect the fumes produced.\n- n Add some water to the above test tube and shake.\n- n Test this solution with blue and red litmus paper.\n- n Is the product formed on burning sulphur acidic or basic?\n- n Can you write equations for these reactions?\n\n Most non-metals produce acidic oxides when dissolve in water. On the other hand, most metals, give rise to basic oxides. You will be learning more about these metal oxides in the next section.\n\n![](_page_3_Picture_16.jpeg)\n\n#### 3.2 CHEMICAL PROPERTIES OF METALS\n\nWe will learn about the chemical properties of metals in the following Sections 3.2.1 to 3.2.4. For this, collect the samples of following metals – aluminium, copper, iron, lead, magnesium, zinc and sodium.\n\n#### 3.2.1 What happens when Metals are burnt in Air?\n\nYou have seen in Activity 3.8 that magnesium burns in air with a dazzling white flame. Do all metals react in the same manner? Let us check by performing the following Activity.\n\n### Activity 3.9\n\nCAUTION: The following activity needs the teacher's assistance. It would be better if students wear eye protection.\n\n- n Hold any of the samples taken above with a pair of tongs and try burning over a flame. Repeat with the other metal samples.\n- n Collect the product if formed.\n- n Let the products and the metal surface cool down.\n- n Which metals burn easily?\n- n What flame colour did you observe when the metal burnt?\n- n How does the metal surface appear after burning?\n- n Arrange the metals in the decreasing order of their reactivity towards oxygen.\n- n Are the products soluble in water?\n\nAlmost all metals combine with oxygen to form metal oxides.\n\n```\nMetal + Oxygen → Metal oxide\n```\n\n For example, when copper is heated in air, it combines with oxygen to form copper(II) oxide, a black oxide.\n\n2Cu + O<sup>2</sup> → 2CuO (Copper) (Copper(II) oxide)\n\nSimilarly, aluminium forms aluminium oxide.\n\n4Al <sup>+</sup> 3O<sup>2</sup> <sup>→</sup> 2Al2O<sup>3</sup> (Aluminium) (Aluminium oxide)\n\nRecall from Chapter 2, how copper oxide reacts with hydrochloric acid. We have learnt that metal oxides are basic in nature. But some metal oxides, such as aluminium oxide, zinc oxide show both acidic as well as basic behaviour. Such metal oxides which react with both acids as well as bases to produce salts and water are known as amphoteric oxides. Aluminium oxide reacts in the following manner with acids and bases –\n\nAl2O<sup>3</sup> + 6HCl <sup>→</sup> 2AlCl<sup>3</sup> + 3H2O Al2O<sup>3</sup> + 2NaOH <sup>→</sup> 2NaAlO<sup>2</sup> + H2O (Sodium aluminate)\n\n Most metal oxides are insoluble in water but some of these dissolve in water to form alkalis. Sodium oxide and potassium oxide dissolve in water to produce alkalis as follows –\n\nNa2O(s) <sup>+</sup> <sup>H</sup>2O(l) → 2NaOH(aq) <sup>K</sup>2O(s) <sup>+</sup> <sup>H</sup>2O(l) → 2KOH(aq)\n\nWe have observed in Activity 3.9 that all metals do not react with oxygen at the same rate. Different metals show different reactivities towards oxygen. Metals such as potassium and sodium react so vigorously that they catch fire if kept in the open. Hence, to protect them and to prevent accidental fires, they are kept immersed in kerosene oil. At ordinary temperature, the surfaces of metals such as magnesium, aluminium, zinc, lead, etc., are covered with a thin layer of oxide. The protective oxide layer prevents the metal from further oxidation. Iron does not burn on heating but iron filings burn vigorously when sprinkled in the flame of the burner. Copper does not burn, but the hot metal is coated with a black coloured layer of copper(II) oxide. Silver and gold do not react with oxygen even at high temperatures.\n\nAnodising is a process of forming a thick oxide layer of aluminium. Aluminium develops a thin oxide layer when exposed to air. This aluminium oxide coat makes it resistant to further corrosion. The resistance can be improved further by making the oxide layer thicker. During anodising, a clean aluminium article is made the anode and is electrolysed with dilute sulphuric acid. The oxygen gas evolved at the anode reacts with aluminium to make a thicker protective oxide layer. This oxide layer can be dyed easily to give aluminium articles an attractive finish.\n\n> After performing Activity 3.9, you must have observed that sodium is the most reactive of the samples of metals taken here. The reaction of magnesium is less vigorous implying that it is not as reactive as sodium. But burning in oxygen does not help us to decide about the reactivity of zinc, iron, copper or lead. Let us see some more reactions to arrive at a conclusion about the order of reactivity of these metals.\n\n#### 3.2.2 What happens when Metals react with Water?\n\n## Activity 3.10\n\nCAUTION: This Activity needs the teacher's assistance.\n\n- n Collect the samples of the same metals as in Activity 3.9.\n- n Put small pieces of the samples separately in beakers half-filled with cold water.\n- n Which metals reacted with cold water? Arrange them in the increasing order of their reactivity with cold water.\n- n Did any metal produce fire on water?\n- n Does any metal start floating after some time?\n- n Put the metals that did not react with cold water in beakers half-filled with hot water.\n- n For the metals that did not react with hot water, arrange the apparatus as shown in Fig. 3.3 and observe their reaction with steam.\n- n Which metals did not react even with steam?\n- n Arrange the metals in the decreasing order of reactivity with water.\n\n![](_page_6_Figure_0.jpeg)\n\n*Figure 3.3 Action of steam on a metal*\n\nMetals react with water and produce a metal oxide and hydrogen gas. Metal oxides that are soluble in water dissolve in it to further form metal hydroxide. But all metals do not react with water.\n\nMetal + Water → Metal oxide + Hydrogen Metal oxide + Water → Metal hydroxide\n\nMetals like potassium and sodium react violently with cold water. In case of sodium and potassium, the reaction is so violent and exothermic that the evolved hydrogen immediately catches fire.\n\n```\n2K(s) + 2H2O(l) → 2KOH(aq) + H2\n                                  (g) + heat energy\n2Na(s) + 2H2O(l) → 2NaOH(aq) + H2\n                                  (g) + heat energy\n```\n\nThe reaction of calcium with water is less violent. The heat evolved is not sufficient for the hydrogen to catch fire.\n\n```\nCa(s) + 2H2O(l) → Ca(OH)2\n                            (aq) + H2\n                                     (g)\n```\n\nCalcium starts floating because the bubbles of hydrogen gas formed stick to the surface of the metal.\n\nMagnesium does not react with cold water. It reacts with hot water to form magnesium hydroxide and hydrogen. It also starts floating due to the bubbles of hydrogen gas sticking to its surface.\n\nMetals like aluminium, iron and zinc do not react either with cold or hot water. But they react with steam to form the metal oxide and hydrogen.\n\n2Al(s) <sup>+</sup> 3H2O(g) <sup>→</sup> Al2O<sup>3</sup> (s) + 3H<sup>2</sup> (g) 3Fe(s) <sup>+</sup> 4H2O(g) <sup>→</sup> Fe3O<sup>4</sup> (s) + 4H<sup>2</sup> (g)\n\nMetals such as lead, copper, silver and gold do not react with water at all.\n\n#### 3.2.3 What happens when Metals react with Acids?\n\nYou have already learnt that metals react with acids to give a salt and hydrogen gas.\n\n#### Metal + Dilute acid → Salt + Hydrogen\n\nBut do all metals react in the same manner? Let us find out.\n\n### Activity 3.11\n\n- n Collect all the metal samples except sodium and potassium again. If the samples are tarnished, rub them clean with sand paper. CAUTION: Do not take sodium and potassium as they react vigorously even with cold water.\n- n Put the samples separately in test tubes containing dilute hydrochloric acid.\n- n Suspend thermometers in the test tubes, so that their bulbs are dipped in the acid.\n- n Observe the rate of formation of bubbles carefully.\n- n Which metals reacted vigorously with dilute hydrochloric acid?\n- n With which metal did you record the highest temperature?\n- n Arrange the metals in the decreasing order of reactivity with dilute acids.\n\nWrite equations for the reactions of magnesium, aluminium, zinc and iron with dilute hydrochloric acid.\n\nHydrogen gas is not evolved when a metal reacts with nitric acid. It is because HNO<sup>3</sup> is a strong oxidising agent. It oxidises the H<sup>2</sup> produced to water and itself gets reduced to any of the nitrogen oxides (N2O, NO, NO<sup>2</sup> ). But magnesium (Mg) and manganese (Mn) react with very dilute HNO<sup>3</sup> to evolve H<sup>2</sup> gas.\n\nYou must have observed in Activity 3.11, that the rate of formation of bubbles was the fastest in the case of magnesium. The reaction was also the most exothermic in this case. The reactivity decreases in the order Mg > Al > Zn > Fe. In the case of copper, no bubbles were seen and the temperature also remained unchanged. This shows that copper does not react with dilute HCl.\n\n*Aqua regia,* (Latin for 'royal water') is a freshly prepared mixture of concentrated hydrochloric acid and concentrated nitric acid in the ratio of 3:1. It can dissolve gold, even though neither of these acids can do so alone. *Aqua regia* is a highly corrosive, fuming liquid. It is one of the few reagents that is able to dissolve gold and platinum.\n\n> 3.2.4 How do Metals react with Solutions of other Metal Salts?\n\n### Activity 3.12\n\nDo You Know?\n\n- n Take a clean wire of copper and an iron nail.\n- n Put the copper wire in a solution of iron sulphate and the iron nail in a solution of copper sulphate taken in test tubes (Fig. 3.4).\n- n Record your observations after 20 minutes.\n\n- n In which test tube did you find that a reaction has occurred?\n- n On what basis can you say that a reaction has actually taken place?\n- n Can you correlate your observations for the Activities 3.9, 3.10 and 3.11?\n- n Write a balanced chemical equation for the reaction that has taken place.\n- n Name the type of reaction.\n\nReactive metals can displace less reactive metals from their compounds in solution or molten form.\n\nWe have seen in the previous sections that all metals are not equally reactive. We checked the reactivity of various metals with oxygen, water and acids. But all metals do not react with these reagents. So we were not able to put all the metal samples we had collected in decreasing order of their reactivity. Displacement reactions studied in Chapter 1 give better evidence about the reactivity of metals. It is simple and easy if metal A displaces metal B from its solution, it is more reactive than B.\n\n*Figure 3.4 Reaction of metals with salt solutions*\n\nMetal A + Salt solution of B → Salt solution of A + Metal B\n\nWhich metal, copper or iron, is more reactive according to your observations in Activity 3.12?\n\n#### 3.2.5 The Reactivity Series\n\nThe reactivity series is a list of metals arranged in the order of their decreasing activities. After performing displacement experiments (Activities 1.9 and 3.12), the following series, (Table 3.2) known as the reactivity or activity series has been developed.\n\nTable 3.2 Activity series : Relative reactivities of metals\n\n| K   | Potassium  | Most reactive        |\n|-----|------------|----------------------|\n| Na  | Sodium     |                      |\n| Ca  | Calcium    |                      |\n| Mg  | Magnesium  |                      |\n| Al  | Aluminium  |                      |\n| Zn  | Zinc       | Reactivity decreases |\n| Fe  | Iron       |                      |\n| Pb  | Lead       |                      |\n| [H] | [Hydrogen] |                      |\n| Cu  | Copper     |                      |\n| Hg  | Mercury    |                      |\n| Ag  | Silver     |                      |\n| Au  | Gold       | Least reactive       |\n|     |            |                      |\n\n# QUESTIONS\n\n- 1. Why is sodium kept immersed in kerosene oil?\n- 2. Write equations for the reactions of\n  - (i) iron with steam\n  - (ii) calcium and potassium with water\n- 3. Samples of four metals A, B, C and D were taken and added to the following solution one by one. The results obtained have been tabulated as follows.\n\n| 1.<br>Why is sodium kept immersed in kerosene oil? |                                                                                                                                                                 |                     |               |                |  |  |  |  |\n|----------------------------------------------------|-----------------------------------------------------------------------------------------------------------------------------------------------------------------|---------------------|---------------|----------------|--|--|--|--|\n| 2.                                                 | Write equations for the reactions of                                                                                                                            |                     |               |                |  |  |  |  |\n|                                                    | (i)<br>iron with steam                                                                                                                                          |                     |               |                |  |  |  |  |\n| (ii)<br>calcium and potassium with water           |                                                                                                                                                                 |                     |               |                |  |  |  |  |\n| 3.                                                 | ?<br>Samples of four metals A, B, C and D were taken and added to the<br>following solution one by one. The results obtained have been tabulated<br>as follows. |                     |               |                |  |  |  |  |\n|                                                    |                                                                                                                                                                 |                     |               |                |  |  |  |  |\n| Metal                                              | Iron(II) sulphate                                                                                                                                               | Copper(II) sulphate | Zinc sulphate | Silver nitrate |  |  |  |  |\n| A                                                  | No reaction                                                                                                                                                     | Displacement        |               |                |  |  |  |  |\n| B                                                  | Displacement                                                                                                                                                    |                     | No reaction   |                |  |  |  |  |\n| C                                                  | No reaction                                                                                                                                                     | No reaction         | No reaction   | Displacement   |  |  |  |  |\n| D                                                  | No reaction                                                                                                                                                     | No reaction         | No reaction   | No reaction    |  |  |  |  |\n\nUse the Table above to answer the following questions about metals A, B, C and D.\n\n- (i) Which is the most reactive metal?\n- (ii) What would you observe if B is added to a solution of Copper(II) sulphate?\n- (iii) Arrange the metals A, B, C and D in the order of decreasing reactivity.\n- 4. Which gas is produced when dilute hydrochloric acid is added to a reactive metal? Write the chemical reaction when iron reacts with dilute H2SO<sup>4</sup> .\n- 5. What would you observe when zinc is added to a solution of iron(II) sulphate? Write the chemical reaction that takes place.\n\n#### 3.3 HOW DO METALS AND NON-METALS REA ALS REACT?\n\nIn the above activities, you saw the reactions of metals with a number of reagents. Why do metals react in this manner? Let us recall what we learnt about the electronic configuration of elements in Class IX. We learnt that noble gases, which have a completely filled valence shell, show little chemical activity. We, therefore, explain the reactivity of elements as a tendency to attain a completely filled valence shell.\n\nLet us have a look at the electronic configuration of noble gases and some metals and non-metals.\n\nWe can see from Table 3.3 that a sodium atom has one electron in its outermost shell. If it loses the electron from its M shell then its L shell now becomes the outermost shell and that has a stable octet. The nucleus of this atom still has 11 protons but the number of electrons has become 10, so there is a net positive charge giving us a sodium cation Na<sup>+</sup> . On the other hand chlorine has seven electrons in its outermost shell\n\n| Type of<br>element | Element        | Atomic<br>number | Number of<br>electrons in shells |   |   |   |\n|--------------------|----------------|------------------|----------------------------------|---|---|---|\n|                    |                |                  | K                                | L | M | N |\n| Noble gases        | Helium (He)    | 2                | 2                                |   |   |   |\n|                    | Neon (Ne)      | 10               | 2                                | 8 |   |   |\n|                    | Argon (Ar)     | 18               | 2                                | 8 | 8 |   |\n| Metals             | Sodium (Na)    | 11               | 2                                | 8 | 1 |   |\n|                    | Magnesium (Mg) | 12               | 2                                | 8 | 2 |   |\n|                    | Aluminium (Al) | 13               | 2                                | 8 | 3 |   |\n|                    | Potassium (K)  | 19               | 2                                | 8 | 8 | 1 |\n|                    | Calcium (Ca)   | 20               | 2                                | 8 | 8 | 2 |\n| Non-metals         | Nitrogen (N)   | 7                | 2                                | 5 |   |   |\n|                    | Oxygen (O)     | 8                | 2                                | 6 |   |   |\n|                    | Fluorine (F)   | 9                | 2                                | 7 |   |   |\n|                    | Phosphorus (P) | 15               | 2                                | 8 | 5 |   |\n|                    | Sulphur (S)    | 16               | 2                                | 8 | 6 |   |\n|                    | Chlorine (Cl)  | 17               | 2                                | 8 | 7 |   |\n\nTable 3.3 Electronic configurations of some elements\n\nand it requires one more electron to complete its octet. If sodium and chlorine were to react, the electron lost by sodium could be taken up by chlorine. After gaining an electron, the chlorine atom gets a unit negative charge, because its nucleus has 17 protons and there are 18 electrons in its K, L and M shells. This gives us a chloride anion C1– . So both these elements can have a give-and-take relation between them as follows (Fig. 3.5).\n\n![](_page_10_Figure_3.jpeg)\n\n*Figure 3.5 Formation of sodium chloride*\n\nSodium and chloride ions, being oppositely charged, attract each other and are held by strong electrostatic forces of attraction to exist as sodium chloride (NaCl). It should be noted that sodium chloride does not exist as molecules but aggregates of oppositely charged ions.\n\nLet us see the formation of one more ionic compound, magnesium chloride (Fig. 3.6).\n\n![](_page_11_Figure_0.jpeg)\n\n*Figure 3.6 Formation of magnesium chloride*\n\nThe compounds formed in this manner by the transfer of electrons from a metal to a non-metal are known as ionic compounds or electrovalent compounds. Can you name the cation and anion present in MgCl<sup>2</sup> ?\n\n#### 3.3.1 Properties of Ionic Compounds\n\nTo learn about the properties of ionic compounds, let us perform the following Activity:\n\n![](_page_11_Figure_5.jpeg)\n\n*Figure 3.8 Testing the conductivity of a salt solution*\n\n| Table 3.4 Melting and boiling points of some ionic compounds |  |  |  |\n|--------------------------------------------------------------|--|--|--|\n|--------------------------------------------------------------|--|--|--|\n\n| Ionic<br>compound | Melting point<br>(K) | Boiling point<br>(K) |\n|-------------------|----------------------|----------------------|\n| NaCl              | 1074                 | 1686                 |\n| LiCl              | 887                  | 1600                 |\n| CaCl2             | 1045                 | 1900                 |\n| CaO               | 2850                 | 3120                 |\n| MgCl2             | 981                  | 1685                 |\n\n*Figure 3.7*\n\n*spatula*\n\nYou may have observed the following general properties for ionic compounds—\n\n- (i) *Physical nature*: Ionic compounds are solids and are somewhat hard because of the strong force of attraction between the positive and negative ions. These compounds are generally brittle and break into pieces when pressure is applied.\n- (ii) *Melting and Boiling points*: Ionic compounds have high melting and boiling points (see Table 3.4). This is because a considerable amount of energy is required to break the strong inter-ionic attraction.\n- (iii) *Solubility*: Electrovalent compounds are generally soluble in water and insoluble in solvents such as kerosene, petrol, etc.\n- (iv) *Conduction of Electricity*: The conduction of electricity through a solution involves the movement of charged particles. A solution of an ionic compound in water contains ions, which move to the opposite electrodes when electricity is passed through the solution. Ionic compounds in the solid state do not conduct electricity because movement of ions in the solid is not possible due to their rigid structure. But ionic compounds conduct electricity in the molten state. This is possible in the molten state since the elecrostatic forces of attraction between the oppositely charged ions are overcome due to the heat. Thus, the ions move freely and conduct electricity.\n\n# QUESTIONS\n\n- 1. (i) Write the electron-dot structures for sodium, oxygen and magnesium.\n  - (ii) Show the formation of Na2O and MgO by the transfer of electrons.\n  - (iii) What are the ions present in these compounds?\n- 2. Why do ionic compounds have high melting points?\n\n## 3.4 OCCURRENCE OF METALS\n\nThe earth's crust is the major source of metals. Seawater also contains some soluble salts such as sodium chloride, magnesium chloride, etc. The elements or compounds, which occur naturally in the earth's crust, are known as minerals. At some places, minerals contain a very high percentage of a particular metal and the metal can be profitably extracted from it. These minerals are called ores.\n\n#### 3.4.1 Extraction of Metals\n\nYou have learnt about the reactivity series of metals. Having this knowledge, you can easily understand how a metal is extracted from its ore. Some metals are found in the earth's crust in the free state. Some are found in the form of their compounds. The metals at the bottom of the activity series are the least reactive. They are often found in a free ?\n\nK Na Ca Mg Al Zn Fe Pb Cu Ag Au Reduction using carbon Found in native state Electrolysis\n\n#### *Figure 3.9*\n\n*Activity series and related metallurgy*\n\nstate. For example, gold, silver, platinum and copper are found in the free state. Copper and silver are also found in the combined state as their sulphide or oxide ores. The metals at the top of the activity series (K, Na, Ca, Mg and Al) are so reactive that they are never found in nature as free elements. The metals in the middle of the activity series (Zn, Fe, Pb, etc.) are moderately reactive. They are found in the earth's crust mainly as oxides, sulphides or carbonates. You will find that the ores of many metals are oxides. This is because oxygen is a very reactive element and is very abundant on the earth.\n\nThus on the basis of reactivity, we can group the metals into the following three categories (Fig. 3.9) – (i) Metals of low reactivity; (ii) Metals of medium reactivity; (iii) Metals of high reactivity. Different techniques are to be used for obtaining the metals falling in each category.\n\nSeveral steps are involved in the extraction of pure metal from ores. A summary of these steps is given in Fig.3.10. Each step is explained in detail in the following sections.\n\n![](_page_13_Figure_6.jpeg)\n\n#### *Figure 3.10 Steps involved in the extraction of metals from ores*\n\n#### 3.4.2 Enrichment of Ores\n\nOres mined from the earth are usually contaminated with large amounts of impurities such as soil, sand, etc., called gangue. The impurities must be removed from the ore prior to the extraction of the metal. The processes used for removing the gangue from the ore are based on the differences between the physical or chemical properties of the gangue and the ore. Different separation techniques are accordingly employed.\n\n#### 3.4.3 Extracting Metals Low in the Activity Series\n\nMetals low in the activity series are very unreactive. The oxides of these metals can be reduced to metals by heating alone. For example, cinnabar (HgS) is an ore of mercury. When it is heated in air, it is first converted into mercuric oxide (HgO). Mercuric oxide is then reduced to mercury on further heating.\n\n#### 2HgS(s) + 3O (g) 2HgO(s) + 2SO (g) <sup>2</sup> <sup>2</sup> → Heat\n\n2HgO(s) 2Hg(l) + O (g) <sup>2</sup> → Heat\n\nSimilarly, copper which is found as Cu<sup>2</sup> S in nature can be obtained from its ore by just heating in air.\n\n2Cu S + 3O (g) 2Cu O(s) + 2SO (g) 2Cu O + Cu S 2 2 2 2 2 2 Heat Heat → → 6Cu(s) + SO (g) <sup>2</sup>\n\n#### 3.4.4 Extracting Metals in the Middle of the Activity Series\n\nThe metals in the middle of the activity series such as iron, zinc, lead, copper, are moderately reactive. These are usually present as sulphides or carbonates in nature. It is easier to obtain a metal from its oxide, as compared to its sulphides and carbonates. Therefore, prior to reduction, the metal sulphides and carbonates must be converted into metal oxides. The sulphide ores are converted into oxides by heating strongly in the presence of excess air. This process is known as roasting. The carbonate ores are changed into oxides by heating strongly in limited air. This process is known as calcination. The chemical reaction that takes place during roasting and calcination of zinc ores can be shown as follows –\n\nRoasting\n\n2ZnS(s) + 3O (g) 2ZnO(s) + 2SO (g) <sup>2</sup> <sup>2</sup> →Heat\n\nCalcination\n\n#### ZnCO (s) ZnO(s) + CO (g) <sup>3</sup> <sup>2</sup> → Heat\n\nThe metal oxides are then reduced to the corresponding metals by using suitable reducing agents such as carbon. For example, when zinc oxide is heated with carbon, it is reduced to metallic zinc.\n\n#### ZnO(s) + C(s) → Zn(s) + CO(g)\n\nYou are already familiar with the process of oxidation and reduction explained in the first Chapter. Obtaining metals from their compounds is also a reduction process.\n\nBesides using carbon (coke) to reduce metal oxides to metals, sometimes displacement reactions can also be used. The highly reactive metals such as sodium, calcium, aluminium, etc., are used as reducing agents because they can displace metals of lower reactivity from their compounds. For example, when manganese dioxide is heated with aluminium powder, the following reaction takes place –\n\n#### 3MnO<sup>2</sup> (s) + 4Al(s) → 3Mn(l) + 2Al2O<sup>3</sup> (s) + Heat\n\n![](_page_15_Picture_2.jpeg)\n\nand reduced? These displacement reactions are highly exothermic. The\n\nCan you identify the substances that are getting oxidised\n\namount of heat evolved is so large that the metals are produced in the molten state. In fact, the reaction of iron(III) oxide (Fe2O<sup>3</sup> ) with aluminium is used to join railway tracks or cracked machine parts. This reaction is known as the thermit reaction.\n\nFe2O<sup>3</sup> (s) + 2Al(s) → 2Fe(l) + Al2O<sup>3</sup> (s) + Heat\n\n### 3.4.5 Extracting Metals towards the Top of the Activity Series\n\n*Figure 3.11 Thermit process for joining railway tracks*\n\nThe metals high up in the reactivity series are very reactive. They cannot be obtained from their compounds by heating with carbon. For example, carbon cannot reduce the oxides of sodium, magnesium, calcium, aluminium, etc., to the respective metals. This is because these metals have more affinity for oxygen than carbon. These metals are obtained by electrolytic reduction. For example, sodium, magnesium and calcium are obtained by the electrolysis of their molten chlorides. The metals are deposited at the cathode (the negatively charged electrode), whereas, chlorine is liberated at the anode (the positively charged electrode). The reactions are –\n\n#### At cathode Na+ + e– → Na At anode 2Cl– <sup>→</sup> Cl<sup>2</sup> + 2e–\n\nSimilarly, aluminium is obtained by the electrolytic reduction of aluminium oxide.\n\n![](_page_15_Figure_11.jpeg)\n\n3.4.6 Refining of Metals\n\nThe metals produced by various reduction processes described above are not very pure. They contain impurities, which must be removed to obtain pure metals. The most widely used method for refining impure metals is electrolytic refining.\n\n*Electrolytic Refining:* Many metals, such as copper, zinc, tin, nickel, silver, gold, etc., are refined electrolytically. In this process, the impure metal is made the anode and a thin strip of pure metal is made the cathode. A solution of the metal salt is used as an electrolyte. The apparatus is set up as shown in Fig. 3.12. On passing the current through the electrolyte, the pure metal from the anode dissolves into the electrolyte. An equivalent amount of pure\n\n#### *Figure 3.12*\n\n*Electrolytic refining of copper. The electrolyte is a solution of acidified copper sulphate. The anode is impure copper, whereas, the cathode is a strip of pure copper. On passing electric current, pure copper is deposited on the cathode.*\n\nmetal from the electrolyte is deposited on the cathode. The soluble impurities go into the solution, whereas, the insoluble impurities settle down at the bottom of the anode and are known as anode mud.\n\n![](_page_16_Figure_1.jpeg)\n\n### 3.5 CORROSION\n\nYou have learnt the following about corrosion in Chapter 1 –\n\n- n Silver articles become black after some time when exposed to air. This is because it reacts with sulphur in the air to form a coating of silver sulphide.\n- n Copper reacts with moist carbon dioxide in the air and slowly loses its shiny brown surface and gains a green coat. This green substance is basic copper carbonate.\n- n Iron when exposed to moist air for a long time acquires a coating of a brown flaky substance called rust.\n\nLet us find out the conditions under which iron rusts.\n\n### Activity 3.14\n\n- n Take three test tubes and place clean iron nails in each of them.\n- n Label these test tubes A, B and C. Pour some water in test tube A and cork it.\n- n Pour boiled distilled water in test tube B, add about 1 mL of oil and cork it. The oil will float on water and prevent the air from dissolving in the water.\n- n Put some anhydrous calcium chloride in test tube C and cork it. Anhydrous calcium chloride will absorb the moisture, if any, from the air. Leave these test tubes for a few days and then observe (Fig. 3.13).\n\nYou will observe that iron nails rust in test tube A, but they do not rust in test tubes B and C. In the test tube A, the nails are exposed to both air and water. In the test tube B, the nails are exposed to only water, and the nails in test tube C are exposed to dry air. What does this tell us about the conditions under which iron articles rust?\n\n![](_page_16_Figure_14.jpeg)\n\n#### *Figure 3.13*\n\n*Investigating the conditions under which iron rusts. In tube A, both air and water are present. In tube B, there is no air dissolved in the water. In tube C, the air is dry.*\n\n#### 3.5.1 Prevention of Corrosion\n\nThe rusting of iron can be prevented by painting, oiling, greasing, galvanising, chrome plating, anodising or making alloys.\n\nGalvanisation is a method of protecting steel and iron from rusting by coating them with a thin layer of zinc. The galvanised article is protected against rusting even if the zinc coating is broken. Can you reason this out?\n\nAlloying is a very good method of improving the properties of a metal. We can get the desired properties by this method. For example, iron is the most widely used metal. But it is never used in its pure state. This is because pure iron is very soft and stretches easily when hot. But, if it is mixed with a small amount of carbon (about 0.05 %), it becomes hard and strong. When iron is mixed with nickel and chromium, we get stainless steel, which is hard and does not rust. Thus, if iron is mixed with some other substance, its properties change. In fact, the properties of any metal can be changed if it is mixed with some other substance. The substance added may be a metal or a non-metal. An alloy is a homogeneous mixture of two or more metals, or a metal and a nonmetal. It is prepared by first melting the primary metal, and then, dissolving the other elements in it in definite proportions. It is then cooled to room temperature.\n\nPure gold, known as 24 carat gold, is very soft. It is, therefore, not suitable for making jewellery. It is alloyed with either silver or copper to make it hard. Generally, in India, 22 carat gold is used for making ornaments. It means that 22 parts of pure gold is alloyed with 2 parts of either copper or silver.\n\n![](_page_17_Picture_6.jpeg)\n\n*Iron pillar at Delhi*\n\n<sup>54</sup> Science Do You Know? If one of the metals is mercury, then the alloy is known as an amalgam. The electrical conductivity and melting point of an alloy is less than that of pure metals. For example, brass, an alloy of copper and zinc (Cu and Zn), and bronze, an alloy of copper and tin (Cu and Sn), are not good conductors of electricity whereas copper is used for making electrical circuits. Solder, an alloy of lead and tin (Pb and Sn), has a low melting point and is used for welding electrical wires together.\n\n## The wonder of ancient Indian metallurgy\n\nThe iron pillar near the Qutub Minar in Delhi was built more than 1600 years ago by the iron workers of India. They had developed a process which prevented iron from rusting. For its quality of rust resistance it has been examined by scientists from all parts of the world. The iron pillar is 8 m high and weighs 6 tonnes (6000 kg).\n\n# QUESTIONS\n\n1. Metallic oxides of zinc, magnesium and copper were heated with the following metals.\n\n| Metal           | Zinc | Magnesium | Copper |\n|-----------------|------|-----------|--------|\n| Zinc oxide      |      |           |        |\n| Magnesium oxide |      |           |        |\n| Copper oxide    |      |           |        |\n\nIn which cases will you find displacement reactions taking place?\n\n- 2. Which metals do not corrode easily?\n- 3. What are alloys?\n\n# What you have learnt\n\n- n Elements can be classified as metals and non-metals.\n- n Metals are lustrous, malleable, ductile and are good conductors of heat and electricity. They are solids at room temperature, except mercury which is a liquid.\n- n Metals can form positive ions by losing electrons to non-metals.\n- n Metals combine with oxygen to form basic oxides. Aluminium oxide and zinc oxide show the properties of both basic as well as acidic oxides. These oxides are known as amphoteric oxides.\n- n Different metals have different reactivities with water and dilute acids.\n- n A list of common metals arranged in order of their decreasing reactivity is known as an activity series.\n- n Metals above hydrogen in the Activity series can displace hydrogen from dilute acids.\n- n A more reactive metal displaces a less reactive metal from its salt solution.\n- n Metals occur in nature as free elements or in the form of their compounds.\n- n The extraction of metals from their ores and then refining them for use is known as metallurgy.\n- n An alloy is a homogeneous mixture of two or more metals, or a metal and a non-metal.\n- n The surface of some metals, such as iron, is corroded when they are exposed to moist air for a long period of time. This phenomenon is known as corrosion.\n- n Non-metals have properties opposite to that of metals. They are neither malleable nor ductile. They are bad conductors of heat and electricity, except for graphite, which conducts electricity.\n\n?\n\n- n Non-metals form negatively charged ions by gaining electrons when reacting with metals.\n- n Non-metals form oxides which are either acidic or neutral.\n- n Non-metals do not displace hydrogen from dilute acids. They react with hydrogen to form hydrides.\n\n# EXERCISES\n\n- 1. Which of the following pairs will give displacement reactions?\n  - (a) NaCl solution and copper metal\n  - (b) MgCl<sup>2</sup> solution and aluminium metal\n  - (c) FeSO<sup>4</sup> solution and silver metal\n  - (d) AgNO<sup>3</sup> solution and copper metal.\n- 2. Which of the following methods is suitable for preventing an iron frying pan from rusting?\n  - (a) Applying grease\n  - (b) Applying paint\n  - (c) Applying a coating of zinc\n  - (d) All of the above.\n- 3. An element reacts with oxygen to give a compound with a high melting point. This compound is also soluble in water. The element is likely to be\n  - (a) calcium\n  - (b) carbon\n  - (c) silicon\n  - (d) iron.\n- 4. Food cans are coated with tin and not with zinc because\n  - (a) zinc is costlier than tin.\n  - (b) zinc has a higher melting point than tin.\n  - (c) zinc is more reactive than tin.\n  - (d) zinc is less reactive than tin.\n- 5. You are given a hammer, a battery, a bulb, wires and a switch.\n  - (a) How could you use them to distinguish between samples of metals and non-metals?\n  - (b) Assess the usefulness of these tests in distinguishing between metals and non-metals.\n- 6. What are amphoteric oxides? Give two examples of amphoteric oxides.\n- 7. Name two metals which will displace hydrogen from dilute acids, and two metals which will not.\n\n- 8. In the electrolytic refining of a metal M, what would you take as the anode, the cathode and the electrolyte?\n- 9. Pratyush took sulphur powder on a spatula and heated it. He collected the gas evolved by inverting a test tube over it, as shown in figure below.\n  - (a) What will be the action of gas on\n    - (i) dry litmus paper? (ii) moist litmus paper?\n  - (b) Write a balanced chemical equation for the reaction taking place.\n- 10. State two ways to prevent the rusting of iron.\n- 11. What type of oxides are formed when non-metals combine with oxygen?\n- 12. Give reasons\n  - (a) Platinum, gold and silver are used to make jewellery.\n  - (b) Sodium, potassium and lithium are stored under oil.\n  - (c) Aluminium is a highly reactive metal, yet it is used to make utensils for cooking.\n  - (d) Carbonate and sulphide ores are usually converted into oxides during the process of extraction.\n\n![](_page_20_Figure_12.jpeg)\n\n- 13. You must have seen tarnished copper vessels being cleaned with lemon or tamarind juice. Explain why these sour substances are effective in cleaning the vessels.\n- 14. Differentiate between metal and non-metal on the basis of their chemical properties.\n- 15. A man went door to door posing as a goldsmith. He promised to bring back the glitter of old and dull gold ornaments. An unsuspecting lady gave a set of gold bangles to him which he dipped in a particular solution. The bangles sparkled like new but their weight was reduced drastically. The lady was upset but after a futile argument the man beat a hasty retreat. Can you play the detective to find out the nature of the solution he had used?\n- 16. Give reasons why copper is used to make hot water tanks and not steel (an alloy of iron).",
        "structured_data": {
            "error": "No structured data available"
        },
        "images": [
            {
                "name": "_page_0_Picture_0.jpeg",
                "path": "/home/content/converted_books/images/jesc103/_page_0_Picture_0.jpeg",
                "size_bytes": 4823,
                "description": "This image shows the chapter heading \"CHAPTER 3\" in purple text, serving as the title page or section divider for the third chapter of a science textbook. The chapter appears to focus on the classification and properties of metals and non-metals, as indicated by the surrounding text that discusses distinguishing between these types of elements based on their physical properties.",
                "description_generated_at": "2025-07-19 12:19:20"
            },
            {
                "name": "_page_0_Picture_1.jpeg",
                "path": "/home/content/converted_books/images/jesc103/_page_0_Picture_1.jpeg",
                "size_bytes": 17334,
                "description": "This image shows the chapter title \"Metals and Non-metals\" in large blue text, accompanied by a simple illustration of what appears to be a test tube or beaker on the left side. This serves as the opening header for a chemistry chapter that will explore the properties and classification of metallic and non-metallic elements.",
                "description_generated_at": "2025-07-19 12:19:20"
            },
            {
                "name": "_page_0_Picture_2.jpeg",
                "path": "/home/content/converted_books/images/jesc103/_page_0_Picture_2.jpeg",
                "size_bytes": 11124,
                "description": "This image shows a QR code labeled \"1064CH03\" that students can scan to access additional digital resources related to Chapter 3 on metals and non-metals. The QR code serves as a quick link to supplementary online materials that support the textbook's content on the physical and chemical properties of elements.",
                "description_generated_at": "2025-07-19 12:19:20"
            },
            {
                "name": "_page_1_Figure_12.jpeg",
                "path": "/home/content/converted_books/images/jesc103/_page_1_Figure_12.jpeg",
                "size_bytes": 68116,
                "description": "This diagram shows the experimental setup for Activity 3.5, which demonstrates heat conduction in metals by heating a metal wire (aluminum or copper) clamped to a stand with a pin attached using wax at the free end. The activity tests whether metals are good conductors of heat by observing if the heat from the burner travels through the wire and melts the wax, causing the pin to fall.",
                "description_generated_at": "2025-07-19 12:19:20"
            },
            {
                "name": "_page_2_Figure_18.jpeg",
                "path": "/home/content/converted_books/images/jesc103/_page_2_Figure_18.jpeg",
                "size_bytes": 18246,
                "description": "This diagram shows a simple electrical circuit used to test the conductivity of materials, consisting of a battery, bulb, switch, and clips (labeled A and B) where a sample material can be inserted for testing. The setup demonstrates how to determine whether different elements are good or poor conductors of electricity by observing if the bulb lights up when the circuit is completed through the test material.",
                "description_generated_at": "2025-07-19 12:19:20"
            },
            {
                "name": "_page_3_Picture_16.jpeg",
                "path": "/home/content/converted_books/images/jesc103/_page_3_Picture_16.jpeg",
                "size_bytes": 54069,
                "description": "This image shows a \"Questions\" section from the science textbook with a purple header and decorative question mark. It contains two practice questions that test students' understanding of metal properties, including identifying specific metals based on their characteristics (liquid at room temperature, conductivity, etc.) and explaining key terms like malleable and ductile.",
                "description_generated_at": "2025-07-19 12:19:20"
            },
            {
                "name": "_page_6_Figure_0.jpeg",
                "path": "/home/content/converted_books/images/jesc103/_page_6_Figure_0.jpeg",
                "size_bytes": 54611,
                "description": "This diagram shows the experimental setup for testing how metals react with steam, featuring a burner heating glass-wool soaked in water to produce steam that passes over a metal sample, with any hydrogen gas produced being collected in an inverted test tube filled with water. The apparatus demonstrates how to safely observe metal-steam reactions for metals that don't react with cold or hot water, allowing students to study different levels of metal reactivity.",
                "description_generated_at": "2025-07-19 12:19:20"
            },
            {
                "name": "_page_10_Figure_3.jpeg",
                "path": "/home/content/converted_books/images/jesc103/_page_10_Figure_3.jpeg",
                "size_bytes": 18799,
                "description": "This diagram illustrates the formation of sodium chloride (NaCl) through ionic bonding, showing how a sodium atom loses one electron to become a Na⁺ cation while a chlorine atom gains that electron to become a Cl⁻ anion. The image displays the electron transfer process with electronic configurations (2,8,1 for Na and 2,8,7 for Cl) and uses crosses to represent the transferred electron in the final ionic compound.",
                "description_generated_at": "2025-07-19 12:19:20"
            },
            {
                "name": "_page_11_Figure_0.jpeg",
                "path": "/home/content/converted_books/images/jesc103/_page_11_Figure_0.jpeg",
                "size_bytes": 21263,
                "description": "This diagram illustrates the formation of magnesium chloride (MgCl₂) through ionic bonding, showing how a magnesium atom loses 2 electrons to become a Mg²⁺ cation while two chlorine atoms each gain 1 electron to become Cl⁻ anions. The image includes electron shell configurations and a visual representation of the electron transfer process that creates this ionic compound.",
                "description_generated_at": "2025-07-19 12:19:20"
            },
            {
                "name": "_page_11_Figure_5.jpeg",
                "path": "/home/content/converted_books/images/jesc103/_page_11_Figure_5.jpeg",
                "size_bytes": 150583,
                "description": "This image shows Activity 3.13, which includes two experimental setups for testing properties of ionic compounds: a Bunsen burner with a spatula for heating salt samples to observe flame colors and melting behavior, and a simple electrical circuit with electrodes in a salt solution to test electrical conductivity. The activity is designed to help students experimentally investigate key properties of ionic compounds such as their solubility, conductivity, and thermal behavior.",
                "description_generated_at": "2025-07-19 12:19:20"
            },
            {
                "name": "_page_13_Figure_6.jpeg",
                "path": "/home/content/converted_books/images/jesc103/_page_13_Figure_6.jpeg",
                "size_bytes": 52107,
                "description": "This flowchart diagram illustrates the complete process of metal extraction from ores, showing three different pathways based on metal reactivity levels (high, medium, and low). The diagram uses arrows and labeled boxes to demonstrate how different types of ores undergo specific processes like electrolysis, calcination, roasting, and reduction to ultimately produce pure metals.",
                "description_generated_at": "2025-07-19 12:19:20"
            },
            {
                "name": "_page_15_Picture_2.jpeg",
                "path": "/home/content/converted_books/images/jesc103/_page_15_Picture_2.jpeg",
                "size_bytes": 33835,
                "description": "This image shows a worker performing the thermit process to join railway tracks, where a highly exothermic reaction between iron oxide and aluminum produces molten iron and intense heat. The photograph illustrates the practical industrial application of displacement reactions discussed in the text, demonstrating how reactive metals like aluminum can be used to extract less reactive metals from their compounds.",
                "description_generated_at": "2025-07-19 12:19:20"
            },
            {
                "name": "_page_15_Figure_11.jpeg",
                "path": "/home/content/converted_books/images/jesc103/_page_15_Figure_11.jpeg",
                "size_bytes": 21939,
                "description": "This diagram illustrates the electrolytic refining process for copper, showing a tank containing acidified copper sulphate solution with an impure copper anode and pure copper cathode connected to a power source. The diagram demonstrates how Cu²⁺ ions move through the electrolyte while impurities settle at the bottom, effectively purifying the metal through electrolysis.",
                "description_generated_at": "2025-07-19 12:19:20"
            },
            {
                "name": "_page_16_Figure_1.jpeg",
                "path": "/home/content/converted_books/images/jesc103/_page_16_Figure_1.jpeg",
                "size_bytes": 51421,
                "description": "This image shows a \"Questions\" section from the textbook with three practice questions about metals and their extraction. The questions ask students to define key terms (mineral, ore, gangue), identify metals found in free state in nature, and explain the chemical process for obtaining metals from oxides.",
                "description_generated_at": "2025-07-19 12:19:20"
            },
            {
                "name": "_page_16_Figure_14.jpeg",
                "path": "/home/content/converted_books/images/jesc103/_page_16_Figure_14.jpeg",
                "size_bytes": 41248,
                "description": "This diagram shows three labeled test tubes (A, B, and C) containing iron nails under different conditions to investigate rusting: tube A has both air and water present (showing rusty nails), tube B contains boiled distilled water with an oil layer to prevent air contact, and tube C contains dry air with anhydrous calcium chloride as a drying agent. The experiment demonstrates that iron only rusts when both air and water are present together, as evidenced by the rusty nails visible only in tube A.",
                "description_generated_at": "2025-07-19 12:19:20"
            },
            {
                "name": "_page_17_Picture_6.jpeg",
                "path": "/home/content/converted_books/images/jesc103/_page_17_Picture_6.jpeg",
                "size_bytes": 25268,
                "description": "This image shows the famous Iron Pillar at Delhi, a tall dark metal column standing among ancient stone ruins near the Qutub Minar. The pillar serves as an example of ancient Indian metallurgy that demonstrates how iron can be treated to resist rusting for over 1600 years, illustrating the practical applications of metal alloys and treatments discussed in the chapter.",
                "description_generated_at": "2025-07-19 12:19:20"
            },
            {
                "name": "_page_20_Figure_12.jpeg",
                "path": "/home/content/converted_books/images/jesc103/_page_20_Figure_12.jpeg",
                "size_bytes": 30383,
                "description": "This diagram shows an experimental setup where sulphur powder on a spatula is being heated over a Bunsen burner, with an inverted test tube held by tongs to collect the gas produced during the reaction. The image illustrates the laboratory method for collecting and studying the properties of sulphur dioxide gas formed when sulphur burns in air.",
                "description_generated_at": "2025-07-19 12:19:20"
            }
        ],
        "exercises": [
            {
                "question": "Think of some uses of metals and non-metals in your daily life.",
                "answer": "Metals: Iron is used in construction and making tools, copper in electrical wires and plumbing, aluminum in cooking utensils and foil, gold and silver in jewelry, zinc in galvanizing iron. Non-metals: Carbon in pencils and fuels, oxygen for breathing and combustion, nitrogen in fertilizers, chlorine for water purification, sulfur in medicines and fertilizers."
            },
            {
                "question": "What properties did you think of while categorising elements as metals or non-metals?",
                "answer": "Physical properties: Metals are lustrous, malleable, ductile, good conductors of heat and electricity, and sonorous. Non-metals are generally dull, brittle, poor conductors (except graphite), and not sonorous. Chemical properties: Metals form basic oxides and lose electrons to form positive ions, while non-metals form acidic oxides and gain electrons to form negative ions."
            },
            {
                "question": "How are these properties related to the uses of these elements?",
                "answer": "Properties directly determine uses: Electrical conductivity makes copper ideal for wires; malleability and ductility allow metals to be shaped into utensils and jewelry; sonorous property makes metals suitable for bells; thermal conductivity makes metals good for cooking vessels; chemical inertness makes gold suitable for jewelry that doesn't tarnish."
            },
            {
                "question": "Why is sodium kept immersed in kerosene oil?",
                "answer": "Sodium is highly reactive and reacts vigorously with oxygen and moisture in air, potentially causing fires. Kerosene oil prevents contact with air and water, keeping sodium safe from oxidation and accidental combustion."
            },
            {
                "question": "Write equations for the reactions of (i) iron with steam (ii) calcium and potassium with water",
                "answer": "(i) Iron with steam: 3Fe(s) + 4H₂O(g) → Fe₃O₄(s) + 4H₂(g)\n(ii) Calcium with water: Ca(s) + 2H₂O(l) → Ca(OH)₂(aq) + H₂(g)\nPotassium with water: 2K(s) + 2H₂O(l) → 2KOH(aq) + H₂(g) + heat energy"
            },
            {
                "question": "Based on the displacement reaction table, (i) Which is the most reactive metal? (ii) What would you observe if B is added to a solution of Copper(II) sulphate? (iii) Arrange the metals A, B, C and D in the order of decreasing reactivity.",
                "answer": "(i) Metal B is the most reactive as it displaces iron from iron(II) sulfate.\n(ii) B would displace copper from copper(II) sulfate solution, forming a coating of copper on metal B and the solution would change color.\n(iii) Order of decreasing reactivity: B > A > C > D (B displaces iron, A displaces copper and silver, C only displaces silver, D displaces nothing)"
            },
            {
                "question": "Which gas is produced when dilute hydrochloric acid is added to a reactive metal? Write the chemical reaction when iron reacts with dilute H₂SO₄.",
                "answer": "Hydrogen gas is produced when dilute hydrochloric acid reacts with reactive metals.\nReaction: Fe(s) + H₂SO₄(aq) → FeSO₄(aq) + H₂(g)\nThis is a displacement reaction where iron displaces hydrogen from the acid."
            },
            {
                "question": "What would you observe when zinc is added to a solution of iron(II) sulphate? Write the chemical reaction that takes place.",
                "answer": "Zinc would displace iron from iron(II) sulfate solution. We would observe iron metal depositing on zinc and the solution changing from green to colorless.\nReaction: Zn(s) + FeSO₄(aq) → ZnSO₄(aq) + Fe(s)\nThis occurs because zinc is more reactive than iron according to the reactivity series."
            },
            {
                "question": "(i) Write the electron-dot structures for sodium, oxygen and magnesium. (ii) Show the formation of Na₂O and MgO by the transfer of electrons. (iii) What are the ions present in these compounds?",
                "answer": "(i) Sodium has 1 valence electron, oxygen has 6 valence electrons, magnesium has 2 valence electrons.\n(ii) Na₂O formation: Two sodium atoms each lose 1 electron to oxygen atom. MgO formation: Magnesium loses 2 electrons to oxygen atom.\n(iii) In Na₂O: Na⁺ and O²⁻ ions. In MgO: Mg²⁺ and O²⁻ ions."
            },
            {
                "question": "Why do ionic compounds have high melting points?",
                "answer": "Ionic compounds have high melting points because of strong electrostatic forces of attraction between oppositely charged ions. A considerable amount of energy is required to break these strong inter-ionic attractions and separate the ions, resulting in high melting and boiling points."
            },
            {
                "question": "In which cases will you find displacement reactions taking place when metallic oxides of zinc, magnesium and copper are heated with zinc, magnesium and copper?",
                "answer": "Displacement reactions occur when a more reactive metal displaces a less reactive metal from its oxide. Based on reactivity series (Mg > Zn > Cu):\n- Magnesium will displace zinc from zinc oxide and copper from copper oxide\n- Zinc will displace copper from copper oxide\n- No other combinations will show displacement reactions"
            },
            {
                "question": "Which metals do not corrode easily?",
                "answer": "Metals that do not corrode easily are those low in the reactivity series, particularly noble metals like gold, silver, and platinum. These metals are chemically unreactive and do not readily combine with oxygen or other substances in the environment."
            },
            {
                "question": "What are alloys?",
                "answer": "Alloys are homogeneous mixtures of two or more metals, or a metal and a non-metal. They are prepared by melting the primary metal and dissolving other elements in definite proportions, then cooling to room temperature. Examples include brass (copper + zinc), bronze (copper + tin), and steel (iron + carbon). Alloys often have improved properties compared to pure metals."
            },
            {
                "question": "Which of the following pairs will give displacement reactions? (a) NaCl solution and copper metal (b) MgCl₂ solution and aluminium metal (c) FeSO₄ solution and silver metal (d) AgNO₃ solution and copper metal.",
                "answer": "(d) AgNO₃ solution and copper metal will give displacement reaction. Copper is more reactive than silver according to the reactivity series, so copper will displace silver from silver nitrate solution: Cu + 2AgNO₃ → Cu(NO₃)₂ + 2Ag. The other combinations won't react because the metals are less reactive than those in the solutions."
            },
            {
                "question": "Which of the following methods is suitable for preventing an iron frying pan from rusting? (a) Applying grease (b) Applying paint (c) Applying a coating of zinc (d) All of the above.",
                "answer": "(d) All of the above. All these methods prevent rusting by creating a barrier between iron and the environment (oxygen and moisture). Grease and paint form protective coatings, while zinc coating (galvanization) not only provides a barrier but also acts as a sacrificial metal that corrodes instead of iron."
            },
            {
                "question": "An element reacts with oxygen to give a compound with a high melting point. This compound is also soluble in water. The element is likely to be (a) calcium (b) carbon (c) silicon (d) iron.",
                "answer": "(a) Calcium. When calcium reacts with oxygen, it forms calcium oxide (CaO), which has a high melting point due to ionic bonding. CaO is also soluble in water, forming calcium hydroxide. This matches the description of a metal oxide that is basic in nature."
            },
            {
                "question": "Food cans are coated with tin and not with zinc because (a) zinc is costlier than tin (b) zinc has a higher melting point than tin (c) zinc is more reactive than tin (d) zinc is less reactive than tin.",
                "answer": "(c) Zinc is more reactive than tin. Since food cans contain acidic foods, a more reactive metal like zinc would react with the acids, contaminating the food and corroding the coating. Tin is less reactive and safer for food contact."
            },
            {
                "question": "You are given a hammer, a battery, a bulb, wires and a switch. (a) How could you use them to distinguish between samples of metals and non-metals? (b) Assess the usefulness of these tests in distinguishing between metals and non-metals.",
                "answer": "(a) Use the hammer to test malleability - metals can be beaten into sheets while non-metals break. Use the electrical circuit (battery, bulb, wires, switch) to test conductivity - metals conduct electricity and light the bulb, non-metals don't.\n(b) These tests are quite useful as they test fundamental properties. However, there are exceptions like graphite (non-metal that conducts) and some brittle metals, so multiple tests should be used for accurate identification."
            },
            {
                "question": "What are amphoteric oxides? Give two examples of amphoteric oxides.",
                "answer": "Amphoteric oxides are metal oxides that show both acidic and basic behavior - they react with both acids and bases to form salts and water. Examples: Aluminum oxide (Al₂O₃) and zinc oxide (ZnO). Al₂O₃ + 6HCl → 2AlCl₃ + 3H₂O (acts as base) and Al₂O₃ + 2NaOH → 2NaAlO₂ + H₂O (acts as acid)."
            },
            {
                "question": "Name two metals which will displace hydrogen from dilute acids, and two metals which will not.",
                "answer": "Metals that displace hydrogen from dilute acids: Magnesium and zinc (these are above hydrogen in the reactivity series).\nMetals that will not displace hydrogen: Copper and silver (these are below hydrogen in the reactivity series and are less reactive than hydrogen)."
            },
            {
                "question": "In the electrolytic refining of a metal M, what would you take as the anode, the cathode and the electrolyte?",
                "answer": "Anode: Impure metal M (the metal to be refined)\nCathode: Thin strip of pure metal M\nElectrolyte: Solution of a salt of metal M\nDuring electrolysis, impure metal from anode dissolves into electrolyte, and pure metal deposits on cathode, while impurities settle as anode mud."
            },
            {
                "question": "Pratyush took sulphur powder on a spatula and heated it. He collected the gas evolved by inverting a test tube over it. (a) What will be the action of gas on (i) dry litmus paper? (ii) moist litmus paper? (b) Write a balanced chemical equation for the reaction taking place.",
                "answer": "(a) (i) Dry litmus paper: No change (acidic gases only affect moist litmus)\n(ii) Moist litmus paper: Blue litmus turns red (SO₂ forms acidic solution)\n(b) Chemical equation: S(s) + O₂(g) → SO₂(g)\nSO₂ + H₂O → H₂SO₃ (sulfurous acid)"
            },
            {
                "question": "State two ways to prevent the rusting of iron.",
                "answer": "1. Galvanization: Coating iron with a thin layer of zinc, which acts as a sacrificial metal and prevents iron from rusting.\n2. Painting: Applying paint creates a protective barrier that prevents oxygen and moisture from reaching the iron surface."
            },
            {
                "question": "What type of oxides are formed when non-metals combine with oxygen?",
                "answer": "Non-metals form acidic oxides when they combine with oxygen. These oxides dissolve in water to form acids. Examples: SO₂ forms sulfurous acid (H₂SO₃), CO₂ forms carbonic acid (H₂CO₃), and P₄O₁₀ forms phosphoric acid (H₃PO₄)."
            },
            {
                "question": "Give reasons (a) Platinum, gold and silver are used to make jewellery (b) Sodium, potassium and lithium are stored under oil (c) Aluminium is a highly reactive metal, yet it is used to make utensils for cooking (d) Carbonate and sulphide ores are usually converted into oxides during the process of extraction.",
                "answer": "(a) These metals are unreactive (noble metals), don't corrode or tarnish, maintain their luster, and are malleable for shaping.\n(b) These are highly reactive metals that react vigorously with air and moisture, potentially causing fires. Oil prevents contact with air.\n(c) Aluminum forms a protective oxide layer (Al₂O₃) when exposed to air, preventing further corrosion and making it safe for cooking.\n(d) It's easier to reduce oxides to metals using carbon than to reduce carbonates or sulfides directly. Converting to oxides is an intermediate step in extraction."
            },
            {
                "question": "You must have seen tarnished copper vessels being cleaned with lemon or tamarind juice. Explain why these sour substances are effective in cleaning the vessels.",
                "answer": "Copper vessels develop a layer of basic copper carbonate (green coating) when exposed to moist air. Lemon and tamarind juice contain citric acid and tartaric acid respectively. These acids react with the basic copper carbonate coating, dissolving it and exposing the clean copper surface underneath. The acidic nature neutralizes the basic tarnish."
            },
            {
                "question": "Differentiate between metal and non-metal on the basis of their chemical properties.",
                "answer": "Metals: Form basic oxides, lose electrons to form positive ions (cations), react with acids to produce hydrogen gas, more reactive metals displace less reactive ones from salt solutions, generally have 1-3 valence electrons.\n\nNon-metals: Form acidic oxides, gain electrons to form negative ions (anions), do not displace hydrogen from acids, react with hydrogen to form hydrides, generally have 4-8 valence electrons."
            },
            {
                "question": "A man went door to door posing as a goldsmith. He promised to bring back the glitter of old and dull gold ornaments. An unsuspecting lady gave a set of gold bangles to him which he dipped in a particular solution. The bangles sparkled like new but their weight was reduced drastically. The lady was upset but after a futile argument the man beat a hasty retreat. Can you play the detective to find out the nature of the solution he had used?",
                "answer": "The fraudulent goldsmith used aqua regia (a mixture of concentrated HCl and HNO₃ in 3:1 ratio). Aqua regia is one of the few solutions that can dissolve gold. He dipped the bangles briefly to dissolve the outer layer of gold, making them shiny, but significantly reducing their weight and gold content. This is a common fraud where the dissolved gold is recovered later by the criminal."
            },
            {
                "question": "Give reasons why copper is used to make hot water tanks and not steel (an alloy of iron).",
                "answer": "Copper is preferred over steel for hot water tanks because: (1) Copper is an excellent conductor of heat, allowing efficient heat transfer, (2) Copper is more resistant to corrosion than iron/steel, especially in the presence of water and oxygen, (3) Steel would rust when exposed to water and oxygen, contaminating the water and weakening the tank structure, (4) Copper forms a protective patina that prevents further corrosion."
            }
        ],
        "summary": {
            "title": "Metals and Non-metals",
            "key_concepts": [
                "Physical and chemical properties of metals and non-metals",
                "Reactivity series and displacement reactions",
                "Formation of ionic compounds through electron transfer",
                "Extraction of metals from ores using different methods",
                "Corrosion prevention and alloy formation"
            ],
            "summary": "This chapter explores the fundamental differences between metals and non-metals based on their physical and chemical properties. Metals are characterized by their lustrous appearance, malleability, ductility, and ability to conduct heat and electricity, while non-metals generally exhibit opposite properties. The chapter establishes the reactivity series of metals and explains how more reactive metals can displace less reactive ones from their compounds. It covers the formation of ionic compounds through electron transfer between metals and non-metals, where metals lose electrons to form positive ions and non-metals gain electrons to form negative ions. The extraction of metals from their ores is discussed, showing how different methods are used based on the metal's position in the reactivity series - from simple heating for unreactive metals to electrolysis for highly reactive ones. Finally, the chapter addresses corrosion as a major problem with metals and introduces various prevention methods including galvanization, painting, and alloying to improve metal properties and durability."
        }
    },
    "statistics": {
        "total_images": 17,
        "text_length": 46315,
        "processing_time": 19.2
    },
    "claude_processing": {
        "processed_at": "2025-07-19 12:19:20",
        "model_used": "claude-sonnet-4-20250514",
        "tasks_completed": [
            "exercises",
            "answers",
            "summary",
            "image_descriptions"
        ],
        "exercises_count": 29,
        "images_processed": 17
    }
}