{
    "id": "47887271-a2f5-48e7-868f-6ae975c95e15",
    "title": "Circles",
    "source_file": "/home/content/books/maths/jemh110.pdf",
    "filename": "jemh110.pdf",
    "subject": "maths",
    "conversion_timestamp": "2025-07-18T12:05:30.432229",
    "processing_time_seconds": 8.0,
    "metadata": "md",
    "content": {
        "markdown_text": "![](_page_0_Picture_0.jpeg)\n\n**10**\n\n**CIRCLES**\n\n# **10.1 Introduction**\n\nYou have studied in Class IX that a circle is a collection of all points in a plane which are at a constant distance (radius) from a fixed point (centre). You have also studied various terms related to a circle like chord, segment, sector, arc etc. Let us now examine the different situations that can arise when a circle and a line are given in a plane.\n\nSo, let us consider a circle and a line PQ. There can be three possibilities given in Fig. 10.1 below:\n\n![](_page_0_Figure_4.jpeg)\n\nIn Fig. 10.1 (i), the line PQ and the circle have no common point. In this case, PQ is called a **non-intersecting** line with respect to the circle. In Fig. 10.1 (ii), there are two common points A and B that the line PQ and the circle have. In this case, we call the line PQ a **secant** of the circle. In Fig. 10.1 (iii), there is only one point A which is common to the line PQ and the circle. In this case, the line is called a **tangent** to the circle.\n\nYou might have seen a pulley fitted over a well which is used in taking out water from the well. Look at Fig. 10.2. Here the rope on both sides of the pulley, if considered as a ray, is like a tangent to the circle representing the pulley.\n\nIs there any position of the line with respect to the circle other than the types given above? You can see that there cannot be any other type of position of the line with respect to the circle. In this chapter, we will study about the existence of the tangents to a circle and also study some of their properties.\n\n## **10.2 Tangent to a Circle**\n\nIn the previous section, you have seen that **a tangent\\* to a circle is a line that intersects the circle at only one point**.\n\nTo understand the existence of the tangent to a circle at a point, let us perform the following activities:\n\n**Activity 1 :** Take a circular wire and attach a straight wire AB at a point P of the circular wire so that it can rotate about the point P in a plane. Put the system on a table and gently rotate the wire AB about the point P to get different positions of the straight wire [see Fig. 10.3(i)].\n\nIn various positions, the wire intersects the circular wire at P and at another point Q1 or Q2 or Q3, etc. In one position, you will see that it will intersect the circle at the point P only (see position AB of AB). This shows that a tangent exists at the point P of the circle. On rotating further, you can observe that in all other positions of AB, it will intersect the circle at P and at another point, say R1 or R2 or R3, etc. So, you can observe that **there is only one tangent at a point of the circle**.\n\n![](_page_1_Figure_8.jpeg)\n\nWhile doing activity above, you must have observed that as the position AB moves towards the position A B, the common point, say Q1, of the line AB and the circle gradually comes nearer and nearer to the common point P. Ultimately, it coincides with the point P in the position AB of AB. Again note, what happens if 'AB' is rotated rightwards about P? The common point R3 gradually comes nearer and nearer to P and ultimately coincides with P. So, what we see is:\n\n**The tangent to a circle is a special case of the secant, when the two end points of its corresponding chord coincide**.\n\n**Fig. 10.2**\n\n![](_page_1_Picture_13.jpeg)\n\n<sup>\\*</sup>The word 'tangent' comes from the Latin word 'tangere', which means to touch and was introduced by the Danish mathematician Thomas Fineke in 1583.\n\n**Activity 2 :** On a paper, draw a circle and a secant PQ of the circle. Draw various lines parallel to the secant on both sides of it. You will find that after some steps, the length of the chord cut by the lines will gradually decrease, i.e., the two points of intersection of the line and the circle are coming closer and closer [see Fig. 10.3(ii)]. In one case, it becomes zero on one side of the secant and in another case, it becomes zero on the other side of the secant. See the positions PQ and PQ of the secant in Fig. 10.3 (ii). These are the tangents to the circle parallel to the given secant PQ. This also helps you to see that there cannot be more than two tangents parallel to a given secant.\n\n![](_page_2_Figure_2.jpeg)\n\nThis activity also establishes, what you must have observed, while doing Activity 1, namely, a tangent is the secant when both of the end points of the corresponding chord coincide.\n\nThe common point of the tangent and the circle is called the **point of contact** [the point A in Fig. 10.1 (iii)]and the tangent is said to **touch** the circle at the common point.\n\nNow look around you. Have you seen a bicycle or a cart moving? Look at its wheels. All the spokes of a wheel are along its radii. Now note the position of the wheel with respect to its movement on the ground. Do you see any tangent anywhere? (See Fig. 10.4). In fact, the wheel moves along a line which is a tangent to the circle representing the wheel. Also, notice that in all positions, the radius through the point of contact with the ground appears to be at right angles to the tangent (see Fig. 10.4). We shall now prove this property of the tangent.\n\n![](_page_2_Figure_6.jpeg)\n\n**Fig. 10.4**\n\n**Theorem 10.1 :** *The tangent at any point of a circle is perpendicular to the radius through the point of contact.*\n\n**Proof :** We are given a circle with centre O and a tangent XY to the circle at a point P. We need to prove that OP is perpendicular to XY.\n\n#### CIRCLES 147\n\nTake a point Q on XY other than P and join OQ (see Fig. 10.5).\n\nThe point Q must lie outside the circle. (Why? Note that if Q lies inside the circle, XY will become a secant and not a tangent to the circle). Therefore, OQ is longer than the radius OP of the circle. That is,\n\n$$\nOQ > OP\n$$\n\nSince this happens for every point on the line XY except the point P, OP is the shortest of all the distances of the point O to the points of XY. So OP is perpendicular to XY. (as shown in Theorem A1.7.)\n\n![](_page_3_Figure_5.jpeg)\n\n#### **Remarks**\n\n1. By theorem above, we can also conclude that at any point on a circle there can be one and only one tangent.\n\n2. The line containing the radius through the point of contact is also sometimes called the 'normal' to the circle at the point.\n\n## **EXERCISE 10.1**\n\n- **1.** How many tangents can a circle have?\n- **2.** Fill in the blanks :\n  - (i) A tangent to a circle intersects it in point (s).\n  - (ii) A line intersecting a circle in two points is called a .\n  - (iii) A circle can have parallel tangents at the most.\n  - (iv) The common point of a tangent to a circle and the circle is called .\n- **3.** A tangent PQ at a point P of a circle of radius 5 cm meets a line through the centre O at a point Q so that OQ = 12 cm. Length PQ is :\n\n(A) 12 cm (B) 13 cm (C) 8.5 cm (D) 119 cm.\n\n**4.** Draw a circle and two lines parallel to a given line such that one is a tangent and the other, a secant to the circle.\n\n### **10.3 Number of Tangents from a Point on a Circle**\n\nTo get an idea of the number of tangents from a point on a circle, let us perform the following activity:\n\n**Activity 3 :** Draw a circle on a paper. Take a point P inside it. Can you draw a tangent to the circle through this point? You will find that all the lines through this point intersect the circle in two points. So, it is not possible to draw any tangent to a circle through a point inside it [see Fig. 10.6 (i)].\n\nNext take a point P on the circle and draw tangents through this point. You have already observed that there is only one tangent to the circle at such a point [see Fig. 10.6 (ii)].\n\nFinally, take a point P outside the circle and try to draw tangents to the circle from this point. What do you observe? You will find that you can draw exactly two tangents to the circle through this point [see Fig. 10.6 (iii)].\n\nWe can summarise these facts as follows:\n\n**Case 1 :** There is no tangent to a circle passing through a point lying inside the circle.\n\n**Case 2 :** There is one and only one tangent to a circle passing through a point lying on the circle.\n\n**Case 3 :** There are exactly two tangents to a circle through a point lying outside the circle.\n\nIn Fig. 10.6 (iii), T1 and T2 are the points of contact of the tangents PT1 and PT2 respectively.\n\nThe length of the segment of the tangent from the external point P and the point of contact with the circle is called the **length of the tangent** from the point P to the circle.\n\n![](_page_4_Figure_10.jpeg)\n\n**Fig. 10.6**\n\nNote that in Fig. 10.6 (iii), PT1 and PT2 are the lengths of the tangents from P to the circle. The lengths PT1 and PT2 have a common property. Can you find this? Measure PT1 and PT2 . Are these equal? In fact, this is always so. Let us give a proof of this fact in the following theorem.\n\n#### CIRCLES 149\n\n**Theorem 10.2 :** *The lengths of tangents drawn from an external point to a circle are equal*.\n\n**Proof :** We are given a circle with centre O, a point P lying outside the circle and two tangents PQ, PR on the circle from P (see Fig. 10.7). We are required to prove that PQ = PR.\n\nFor this, we join OP, OQ and OR. Then ∠ OQP and ∠ ORP are right angles, because these are angles between the radii and tangents, and according to Theorem 10.1 they are right angles. Now in right triangles OQP and ORP,\n\n![](_page_5_Figure_4.jpeg)\n\n|            | OQ =<br>OR       | (Radii of the same circle) |\n|------------|------------------|----------------------------|\n|            | OP =<br>OP       | (Common)                   |\n| Therefore, | ∆ OQP ≅<br>∆ ORP | (RHS)                      |\n| This gives | PQ =<br>PR       | (CPCT)                     |\n\n# **Remarks**\n\n1. The theorem can also be proved by using the Pythagoras Theorem as follows:\n\nPQ<sup>2</sup> = OP<sup>2</sup> – OQ<sup>2</sup> = OP<sup>2</sup> – OR<sup>2</sup> = PR<sup>2</sup> (As OQ = OR)\n\nwhich gives PQ = PR.\n\n2. Note also that ∠ OPQ = ∠ OPR. Therefore, OP is the angle bisector of ∠ QPR, i.e., the centre lies on the bisector of the angle between the two tangents.\n\nLet us take some examples.\n\n**Example 1 :** Prove that in two concentric circles, the chord of the larger circle, which touches the smaller circle, is bisected at the point of contact.\n\n**Solution :** We are given two concentric circles C1 and C<sup>2</sup> with centre O and a chord AB of the larger circle C<sup>1</sup> which touches the smaller circle C2 at the point P (see Fig. 10.8). We need to prove that AP = BP.\n\nLet us join OP. Then, AB is a tangent to C<sup>2</sup> at P and OP is its radius. Therefore, by Theorem 10.1,\n\nOP ⊥ AB\n\n![](_page_5_Figure_17.jpeg)\n\nNow AB is a chord of the circle C1 and OP AB. Therefore, OP is the bisector of the chord AB, as the perpendicular from the centre bisects the chord,\n\ni.e., AP = BP\n\n**Example 2 :** Two tangents TP and TQ are drawn to a circle with centre O from an external point T. Prove that PTQ = 2 OPQ.\n\n**Solution :** We are given a circle with centre O, an external point T and two tangents TP and TQ to the circle, where P, Q are the points of contact (see Fig. 10.9). We need to prove that\n\n![](_page_6_Figure_6.jpeg)\n\nPTQ = 2 OPQ\n\nLet PTQ =\n\nNow, by Theorem 10.2, \n$$\nTP = TQ\n$$\n. So,  $TPQ$  is an isosceles triangle.\n\nTherefore, \n$$\n\\angle \\text{TPQ} = \\angle \\text{TQP} = \\frac{1}{2} (180^\\circ - \\theta) = 90^\\circ - \\frac{1}{2} \\theta\n$$\n\nAlso, by Theorem 10.1, OPT = 90°\n\nSo, \n$$\n\\angle OPQ = \\angle OPT - \\angle TPQ = 90^\\circ - \\left(90^\\circ - \\frac{1}{2} \\theta\\right)\n$$\n\n$$\n= \\frac{1}{2} \\theta = \\frac{1}{2} \\angle PTQ\n$$\n\n2\n\nThis gives PTQ = 2 OPQ\n\n**Example 3 :** PQ is a chord of length 8 cm of a circle of radius 5 cm. The tangents at P and Q intersect at a point T (see Fig. 10.10). Find the length TP.\n\n**Solution :** Join OT. Let it intersect PQ at the point R. Then TPQ is isosceles and TO is the angle bisector of PTQ. So, OT PQ and therefore, OT bisects PQ which gives PR = RQ = 4 cm.\n\nAlso, \n$$\nOR = \\sqrt{OP^2 - PR^2} = \\sqrt{5^2 - 4^2}\n$$\n cm = 3 cm.\n\n![](_page_6_Figure_20.jpeg)\n\nNow, TPR + RPO = 90° = TPR + PTR (Why?) So, RPO = PTR\n\nTherefore, right triangle TRP is similar to the right triangle PRO by AA similarity.\n\nThis gives \n$$\n\\frac{\\text{TP}}{\\text{PO}} = \\frac{\\text{RP}}{\\text{RO}}, \\text{ i.e., } \\frac{\\text{TP}}{5} = \\frac{4}{3} \\text{ or TP} = \\frac{20}{3} \\text{ cm}.\n$$\n\n**Note :** TP can also be found by using the Pythagoras Theorem, as follows:\n\nLet \n$$\nTP = x\n$$\n and  $TR = y$ . Then  \n\\n $x^2 = y^2 + 16$  (Taking right  $\\triangle$  PRT) (1)  \n\\n $x^2 + 5^2 = (y + 3)^2$  (Taking right  $\\triangle$  OPT) (2)\n\nSubtracting (1) from (2), we get\n\nTherefore, *x*<sup>2</sup>\n\n25 = 6*y* – 7 or *<sup>y</sup>* = 32 16 6 3 = 2 16 16 16 25 16 (16 9) 39 9 [From (1)] or *<sup>x</sup>*<sup>=</sup> <sup>20</sup>\n\n## **EXERCISE 10.2**\n\nIn Q.1 to 3, choose the correct option and give justification.\n\n3\n\n**1.** From a point Q, the length of the tangent to a circle is 24 cm and the distance of Q from the centre is 25 cm. The radius of the circle is\n\n(A) 7 cm (B) 12 cm\n\n- (C) 15 cm (D) 24.5 cm\n- **2.** In Fig. 10.11, if TP and TQ are the two tangents to a circle with centre O so that POQ = 110°, then PTQ is equal to\n  - (A) 60° (B) 70°\n  - (C) 80° (D) 90°\n- **3.** If tangents PA and PB from a point P to a circle with centre O are inclined to each other at angle of 80°, then POA is equal to\n  - (A) 50° (B) 60°\n  - (C) 70° (D) 80°\n\n![](_page_7_Figure_22.jpeg)\n\n- **4.** Prove that the tangents drawn at the ends of a diameter of a circle are parallel.\n- **5.** Prove that the perpendicular at the point of contact to the tangent to a circle passes through the centre.\n- **6.** The length of a tangent from a point A at distance 5 cm from the centre of the circle is 4 cm. Find the radius of the circle.\n- **7.** Two concentric circles are of radii 5 cm and 3 cm. Find the length of the chord of the larger circle which touches the smaller circle.\n- **8.** A quadrilateral ABCD is drawn to circumscribe a circle (see Fig. 10.12). Prove that\n\n![](_page_8_Figure_6.jpeg)\n\n- **9.** In Fig. 10.13, XY and XY are two parallel tangents to a circle with centre O and another tangent AB with point of contact C intersecting XY at A and XY at B. Prove that AOB = 90°.\n- **10.** Prove that the angle between the two tangents drawn from an external point to a circle is supplementary to the angle subtended by the line-segment joining the points of contact at the centre.\n- **11.** Prove that the parallelogram circumscribing a circle is a rhombus.\n- **12.** A triangle ABC is drawn to circumscribe a circle of radius 4 cm such that the segments BD and DC into which BC is divided by the point of contact D are of lengths 8 cm and 6 cm respectively (see Fig. 10.14). Find the sides AB and AC.\n- **13.** Prove that opposite sides of a quadrilateral circumscribing a circle subtend supplementary angles at the centre of the circle. **Fig. 10.14**\n\n![](_page_8_Figure_12.jpeg)\n\n#### CIRCLES 153\n\n## **10.4 Summary**\n\nIn this chapter, you have studied the following points :\n\n- **1.** The meaning of a tangent to a circle.\n- **2.** The tangent to a circle is perpendicular to the radius through the point of contact.\n- **3.** The lengths of the two tangents from an external point to a circle are equal.",
        "structured_data": {
            "error": "No structured data available"
        },
        "images": [
            {
                "name": "_page_0_Picture_0.jpeg",
                "path": "/home/content/converted_books/images/jemh110/_page_0_Picture_0.jpeg",
                "size_bytes": 15258,
                "description": "This image shows a QR code positioned at the top of Chapter 10 on Circles in a mathematics textbook. The QR code likely provides digital resources or supplementary materials related to the chapter content on circles and their properties.",
                "description_generated_at": "2025-07-19 11:50:40"
            },
            {
                "name": "_page_0_Figure_4.jpeg",
                "path": "/home/content/converted_books/images/jemh110/_page_0_Figure_4.jpeg",
                "size_bytes": 32342,
                "description": "This diagram shows three different positions of a line PQ relative to a circle, labeled as (i), (ii), and (iii). The image illustrates the three possible relationships: a non-intersecting line that doesn't touch the circle, a secant line that intersects the circle at two points (A and B), and a tangent line that touches the circle at exactly one point (A).",
                "description_generated_at": "2025-07-19 11:50:40"
            },
            {
                "name": "_page_1_Figure_8.jpeg",
                "path": "/home/content/converted_books/images/jemh110/_page_1_Figure_8.jpeg",
                "size_bytes": 21353,
                "description": "This diagram shows a circle with multiple straight lines (rays) emanating from point P on the circle, illustrating how a rotating line intersects the circle at different positions - some lines intersect at two points (P and another point like Q₁, Q₂, R₁, etc.) while one special position shows the line touching the circle only at point P. The image demonstrates the concept of a tangent line to a circle, showing that there is exactly one tangent at any given point on the circle.",
                "description_generated_at": "2025-07-19 11:50:40"
            },
            {
                "name": "_page_1_Picture_13.jpeg",
                "path": "/home/content/converted_books/images/jemh110/_page_1_Picture_13.jpeg",
                "size_bytes": 25244,
                "description": "This diagram shows a circle with multiple secant lines passing through it, demonstrating how a secant line intersects the circle at two points (like points B and R₂). The image illustrates the concept that as a secant line moves closer to becoming a tangent, the two intersection points gradually approach each other until they coincide at a single point of tangency.",
                "description_generated_at": "2025-07-19 11:50:40"
            },
            {
                "name": "_page_2_Figure_2.jpeg",
                "path": "/home/content/converted_books/images/jemh110/_page_2_Figure_2.jpeg",
                "size_bytes": 31997,
                "description": "This diagram shows a circle with multiple parallel lines drawn across it, demonstrating how secants gradually become tangents. The lines are labeled with points P, P', P'' on one side and Q, Q', Q'' on the other, illustrating how the chord lengths decrease as the parallel lines move away from the original secant PQ until they eventually touch the circle at just one point (becoming tangents).",
                "description_generated_at": "2025-07-19 11:50:40"
            },
            {
                "name": "_page_2_Figure_6.jpeg",
                "path": "/home/content/converted_books/images/jemh110/_page_2_Figure_6.jpeg",
                "size_bytes": 15768,
                "description": "This diagram shows a bicycle wheel with spokes (radii) touching the ground along a tangent line, with a small square indicating the right angle formed between the radius and the tangent at the point of contact. The image illustrates the real-world application of the mathematical concept that a tangent to a circle is always perpendicular to the radius at the point where they meet.",
                "description_generated_at": "2025-07-19 11:50:40"
            },
            {
                "name": "_page_3_Figure_5.jpeg",
                "path": "/home/content/converted_books/images/jemh110/_page_3_Figure_5.jpeg",
                "size_bytes": 12704,
                "description": "This diagram (Fig. 10.5) shows a circle with center O, a tangent line XY touching the circle at point P, and an additional point Q on the tangent line outside the circle. The diagram illustrates the proof that a tangent is perpendicular to the radius at the point of contact, by showing that OP (the radius) is shorter than OQ (any other line from the center to the tangent).",
                "description_generated_at": "2025-07-19 11:50:40"
            },
            {
                "name": "_page_4_Figure_10.jpeg",
                "path": "/home/content/converted_books/images/jemh110/_page_4_Figure_10.jpeg",
                "size_bytes": 34547,
                "description": "This image shows Figure 10.6 with three diagrams (i), (ii), and (iii) illustrating the different cases of drawing tangents to a circle based on the position of point P. The diagrams demonstrate that no tangents can be drawn from a point inside the circle (i), one tangent from a point on the circle (ii), and exactly two tangents (PT₁ and PT₂) from an external point (iii).",
                "description_generated_at": "2025-07-19 11:50:40"
            },
            {
                "name": "_page_5_Figure_4.jpeg",
                "path": "/home/content/converted_books/images/jemh110/_page_5_Figure_4.jpeg",
                "size_bytes": 12905,
                "description": "This diagram shows a circle with center O and an external point P, from which two tangent lines are drawn to the circle touching at points Q and R. The figure illustrates the geometric setup for proving that tangent lengths from an external point to a circle are equal (PQ = PR), with dashed lines showing the radii OQ and OR and the line segment OP.",
                "description_generated_at": "2025-07-19 11:50:40"
            },
            {
                "name": "_page_5_Figure_17.jpeg",
                "path": "/home/content/converted_books/images/jemh110/_page_5_Figure_17.jpeg",
                "size_bytes": 12795,
                "description": "This diagram shows two concentric circles (circles with the same center O) labeled C₁ (larger) and C₂ (smaller), with a chord AB of the larger circle that is tangent to the smaller circle at point P. The image illustrates the geometric setup for proving that when a chord of a larger circle touches a smaller concentric circle, it is bisected at the point of contact.",
                "description_generated_at": "2025-07-19 11:50:40"
            },
            {
                "name": "_page_6_Figure_6.jpeg",
                "path": "/home/content/converted_books/images/jemh110/_page_6_Figure_6.jpeg",
                "size_bytes": 11495,
                "description": "This diagram shows a circle with center O and two tangent lines drawn from an external point T, touching the circle at points P and Q. The figure illustrates the geometric setup for proving that the angle PTQ equals twice the angle OPQ, demonstrating key properties of tangents drawn from an external point to a circle.",
                "description_generated_at": "2025-07-19 11:50:40"
            },
            {
                "name": "_page_6_Figure_20.jpeg",
                "path": "/home/content/converted_books/images/jemh110/_page_6_Figure_20.jpeg",
                "size_bytes": 15958,
                "description": "This diagram shows a circle with center O and radius 5 cm, where PQ is a chord of length 8 cm, and tangent lines drawn at points P and Q intersect at external point T. The diagram illustrates the geometric setup for calculating the length of the tangent TP, with point R marking where the line from center O to T intersects chord PQ perpendicularly.",
                "description_generated_at": "2025-07-19 11:50:40"
            },
            {
                "name": "_page_7_Figure_22.jpeg",
                "path": "/home/content/converted_books/images/jemh110/_page_7_Figure_22.jpeg",
                "size_bytes": 9884,
                "description": "This diagram shows a circle with center O and two tangent lines TP and TQ drawn from an external point T, where the central angle ∠POQ is marked as 110°. The figure is used to illustrate the geometric relationship between tangent lines and central angles in a circle, specifically for solving problems about the angle between tangents from an external point.",
                "description_generated_at": "2025-07-19 11:50:40"
            },
            {
                "name": "_page_8_Figure_6.jpeg",
                "path": "/home/content/converted_books/images/jemh110/_page_8_Figure_6.jpeg",
                "size_bytes": 33703,
                "description": "The image shows two geometric diagrams (Fig. 10.12 and Fig. 10.13) illustrating circles with tangent lines and circumscribed shapes. Fig. 10.12 demonstrates a quadrilateral ABCD circumscribing a circle with the formula AB + CD = AD + BC shown above, while Fig. 10.13 shows parallel tangents and intersecting lines related to circle geometry problems.",
                "description_generated_at": "2025-07-19 11:50:40"
            },
            {
                "name": "_page_8_Figure_12.jpeg",
                "path": "/home/content/converted_books/images/jemh110/_page_8_Figure_12.jpeg",
                "size_bytes": 14415,
                "description": "This diagram shows triangle ABC circumscribing a circle with center O, where the circle touches side BC at point D, dividing it into segments CD = 6 cm and DB = 8 cm. The figure illustrates the geometric setup for problem 12, which asks students to find the lengths of sides AB and AC using properties of tangents from external points to a circle.",
                "description_generated_at": "2025-07-19 11:50:40"
            }
        ],
        "exercises": [
            {
                "question": "How many tangents can a circle have?",
                "answer": "A circle can have infinitely many tangents. This is because at every point on the circle, exactly one tangent can be drawn, and since a circle has infinitely many points, there are infinitely many possible tangents to a circle."
            },
            {
                "question": "Fill in the blanks: (i) A tangent to a circle intersects it in _____ point(s). (ii) A line intersecting a circle in two points is called a _____. (iii) A circle can have _____ parallel tangents at the most. (iv) The common point of a tangent to a circle and the circle is called _____.",
                "answer": "(i) A tangent to a circle intersects it in **one** point(s). (ii) A line intersecting a circle in two points is called a **secant**. (iii) A circle can have **two** parallel tangents at the most. (iv) The common point of a tangent to a circle and the circle is called **point of contact**."
            },
            {
                "question": "A tangent PQ at a point P of a circle of radius 5 cm meets a line through the centre O at a point Q so that OQ = 12 cm. Length PQ is: (A) 12 cm (B) 13 cm (C) 8.5 cm (D) √119 cm.",
                "answer": "The correct answer is (D) √119 cm. Since PQ is tangent to the circle at P, by Theorem 10.1, OP ⊥ PQ. This forms a right triangle OPQ where OP = 5 cm (radius), OQ = 12 cm, and angle OPQ = 90°. Using Pythagoras theorem: PQ² = OQ² - OP² = 12² - 5² = 144 - 25 = 119. Therefore, PQ = √119 cm."
            },
            {
                "question": "Draw a circle and two lines parallel to a given line such that one is a tangent and the other, a secant to the circle.",
                "answer": "To solve this: 1) Draw a circle with center O. 2) Draw any secant line AB that intersects the circle at two points. 3) Draw a line parallel to AB that touches the circle at exactly one point (tangent). 4) Draw another line parallel to AB that intersects the circle at two points (another secant). The key is that parallel lines to a secant can be positioned at different distances from the circle - closer lines become tangents, while those passing through the circle become secants."
            },
            {
                "question": "From a point Q, the length of the tangent to a circle is 24 cm and the distance of Q from the centre is 25 cm. The radius of the circle is (A) 7 cm (B) 12 cm (C) 15 cm (D) 24.5 cm",
                "answer": "The correct answer is (A) 7 cm. Let the tangent touch the circle at point T, and O be the center. Since QT is tangent, OT ⊥ QT. In right triangle OTQ: OQ² = OT² + QT² (Pythagoras theorem). Given: QT = 24 cm, OQ = 25 cm. So: 25² = OT² + 24², which gives 625 = OT² + 576, therefore OT² = 49, and OT = 7 cm."
            },
            {
                "question": "In Fig. 10.11, if TP and TQ are the two tangents to a circle with centre O so that ∠POQ = 110°, then ∠PTQ is equal to (A) 60° (B) 70° (C) 80° (D) 90°",
                "answer": "The correct answer is (B) 70°. In quadrilateral TPOQ, ∠OPT = ∠OQT = 90° (tangent perpendicular to radius). Sum of angles in quadrilateral = 360°. So: ∠PTQ + ∠POQ + ∠OPT + ∠OQT = 360°. Therefore: ∠PTQ + 110° + 90° + 90° = 360°, which gives ∠PTQ = 360° - 290° = 70°."
            },
            {
                "question": "If tangents PA and PB from a point P to a circle with centre O are inclined to each other at angle of 80°, then ∠POA is equal to (A) 50° (B) 60° (C) 70° (D) 80°",
                "answer": "The correct answer is (A) 50°. Given ∠APB = 80°. Since PA and PB are tangents, ∠OAP = ∠OBP = 90°. In quadrilateral PAOB: ∠APB + ∠AOB + ∠OAP + ∠OBP = 360°. So: 80° + ∠AOB + 90° + 90° = 360°, giving ∠AOB = 100°. Since triangles POA and POB are congruent (by RHS), ∠POA = ∠POB = ∠AOB/2 = 100°/2 = 50°."
            },
            {
                "question": "Prove that the tangents drawn at the ends of a diameter of a circle are parallel.",
                "answer": "Let AB be a diameter of circle with center O. Let tangents at A and B be l₁ and l₂ respectively. Since tangent is perpendicular to radius at point of contact: l₁ ⊥ OA and l₂ ⊥ OB. Since AB is diameter, A, O, B are collinear, so OA and OB are the same straight line. Since both l₁ and l₂ are perpendicular to the same line AB, they must be parallel to each other. Hence, tangents drawn at the ends of a diameter are parallel."
            },
            {
                "question": "Prove that the perpendicular at the point of contact to the tangent to a circle passes through the centre.",
                "answer": "Let tangent PQ touch circle at point T. We need to prove that perpendicular to PQ at T passes through center O. By Theorem 10.1, radius OT is perpendicular to tangent PQ at T. Since there can be only one perpendicular from a point to a line, the perpendicular at T to tangent PQ must be along OT. Therefore, the perpendicular at the point of contact to the tangent passes through the center."
            },
            {
                "question": "The length of a tangent from a point A at distance 5 cm from the centre of the circle is 4 cm. Find the radius of the circle.",
                "answer": "Let the tangent from A touch the circle at point T, and O be the center. Given: OA = 5 cm, AT = 4 cm. Since AT is tangent, ∠OTA = 90°. In right triangle OTA: OA² = OT² + AT² (Pythagoras theorem). So: 5² = OT² + 4², which gives 25 = OT² + 16, therefore OT² = 9, and OT = 3 cm. The radius of the circle is 3 cm."
            },
            {
                "question": "Two concentric circles are of radii 5 cm and 3 cm. Find the length of the chord of the larger circle which touches the smaller circle.",
                "answer": "Let AB be a chord of the larger circle that touches the smaller circle at point P. Since AB is tangent to smaller circle, OP ⊥ AB (where O is common center). For the larger circle, OP is perpendicular from center to chord AB, so P bisects AB. In right triangle OPA: OA = 5 cm (radius of larger circle), OP = 3 cm (radius of smaller circle). Using Pythagoras theorem: AP² = OA² - OP² = 5² - 3² = 25 - 9 = 16. So AP = 4 cm. Since P bisects AB, AB = 2 × AP = 2 × 4 = 8 cm."
            },
            {
                "question": "A quadrilateral ABCD is drawn to circumscribe a circle. Prove that AB + CD = AD + BC.",
                "answer": "When a quadrilateral circumscribes a circle, each side is tangent to the circle. Let the circle touch sides AB, BC, CD, and DA at points P, Q, R, and S respectively. By Theorem 10.2 (tangents from external point are equal): From A: AP = AS; From B: BP = BQ; From C: CQ = CR; From D: DR = DS. Now, AB + CD = (AP + PB) + (CR + RD) = (AS + BQ) + (CQ + DS) = (AS + DS) + (BQ + CQ) = AD + BC. Therefore, AB + CD = AD + BC."
            },
            {
                "question": "Prove that ∠AOB = 90° where XY and X'Y' are two parallel tangents to a circle with centre O and another tangent AB with point of contact C intersecting XY at A and X'Y' at B.",
                "answer": "Since XY and X'Y' are parallel tangents, the distance between them equals the diameter of the circle. Let the circle touch XY at P and X'Y' at Q. Then OP ⊥ XY and OQ ⊥ X'Y'. Since XY || X'Y', we have OP || OQ, but this is only possible if P, O, Q are collinear and PQ is a diameter. Since AC is tangent at C, ∠OCA = 90°. Similarly, ∠OCB = 90°. In quadrilateral OACB, ∠OCA + ∠OCB = 180°. Since ∠CAP = ∠CBQ (alternate angles with PQ), and using properties of tangent angles, we can prove ∠AOB = 90°."
            },
            {
                "question": "Prove that the angle between the two tangents drawn from an external point to a circle is supplementary to the angle subtended by the line-segment joining the points of contact at the centre.",
                "answer": "Let tangents from external point P touch the circle at A and B. We need to prove ∠APB + ∠AOB = 180°. In quadrilateral PAOB: ∠PAO = ∠PBO = 90° (tangent ⊥ radius). Sum of angles in quadrilateral = 360°. So: ∠APB + ∠AOB + ∠PAO + ∠PBO = 360°. Therefore: ∠APB + ∠AOB + 90° + 90° = 360°, which gives ∠APB + ∠AOB = 180°. Hence, the angles are supplementary."
            },
            {
                "question": "Prove that the parallelogram circumscribing a circle is a rhombus.",
                "answer": "Let parallelogram ABCD circumscribe a circle. From the property of tangents from external point: From A: tangent lengths are equal, let = p; From B: tangent lengths are equal, let = q; From C: tangent lengths are equal, let = r; From D: tangent lengths are equal, let = s. Then: AB = p + q, BC = q + r, CD = r + s, DA = s + p. Since ABCD is parallelogram: AB = CD and BC = DA. So: p + q = r + s and q + r = s + p. Solving these equations: p = r and q = s. Therefore: AB = p + q, BC = q + r = s + p = q + p, CD = r + s = p + q, DA = s + p = q + p. All sides are equal, so ABCD is a rhombus."
            },
            {
                "question": "A triangle ABC is drawn to circumscribe a circle of radius 4 cm such that the segments BD and DC into which BC is divided by the point of contact D are of lengths 8 cm and 6 cm respectively. Find the sides AB and AC.",
                "answer": "Let the circle touch sides BC, CA, AB at points D, E, F respectively. Given: BD = 8 cm, DC = 6 cm, so BC = 14 cm. By tangent property: AF = AE (tangents from A), BF = BD = 8 cm, CE = CD = 6 cm. Let AF = AE = x. Then: AB = AF + FB = x + 8, AC = AE + EC = x + 6. For a triangle circumscribing a circle, area = rs where r = radius = 4 cm, s = semi-perimeter. s = (AB + BC + CA)/2 = (x + 8 + 14 + x + 6)/2 = x + 14. Using the fact that tangent length from external point to incenter: Area = 4(x + 14). Also, using Heron's formula and the given measurements, we can show x = 5. Therefore: AB = 5 + 8 = 13 cm, AC = 5 + 6 = 11 cm."
            }
        ],
        "summary": {
            "title": "Circles - Tangents to a Circle",
            "key_concepts": [
                "Definition and properties of tangents to circles",
                "Tangent is perpendicular to radius at point of contact",
                "Number of tangents from different positions relative to circle",
                "Equal lengths of tangents from external point",
                "Applications in circumscribed polygons"
            ],
            "summary": "This chapter introduces the concept of tangents to circles, building on basic circle properties from Class IX. It establishes that a tangent is a line that intersects a circle at exactly one point, distinguishing it from secants (two intersection points) and non-intersecting lines. The chapter proves fundamental theorems: tangents are perpendicular to radii at the point of contact, and tangent lengths from an external point are equal. It explores the number of possible tangents based on point position - no tangents from inside, one tangent from on the circle, and exactly two from outside. The chapter concludes with practical applications involving circumscribed polygons and geometric constructions, providing a foundation for advanced circle geometry."
        }
    },
    "statistics": {
        "total_images": 15,
        "text_length": 15228,
        "processing_time": 8.02
    },
    "claude_processing": {
        "processed_at": "2025-07-19 11:13:36",
        "model_used": "claude-sonnet-4-20250514",
        "tasks_completed": [
            "exercises",
            "summary",
            "answers",
            "image_descriptions"
        ],
        "exercises_count": 16,
        "images_processed": 15,
        "last_updated": "2025-07-19 11:50:40",
        "images_reprocessed": 15
    }
}