{
    "id": "bfa3d3a5-7e4a-484f-9b66-a0e304d6eac3",
    "title": "Triangles",
    "source_file": "/home/content/books/maths/jemh106.pdf",
    "filename": "jemh106.pdf",
    "subject": "maths",
    "conversion_timestamp": "2025-07-18T12:04:35.766971",
    "processing_time_seconds": 19.16,
    "metadata": "md",
    "content": {
        "markdown_text": "![](_page_0_Picture_0.jpeg)\n\n# **TRIANGLES**\n\n**6**\n\n# **6.1 Introduction**\n\nYou are familiar with triangles and many of their properties from your earlier classes. In Class IX, you have studied congruence of triangles in detail. Recall that two figures are said to be *congruent*, if they have the same shape and the same size. In this chapter, we shall study about those figures which have the same shape but not necessarily the same size. Two figures having the same shape (and not necessarily the same size) are called *similar figures.* In particular, we shall discuss the similarity of triangles and apply this knowledge in giving a simple proof of Pythagoras Theorem learnt earlier.\n\nCan you guess how heights of mountains (say Mount Everest) or distances of some long distant objects (say moon) have been found out? Do you think these have\n\n![](_page_0_Picture_5.jpeg)\n\nbeen measured directly with the help of a measuring tape? In fact, all these heights and distances have been found out using the idea of indirect measurements, which is based on the principle of similarity of figures (see Example 7, Q.15 of Exercise 6.3 and also Chapters 8 and 9 of this book).\n\n# **6.2 Similar Figures**\n\nIn Class IX, you have seen that all circles with the same radii are congruent, all squares with the same side lengths are congruent and all equilateral triangles with the same side lengths are congruent.\n\nNow consider any two (or more) circles [see Fig. 6.1 (i)]. Are they congruent? Since all of them do not have the same radius, they are not congruent to each other. Note that some are congruent and some are not, but all of them have the same shape. So they all are, what we call, *similar*. Two similar figures have the same shape but not necessarily the same size. Therefore, all circles are similar. What about two (or more) squares or two (or more) equilateral triangles [see Fig. 6.1 (ii) and (iii)]? As observed in the case of circles, here also all squares are similar and all equilateral triangles are similar.\n\nFrom the above, we can say *that all congruent figures are similar but the similar figures need not be congruent.*\n\nCan a circle and a square be similar? Can a triangle and a square be similar? These questions can be answered by just looking at the figures (see Fig. 6.1). Evidently these figures are not similar. (Why?)\n\n![](_page_1_Picture_7.jpeg)\n\nWhat can you say about the two quadrilaterals ABCD and PQRS (see Fig 6.2)?Are they similar? These figures appear to be similar but we cannot be certain about it.Therefore, we must have some definition of similarity of figures and based on this definition some rules to decide whether the two given figures are similar or not. For this, let us look at the photographs given in Fig. 6.3:\n\n![](_page_2_Picture_2.jpeg)\n\n**Fig. 6.3**\n\nYou will at once say that they are the photographs of the same monument (Taj Mahal) but are in different sizes. Would you say that the three photographs are similar? Yes,they are.\n\nWhat can you say about the two photographs of the same size of the same person one at the age of 10 years and the other at the age of 40 years? Are these photographs similar? These photographs are of the same size but certainly they are not of the same shape. So, they are not similar.\n\nWhat does the photographer do when she prints photographs of different sizes from the same negative? You must have heard about the stamp size, passport size and postcard size photographs. She generally takes a photograph on a small size film, say of 35mm size and then enlarges it into a bigger size, say 45mm (or 55mm). Thus, if we consider any line segment in the smaller photograph (figure), its corresponding line\n\nsegment in the bigger photograph (figure) will be 45 35 55 or 35 of that of the line segment. This really means that every line segment of the smaller photograph is enlarged (increased) *in the ratio* 35:45 (or 35:55). It can also be said that every line segment of the bigger photograph is reduced (decreased) in the ratio 45:35 (or 55:35). Further, if you consider inclinations (or angles) between any pair of corresponding line segments in the two photographs of different sizes, you shall see that these inclinations(or angles) *are always equal.* This is the essence of the similarity of two figures and in particular of two polygons. We say that:\n\n*Two polygons of the same number of sides are similar, if* (*i*) *their corresponding angles are equal and* (*ii*) *their corresponding sides are in the same ratio* (*or proportion*).\n\nNote that the same ratio of the corresponding sides is referred to as *the scale factor* (or the *Representative Fraction*) for the polygons. You must have heard that world maps (i.e., global maps) and blue prints for the construction of a building are prepared using a suitable scale factor and observing certain conventions.\n\nIn order to understand similarity of figures more clearly, let us perform the following activity:\n\n**Activity 1 :** Place a lighted bulb at a point O on the ceiling and directly below it a table in your classroom. Let us cut a polygon, say a quadrilateral ABCD, from a plane cardboard and place this cardboard parallel to the ground between the lighted bulb and the table. Then a shadow of ABCD is cast on the table. Mark the outline of this shadow as ABCD (see Fig.6.4).\n\nNote that the quadrilateral ABCD is an enlargement (or magnification) of the quadrilateral ABCD. This is because of the property of light that light propogates in a straight line. You may also note that A lies on ray OA, B lies on ray OB, C\n\n![](_page_3_Picture_5.jpeg)\n\nlies on OC and D lies on OD. Thus, quadrilaterals ABCD and ABCD are of the same shape but of different sizes.\n\nSo, quadrilateral ABCD is similiar to quadrilateral ABCD. We can also say that quadrilateral ABCD is similar to the quadrilateral ABCD.\n\nHere, you can also note that vertex A corresponds to vertex A, vertex B corresponds to vertex B, vertex C corresponds to vertex C and vertex D corresponds to vertex D. Symbolically, these correspondences are represented as A A, B B, C C and D D. By actually measuring the angles and the sides of the two quadrilaterals, you may verify that\n\n(i) \n$$\n\\angle A = \\angle A', \\angle B = \\angle B', \\angle C = \\angle C', \\angle D = \\angle D'\n$$\n and  \n\\n(ii) \n$$\n\\frac{AB}{A'B'} = \\frac{BC}{B'C'} = \\frac{CD}{C'D'} = \\frac{DA}{D'A'}\n$$\n\nThis again emphasises that *two polygons of the same number of sides are similar, if* (*i*) *all the corresponding angles are equal and* (*ii*) *all the corresponding sides are in the same ratio* (*or proportion*).\n\nFrom the above, you can easily say that quadrilaterals ABCD and PQRS of Fig. 6.5 are similar.\n\n![](_page_4_Figure_2.jpeg)\n\n**Remark :** You can verify that if one polygon is similar to another polygon and this second polygon is similar to a third polygon, then the first polygon is similar to the third polygon.\n\nYou may note that in the two quadrilaterals (a square and a rectangle) of Fig. 6.6, corresponding angles are equal, but their corresponding sides are not in the same ratio.\n\n![](_page_4_Figure_5.jpeg)\n\nSo, the two quadrilaterals are not similar. Similarly, you may note that in the two quadrilaterals (a square and a rhombus) of Fig. 6.7, corresponding sides are in the same ratio, but their corresponding angles are not equal. Again, the two polygons (quadrilaterals) are not similar.\n\n![](_page_5_Figure_0.jpeg)\n\n**Fig. 6.7**\n\nThus, *either of the above two conditions* (*i*) *and* (*ii*) *of similarity of two polygons is not sufficient for them to be similar*.\n\n# **EXERCISE 6.1**\n\n- **1.** Fill in the blanks using the correct word given in brackets :\n  - (i) All circles are . (congruent, similar)\n  - (ii) All squares are . (similar, congruent)\n  - (iii) All triangles are similar. (isosceles, equilateral)\n  - (iv) Two polygons of the same number of sides are similar, if (a) their corresponding angles are and (b) their corresponding sides are .(equal, proportional)\n- **2.** Give two different examples of pair of\n  - (i) similar figures. (ii) non-similar figures.\n- **3.** State whether the following quadrilaterals are similar or not:\n\n![](_page_5_Figure_12.jpeg)\n\n**Fig. 6.8**\n\n#### **6.3 Similarity of Triangles**\n\nWhat can you say about the similarity of two triangles?\n\nYou may recall that triangle is also a polygon. So, we can state the same conditions for the similarity of two triangles. That is:\n\n*Two triangles are similiar, if*\n\n(*i*) *their corresponding angles are equal and*\n\n(*ii*) *their corresponding sides are in the same ratio* (*or proportion*)*.*\n\nNote that if corresponding angles of two triangles are equal, then they are known as *equiangular triangles.* A famous Greek mathematician Thales gave an important truth relating to two equiangular triangles which is as follows:\n\n*The ratio of any two corresponding sides in two equiangular triangles is always the same.*\n\nIt is believed that he had used a result called the *Basic Proportionality Theorem* (now known as the *Thales Theorem*) for the same.\n\nTo understand the Basic Proportionality Theorem, let us perform the following activity:\n\n**Activity 2 :** Draw any angle XAY and on its one arm AX, mark points (say five points) P, Q, D, R and B such that AP = PQ = QD = DR = RB.\n\nNow, through B, draw any line intersecting arm AY at C (see Fig. 6.9).\n\nAlso, through the point D, draw a line parallel to BC to intersect AC at E. Do you observe from\n\n![](_page_6_Picture_14.jpeg)\n\n![](_page_6_Figure_15.jpeg)\n\n**Fig. 6.9**\n\nyour constructions that AD 3 DB 2 ? Measure AE and EC. What about AE EC ? Observe that AE EC is also equal to 3 <sup>2</sup> . Thus, you can see that in ABC, DE || BC and AD AE DB EC . Is it a coincidence? No, it is due to the following theorem (known as the Basic Proportionality Theorem):\n\n**Theorem 6.1 :** *If a line is drawn parallel to one side of a triangle to intersect the other two sides in distinct points, the other two sides are divided in the same ratio.*\n\n**Proof :** We are given a triangle ABC in which a line parallel to side BC intersects other two sides AB and AC at D and E respectively (see Fig. 6.10). AD AE DB EC . Let us join BE and CD and then draw DM AC and 1 <sup>2</sup> base × height) = 1 <sup>2</sup> AD × EN. So, ar(ADE) = 1 <sup>2</sup> AD × EN Similarly, ar(BDE) = 1 <sup>2</sup> DB × EN, ar(ADE) = 1 <sup>2</sup> AE × DM and ar(DEC) = 1 <sup>2</sup> EC × DM. Therefore, ar(ADE) ar(BDE)<sup>=</sup> <sup>1</sup> AD × EN 2 AD <sup>1</sup> DB DB × EN 2 (1) and ar(ADE) ar(DEC)<sup>=</sup> <sup>1</sup> AE × DM 2 AE <sup>1</sup> EC EC × DM 2 (2) Note that BDE and DEC are on the same base DE and between the same parallels BC and DE. **Fig. 6.10**\n\nSo, ar(BDE) = ar(DEC) (3)\n\nWe need to prove that\n\nEN AB.\n\nNow, area of ADE (=\n\nRecall from Class IX, that area of ADE is denoted as ar(ADE).\n\nTherefore, from (1), (2) and (3), we have :\n\n$$\n\\frac{AD}{DB} = \\frac{AE}{EC}\n$$\n\nIs the converse of this theorem also true (For the meaning of converse, see Appendix 1)? To examine this, let us perform the following activity:\n\n**Activity 3 :** Draw an angle XAY on your notebook and on ray AX, mark points B1 , B2 , B3 , B4 and B such that AB1 = B1 B2 = B2 B3 = B3 B4 = B4 B.\n\nSimilarly, on ray AY, mark points C1 , C2 , C3 , C4 and C such that AC1 = C1 C2 = C2 C3 = C3 C4 = C4 C. Then join B1 C1 and BC (see Fig. 6.11).\n\n![](_page_8_Figure_6.jpeg)\n\nNote that \n$$\n\\frac{AB_1}{B_1B} = \\frac{AC_1}{C_1C}\n$$\n (Each equal to  $\\frac{1}{4}$ )\n\nYou can also see that lines B1 C1 and BC are parallel to each other, i.e.,\n\n$$\nB_1 C_1 \\parallel BC \\tag{1}\n$$\n\nSimilarly, by joining B2 C2 , B3 C3 and B4 C4 , you can see that:\n\n$$\n\\frac{AB_2}{B_2B} = \\frac{AC_2}{C_2C} \\left(=\\frac{2}{3}\\right) \\text{ and } B_2C_2 \\parallel BC \\tag{2}\n$$\n\n$$\n\\frac{\\text{AB}_3}{\\text{B}_3 \\text{B}} = \\frac{\\text{AC}_3}{\\text{C}_3 \\text{C}} \\left( = \\frac{3}{2} \\right) \\text{ and } \\text{B}_3 \\text{C}_3 \\parallel \\text{BC}\n$$\n (3)\n\n$$\n\\frac{AB_4}{B_4B} = \\frac{AC_4}{C_4C} \\left(=\\frac{4}{1}\\right) \\text{ and } B_4C_4 \\parallel BC \\tag{4}\n$$\n\nFrom (1), (2), (3) and (4), it can be observed that if a line divides two sides of a triangle in the same ratio, then the line is parallel to the third side.\n\nYou can repeat this activity by drawing any angle XAY of different measure and taking any number of equal parts on arms AX and AY . Each time, you will arrive at the same result. Thus, we obtain the following theorem, which is the converse of Theorem 6.1:\n\n**Theorem 6.2 :** *If a line divides any two sides of a triangle in the same ratio, then the line is parallel to the third side.*\n\nThis theorem can be proved by taking a line DE such\n\nthat AD AE DB EC and assuming that DE is not parallel to BC (see Fig. 6.12).\n\nIf DE is not parallel to BC, draw a line DE parallel to BC.\n\n> AD DB<sup>=</sup> AE\n\nAE EC<sup>=</sup> AE E C \n\n![](_page_9_Figure_5.jpeg)\n\n![](_page_9_Figure_6.jpeg)\n\nTherefore,\n\nSo,\n\nAdding 1 to both sides of above, you can see that E and E must coincide. (Why ?)\n\n(Why ?)\n\n(Why ?)\n\nLet us take some examples to illustrate the use of the above theorems.\n\nE C \n\n**Example 1 :** If a line intersects sides AB and AC of a ABC at D and E respectively\n\n| and is parallel to BC, prove that | AD<br>=<br>AB                                 | AE<br>(see Fig. 6.13).<br>AC |\n|-----------------------------------|-----------------------------------------------|------------------------------|\n| Solution :                        | DE   <br>BC                                   | (Given)                      |\n| So,                               | AD<br>AE<br>=<br>DB<br>EC                     | (Theorem 6.1)                |\n| or,                               | DB<br>EC<br>=<br>AD<br>AE                     |                              |\n| or,                               | DB<br>EC<br>1<br>1<br><br><br>=<br>AD<br>AE |                              |\n| or,                               | AB<br>AC<br>=<br>AD<br>AE                     |                              |\n| So,                               | AD<br>AE<br>=<br>AB<br>AC                     | Fig. 6.13                    |\n\n![](_page_10_Figure_1.jpeg)\n\nAlso, it is given that\n\n$$\n\\angle \\text{PST} = \\angle \\text{PRQ} \\tag{2}\n$$\n  \nSo, \n$$\n\\angle \\text{PRQ} = \\angle \\text{PQR} \\text{ [From (1) and (2)]}\n$$\n  \nTherefore, \n$$\n\\text{PQ} = \\text{PR} \\text{ (Sides opposite the equal angles)}\n$$\n\ni.e., PQR is an isosceles triangle.\n\n#### **EXERCISE 6.2**\n\n![](_page_11_Figure_5.jpeg)\n\n- **5.** In Fig. 6.20, DE || OQ and DF || OR. Show that EF || QR.\n- **6.** In Fig. 6.21, A, B and C are points on OP, OQ and OR respectively such that AB || PQ and AC || PR. Show that BC || QR.\n- **7.** Using Theorem 6.1, prove that a line drawn through the mid-point of one side of a triangle parallel to another side bisects the third side. (Recall that you have proved it in Class IX).\n- **8.** Using Theorem 6.2, prove that the line joining the mid-points of any two sides of a triangle is parallel to the third side. (Recall that you have done it in Class IX).\n- **9.** ABCD is a trapezium in which AB || DC and its diagonals intersect each other at the point O. Show\n\nthat \n$$\n\\frac{AO}{BO} = \\frac{CO}{DO}\n$$\n.\n\n![](_page_12_Figure_7.jpeg)\n\n**Fig. 6.20**\n\n![](_page_12_Figure_9.jpeg)\n\n**10.** The diagonals of a quadrilateral ABCD intersect each other at the point O such that\n\nAO CO BO DO Show that ABCD is a trapezium.\n\n## **6.4 Criteria for Similarity of Triangles**\n\nIn the previous section, we stated that two triangles are similar, if (i) their corresponding angles are equal and (ii) their corresponding sides are in the same ratio (or proportion).\n\nThat is, in ABC and DEF, if\n\n(i) \n$$\n\\angle\n$$\n A =  $\\angle$  D,  $\\angle$  B =  $\\angle$  E,  $\\angle$  C =  $\\angle$  F and\n\n(ii) \n$$\n\\frac{AB}{DE} = \\frac{BC}{EF} = \\frac{CA}{FD}\n$$\n, then the two triangles are similar (see Fig. 6.22).\n\n**Fig. 6.22**\n\nHere, you can see that A corresponds to D, B corresponds to E and C corresponds to F. Symbolically, we write the similarity of these two triangles as ' ABC ~ DEF' and read it as 'triangle ABC is similar to triangle DEF'. The symbol '~' stands for 'is similar to'. Recall that you have used the symbol '' for 'is congruent to' in Class IX.\n\nIt must be noted that as done in the case of congruency of two triangles, the similarity of two triangles should also be expressed symbolically, using correct correspondence of their vertices. For example, for the triangles ABC and DEF of Fig. 6.22, we cannot write ABC ~ EDF or ABC ~ FED. However, we can write BAC ~ EDF.\n\nNow a natural question arises : For checking the similarity of two triangles, say ABC and DEF, should we always look for all the equality relations of their corresponding angles ( A = D, B = E, C = F) and all the equality relations of the ratios\n\nof their corresponding sides AB BC CA DE EF FD ? Let us examine. You may recall that\n\nin Class IX, you have obtained some criteria for congruency of two triangles involving only three pairs of corresponding parts (or elements) of the two triangles. Here also, let us make an attempt to arrive at certain criteria for similarity of two triangles involving relationship between less number of pairs of corresponding parts of the two triangles, instead of all the six pairs of corresponding parts. For this, let us perform the following activity:\n\n**Activity 4 :** Draw two line segments BC and EF of two different lengths, say 3 cm and 5 cm respectively. Then, at the points B and C respectively, construct angles PBC and QCB of some measures, say, 60° and 40°. Also, at the points E and F, construct angles REF and SFE of 60° and 40° respectively (see Fig. 6.23).\n\n![](_page_13_Figure_7.jpeg)\n\nLet rays BP and CQ intersect each other at A and rays ER and FS intersect each other at D. In the two triangles ABC and DEF, you can see that B = E, C = F and A = D. That is, corresponding angles of these two triangles are equal. What can you say about their corresponding sides ? Note that BC 3 0.6. EF 5 What about AB DE and CA FD ? On measuring AB, DE, CA and FD, you will find that AB DE and CA FD are also equal to 0.6 (or nearly equal to 0.6, if there is some error in the measurement). Thus, AB BC CA DE EF FD You can repeat this activity by constructing several pairs of triangles having their corresponding angles equal. Every time, you will find that their corresponding sides are in the same ratio (or proportion). This activity leads us to the following criterion for similarity of two triangles.\n\n**Theorem 6.3 :** *If in two triangles, corresponding angles are equal, then their corresponding sides are in the same ratio* (*or proportion*) *and hence the two triangles are similar.*\n\nThis criterion is referred to as the AAA (Angle–Angle–Angle) criterion of similarity of two triangles.\n\nThis theorem can be proved by taking two triangles ABC and DEF such that A = D, B = E and C = F (see Fig. 6.24) Cut DP = AB and DQ = AC and join PQ. So, ABC DPQ (Why ?) This gives B = P = E and PQ || EF (How?) Therefore, DP PE<sup>=</sup> DQ QF (Why?) i.e., AB DE<sup>=</sup> AC DF (Why?) Similarly, AB DE = BC EF and so AB BC AC DE EF DF . **Fig. 6.24**\n\n**Remark :** If two angles of a triangle are respectively equal to two angles of another triangle, then by the angle sum property of a triangle their third angles will also be equal. Therefore, AAA similarity criterion can also be stated as follows:\n\n*If two angles of one triangle are respectively equal to two angles of another triangle, then the two triangles are similar.*\n\nThis may be referred to as the AA *similarity criterion* for two triangles.\n\nYou have seen above that if the three angles of one triangle are respectively equal to the three angles of another triangle, then their corresponding sides are proportional (i.e., in the same ratio). What about the converse of this statement? Is the converse true? In other words, if the sides of a triangle are respectively proportional to the sides of another triangle, is it true that their corresponding angles are equal? Let us examine it through an activity :\n\n**Activity 5 :** Draw two triangles ABC and DEF such that AB = 3 cm, BC = 6 cm, CA = 8 cm, DE = 4.5 cm, EF = 9 cm and FD = 12 cm (see Fig. 6.25).\n\n![](_page_15_Figure_5.jpeg)\n\nNow measure A, B, C, D, E and F. You will observe that A = D, B = E and C = F, i.e., the corresponding angles of the two triangles are equal.\n\nYou can repeat this activity by drawing several such triangles (having their sides in the same ratio). Everytime you shall see that their corresponding angles are equal. It is due to the following criterion of similarity of two triangles:\n\n**Theorem 6.4 :** *If in two triangles, sides of one triangle are proportional to* (*i.e., in the same ratio of* ) *the sides of the other triangle, then their corresponding angles are equal and hence the two triangles are similiar.*\n\nThis criterion is referred to as the SSS (Side–Side–Side) *similarity criterion for two triangles*.\n\nThis theorem can be proved by taking two triangles ABC and DEF such that AB BC CA DE EF FD (< 1) (see Fig. 6.26):\n\n![](_page_16_Figure_1.jpeg)\n\n**Remark :** You may recall that either of the two conditions namely, (i) corresponding angles are equal and (ii) corresponding sides are in the same ratio is not sufficient for two polygons to be similar. However, on the basis of Theorems 6.3 and 6.4, you can now say that in case of similarity of the two triangles, it is not necessary to check both the conditions as one condition implies the other.\n\nLet us now recall the various criteria for congruency of two triangles learnt in Class IX. You may observe that SSS similarity criterion can be compared with the SSS congruency criterion.This suggests us to look for a similarity criterion comparable to SAS congruency criterion of triangles. For this, let us perform an activity.\n\n**Activity 6 :** Draw two triangles ABC and DEF such that AB = 2 cm, A = 50°, AC = 4 cm, DE = 3 cm, D = 50° and DF = 6 cm (see Fig.6.27).\n\n![](_page_17_Figure_1.jpeg)\n\n![](_page_17_Figure_2.jpeg)\n\nHere, you may observe that AB DE = AC DF (each equal to 2 <sup>3</sup> ) and A (included\n\nbetween the sides AB and AC) = D (included between the sides DE and DF). That is, one angle of a triangle is equal to one angle of another triangle and sides including these angles are in the same ratio (i.e., proportion). Now let us measure B, C, E and F.\n\nYou will find that B = E and C = F. That is, A = D, B = E and C = F. So, by AAA similarity criterion, ABC ~ DEF. You may repeat this activity by drawing several pairs of such triangles with one angle of a triangle equal to one angle of another triangle and the sides including these angles are proportional. Everytime, you will find that the triangles are similar. It is due to the following criterion of similarity of triangles:\n\n**Theorem 6.5 :** *If one angle of a triangle is equal to one angle of the other triangle and the sides including these angles are proportional, then the two triangles are similar.*\n\nThis criterion is referred to as the SAS (Side–Angle–Side) similarity criterion for two triangles*.*\n\nAs before, this theorem can be proved by taking two triangles ABC and DEF such that AB AC DE DF ( 1) and A = <sup>D</sup> (see Fig. 6.28). Cut DP = AB, DQ = AC and join PQ.\n\n![](_page_17_Figure_9.jpeg)\n\n![](_page_17_Figure_10.jpeg)\n\n| Now,       | PQ   <br>EF<br>and<br> ABC  DPQ   | (How ?) |\n|------------|---------------------------------------|---------|\n| So,        |  A =  D,<br> B =  P and  C =  Q |         |\n| Therefore, |  ABC ~<br> DEF                      | (Why?)  |\n\nWe now take some examples to illustrate the use of these criteria.\n\n**Example 4 :** In Fig. 6.29, if PQ || RS, prove that POQ ~ SOR.\n\n![](_page_18_Figure_4.jpeg)\n\n**Solution :** In ABC and PQR,\n\nAB 3.8 1 , RQ 7.6 2 BC 6 1 QP 12 2 and CA 3 3 1 PR 2 6 3 That is, AB BC CA RQ QP PR So, ABC ~ RQP (SSS similarity) Therefore, C = P (Corresponding angles of similar triangles) But C = 180° – A – B (Angle sum property) = 180° – 80° – 60° = 40° So, P = 40° **Example 6 :** In Fig. 6.31, OA . OB = OC . OD. Show that A = C and B = D. **Solution :** OA . OB = OC . OD (Given) So, OA OC<sup>=</sup> OD OB (1) Also, we have AOD = COB (Vertically opposite angles) (2) Therefore, from (1) and (2), AOD ~ COB (SAS similarity criterion) **Fig. 6.31**\n\nSo, A = C and D = B\n\n(Corresponding angles of similar triangles)\n\n**Example 7 :** A girl of height 90 cm is walking away from the base of a lamp-post at a speed of 1.2 m/s. If the lamp is 3.6 m above the ground, find the length of her shadow after 4 seconds.\n\n**Solution :** Let AB denote the lamp-post and CD the girl after walking for 4 seconds away from the lamp-post (see Fig. 6.32).\n\nFrom the figure, you can see that DE is the shadow of the girl. Let DE be *x* metres.\n\n![](_page_19_Figure_7.jpeg)\n\n![](_page_19_Figure_8.jpeg)\n\n| Now, BD = 1.2 m × 4 = 4.8 m.                                                                                                                               |                                       |                                                                                                  |  |  |  |\n|------------------------------------------------------------------------------------------------------------------------------------------------------------|---------------------------------------|--------------------------------------------------------------------------------------------------|--|--|--|\n| Note that in  ABE and  CDE,                                                                                                                              |                                       |                                                                                                  |  |  |  |\n|                                                                                                                                                            |  B =<br>D<br>                       | (Each is of 90° because lamp-post<br>as well as the girl are standing<br>vertical to the ground) |  |  |  |\n| and                                                                                                                                                        |  E =<br> E                          | (Same angle)                                                                                     |  |  |  |\n| So,                                                                                                                                                        |  ABE ~<br> CDE                      | (AA similarity criterion)                                                                        |  |  |  |\n| Therefore,                                                                                                                                                 | BE<br>AB<br>=<br>DE<br>CD             |                                                                                                  |  |  |  |\n| i.e.,                                                                                                                                                      | 4.8<br>+<br>x<br>3.6<br>=<br>x<br>0.9 | 90<br>(90 cm =<br>m = 0.9 m)<br>100                                                              |  |  |  |\n| i.e.,                                                                                                                                                      | 4.8 + x =4x                           |                                                                                                  |  |  |  |\n| i.e.,                                                                                                                                                      | 3x =<br>4.8                           |                                                                                                  |  |  |  |\n| i.e.,                                                                                                                                                      | x =<br>1.6                            |                                                                                                  |  |  |  |\n| So, the shadow of the girl after walking for 4 seconds is 1.6 m long.                                                                                      |                                       |                                                                                                  |  |  |  |\n| Example 8 :<br>respectively the medians of  ABC and<br> PQR. If  ABC ~  PQR, prove that :<br>(i)<br> AMC ~  PNR<br>CM<br>AB<br><br>(ii)<br>RN<br>PQ | In Fig. 6.33, CM and RN are           |                                                                                                  |  |  |  |\n|                                                                                                                                                            |                                       |                                                                                                  |  |  |  |\n| (iii)<br> CMB ~  RNQ<br>Solution :<br>(i)<br> ABC ~                                                                                                     |  PQR                                 | Fig. 6.33<br>(Given)                                                                             |  |  |  |\n| AB<br>So,                                                                                                                                                  | BC<br>CA<br><br>PQ =<br>QR<br>RP     | (1)                                                                                              |  |  |  |\n| and<br> A =  P,                                                                                                                                          |  B =  Q and  C =  R               | (2)                                                                                              |  |  |  |\n| But                                                                                                                                                        | AB =<br>2 AM and PQ = 2 PN            |                                                                                                  |  |  |  |\n|                                                                                                                                                            |                                       | (As CM and RN are medians)                                                                       |  |  |  |\n| 2AM<br>So, from (1),<br>2PN                                                                                                                                | CA<br>=<br>RP                         |                                                                                                  |  |  |  |\n\nRP\n\n94 MATHEMATICS\n\n| i.e.,                 | AM<br>CA<br>=<br>PN<br>RP                                                              | (3)                       |\n|-----------------------|----------------------------------------------------------------------------------------|---------------------------|\n| Also,                 |  MAC =<br> NPR                                                                       | [From (2)]<br>(4)         |\n| So, from (3) and (4), |                                                                                        |                           |\n|                       |  AMC ~<br> PNR                                                                       | (SAS similarity)<br>(5)   |\n| (ii)<br>From (5),     | CM<br>CA<br>=<br>RN<br>RP                                                              | (6)                       |\n| But                   | AB<br>CA<br>=<br>PQ<br>RP                                                              | [From (1)]<br>(7)         |\n| Therefore,            | AB<br>CM<br>=<br>PQ<br>RN                                                              | [From (6) and (7)]<br>(8) |\n| (iii)<br>Again,       | AB<br>BC<br>PQ =<br>QR                                                                 | [From (1)]                |\n| Therefore,            | CM<br>BC<br>=<br>RN<br>QR                                                              | [From (8)]<br>(9)         |\n| Also,                 | CM<br>AB<br>2<br>BM<br><br>=<br>RN<br>PQ<br>2<br>QN                                   |                           |\n| i.e.,                 | BM<br>CM<br>=<br>QN<br>RN                                                              | (10)                      |\n| i.e.,                 | BC<br>BM<br>CM<br><br>=<br>QR<br>QN<br>RN                                             | [From (9) and (10)]       |\n| Therefore,            |  CMB ~<br> RNQ                                                                       | (SSS similarity)          |\n| part (i).]            | [Note : You can also prove part (iii) by following the same method as used for proving |                           |\n\n## **EXERCISE 6.3**\n\n**1.** State which pairs of triangles in Fig. 6.34 are similar. Write the similarity criterion used by you for answering the question and also write the pairs of similar triangles in the symbolic form :\n\n![](_page_22_Figure_1.jpeg)\n\n- **2.** In Fig. 6.35, ODC ~ OBA, BOC = 125° and CDO = 70°. Find DOC, DCO and OAB.\n- **3.** Diagonals AC and BD of a trapezium ABCD with AB || DC intersect each other at the point O. Using a similarity criterion for two\n\ntriangles, show that \n$$\n\\frac{OA}{OC} = \\frac{OB}{OD}\n$$\n.\n\n![](_page_22_Figure_5.jpeg)\n\n**Fig. 6.35**\n\n- **4.** In Fig. 6.36, QR QT QS PR and 1 = 2. Show that PQS ~ TQR.\n- **5.** S and T are points on sides PR and QR of PQR such that P = RTS. Show that RPQ ~ RTS.\n- **6.** In Fig. 6.37, if ABE ACD, show that ADE ~ ABC.\n- **7.** In Fig. 6.38, altitudes AD and CE of ABC intersect each other at the point P. Show that:\n  - (i) AEP ~ CDP\n  - (ii) ABD ~ CBE\n  - (iii) AEP ~ ADB\n  - (iv) PDC ~ BEC\n- **8.** E is a point on the side AD produced of a parallelogram ABCD and BE intersects CD at F. Show that ABE ~ CFB.\n- **9.** In Fig. 6.39, ABC and AMP are two right triangles, right angled at B and M respectively. Prove that:\n  - (i) ABC ~ AMP\n\n(ii) \n$$\n\\frac{CA}{PA} = \\frac{BC}{MP}\n$$\n\n**10.** CD and GH are respectively the bisectors of ACB and EGF such that D and H lie on sides AB and FE of ABC and EFG respectively. If ABC ~ FEG, show that:\n\n(i) \n$$\n\\frac{CD}{GH} = \\frac{AC}{FG}\n$$\n\n- (ii) DCB ~ HGE\n- (iii) DCA ~ HGF\n\n![](_page_23_Figure_17.jpeg)\n\n![](_page_23_Figure_18.jpeg)\n\n- **11.** In Fig. 6.40, E is a point on side CB produced of an isosceles triangle ABC with AB = AC. If AD BC and EF AC, prove that ABD ~ ECF.\n- **12.** Sides AB and BC and median AD of a triangle ABC are respectively proportional to sides PQ and QR and median PM of PQR (see Fig. 6.41). Show that ABC ~ PQR.\n- **13.** D is a point on the side BC of a triangle ABC such that ADC = BAC. Show that CA2 = CB.CD.\n- **14.** Sides AB and AC and median AD of a triangle ABC are respectively proportional to sides PQ and PR and median PM of another triangle PQR. Show that ABC ~ PQR.\n\n![](_page_24_Figure_5.jpeg)\n\n- **15.** A vertical pole of length 6 m casts a shadow 4 m long on the ground and at the same time a tower casts a shadow 28 m long. Find the height of the tower.\n- **16.** If AD and PM are medians of triangles ABC and PQR, respectively where\n\n$$\n\\Delta ABC \\sim \\Delta PQR\n$$\n, prove that  $\\frac{AB}{PQ} = \\frac{AD}{PM}$ .\n\n#### **6.5 Summary**\n\nIn this chapter you have studied the following points :\n\n- **1.** Two figures having the same shape but not necessarily the same size are called similar figures.\n- **2.** All the congruent figures are similar but the converse is not true.\n- **3.** Two polygons of the same number of sides are similar, if (i) their corresponding angles are equal and (ii) their corresponding sides are in the same ratio (i.e., proportion).\n- **4.** If a line is drawn parallel to one side of a triangle to intersect the other two sides in distinct points, then the other two sides are divided in the same ratio.\n- **5.** If a line divides any two sides of a triangle in the same ratio, then the line is parallel to the third side.\n- **6.** If in two triangles, corresponding angles are equal, then their corresponding sides are in the same ratio and hence the two triangles are similar (AAA similarity criterion).\n- **7.** If in two triangles, two angles of one triangle are respectively equal to the two angles of the other triangle, then the two triangles are similar (AA similarity criterion).\n\n- **8.** If in two triangles, corresponding sides are in the same ratio, then their corresponding angles are equal and hence the triangles are similar (SSS similarity criterion).\n- **9.** If one angle of a triangle is equal to one angle of another triangle and the sides including these angles are in the same ratio (proportional), then the triangles are similar (SAS similarity criterion).\n\n# **A NOTE TO THE READER**\n\nIf in two right triangles, hypotenuse and one side of one triangle are proportional to the hypotenuse and one side of the other triangle, then the two triangles are similar. This may be referred to as the RHS Similarity Criterion.\n\nIf you use this criterion in Example 2, Chapter 8, the proof will become simpler.",
        "structured_data": {
            "error": "No structured data available"
        },
        "images": [
            {
                "name": "_page_0_Picture_0.jpeg",
                "path": "/home/content/converted_books/images/jemh106/_page_0_Picture_0.jpeg",
                "size_bytes": 15116,
                "description": "The image shows a QR code with the identifier \"1062CH06\" below it. This QR code likely provides digital access to additional resources, interactive content, or supplementary materials related to Chapter 6 on Triangles.",
                "description_generated_at": "2025-07-19 11:49:46"
            },
            {
                "name": "_page_0_Picture_5.jpeg",
                "path": "/home/content/converted_books/images/jemh106/_page_0_Picture_5.jpeg",
                "size_bytes": 73191,
                "description": "This image shows two cartoon panels illustrating the concept of indirect measurement using similarity principles - one person measuring a mountain's height saying \"It is so easy to measure the height of the mountain\" and another measuring the moon's distance saying \"Soon I will reach the moon.\" The illustration demonstrates how mathematical concepts of similar triangles can be used to calculate distances and heights of objects that cannot be measured directly, connecting to the chapter's introduction of similarity in geometry.",
                "description_generated_at": "2025-07-19 11:49:46"
            },
            {
                "name": "_page_1_Picture_7.jpeg",
                "path": "/home/content/converted_books/images/jemh106/_page_1_Picture_7.jpeg",
                "size_bytes": 45652,
                "description": "This image shows Figure 6.1, which displays three sets of geometric shapes in different sizes: (i) circles of varying sizes, (ii) squares of different sizes, and (iii) equilateral triangles of different sizes, followed by Figure 6.2 showing two quadrilaterals ABCD and PQRS. The diagrams are used to illustrate the concept of similarity in geometry, demonstrating how shapes can have the same form but different sizes.",
                "description_generated_at": "2025-07-19 11:49:46"
            },
            {
                "name": "_page_2_Picture_2.jpeg",
                "path": "/home/content/converted_books/images/jemh106/_page_2_Picture_2.jpeg",
                "size_bytes": 26038,
                "description": "This image shows three black and white photographs of the Taj Mahal in decreasing sizes from left to right, all displaying the same monument but at different scales. The image is used to illustrate the concept of similarity in mathematics, demonstrating how objects can have the same shape but different sizes while remaining similar figures.",
                "description_generated_at": "2025-07-19 11:49:46"
            },
            {
                "name": "_page_3_Picture_5.jpeg",
                "path": "/home/content/converted_books/images/jemh106/_page_3_Picture_5.jpeg",
                "size_bytes": 39643,
                "description": "This diagram (Fig. 6.4) illustrates an activity demonstrating similarity using a light bulb at point O casting a shadow of quadrilateral ABCD onto a table, creating a larger similar quadrilateral A'B'C'D'. The image shows how the light rays from O pass through the vertices of the original quadrilateral to create corresponding vertices of the enlarged shadow, helping students visualize how similar figures have the same shape but different sizes.",
                "description_generated_at": "2025-07-19 11:49:46"
            },
            {
                "name": "_page_4_Figure_2.jpeg",
                "path": "/home/content/converted_books/images/jemh106/_page_4_Figure_2.jpeg",
                "size_bytes": 32992,
                "description": "This image shows two quadrilaterals (ABCD and PQRS) with labeled vertices, side lengths, and interior angles to demonstrate similar polygons. The diagram illustrates that these quadrilaterals are similar because their corresponding angles are equal and their corresponding sides are in the same ratio, supporting the textbook's explanation of polygon similarity conditions.",
                "description_generated_at": "2025-07-19 11:49:46"
            },
            {
                "name": "_page_4_Figure_5.jpeg",
                "path": "/home/content/converted_books/images/jemh106/_page_4_Figure_5.jpeg",
                "size_bytes": 21299,
                "description": "This image shows two quadrilaterals - a square ABCD with all sides measuring 3 cm and a rectangle PQRS with sides of 3.5 cm and 3 cm. The diagram illustrates an example where corresponding angles are equal but corresponding sides are not in the same ratio, demonstrating that these two quadrilaterals are not similar despite having equal angles.",
                "description_generated_at": "2025-07-19 11:49:46"
            },
            {
                "name": "_page_5_Figure_0.jpeg",
                "path": "/home/content/converted_books/images/jemh106/_page_5_Figure_0.jpeg",
                "size_bytes": 27656,
                "description": "The image shows Figure 6.5, which displays two similar quadrilaterals - a smaller square ABCD with all sides measuring 2.1 cm and a larger rhombus PQRS with all sides measuring 4.2 cm. This diagram illustrates an example of similar polygons where corresponding sides are proportional (in a 1:2 ratio) and corresponding angles are equal.",
                "description_generated_at": "2025-07-19 11:49:46"
            },
            {
                "name": "_page_5_Figure_12.jpeg",
                "path": "/home/content/converted_books/images/jemh106/_page_5_Figure_12.jpeg",
                "size_bytes": 18044,
                "description": "The image shows two quadrilaterals with labeled vertices and side lengths - a smaller quadrilateral PQRS with all sides measuring 1.5 cm and a larger square ABCD with all sides measuring 3 cm. This diagram is used to illustrate the concept of similar polygons, as both shapes have equal corresponding angles and proportional corresponding sides (ratio 1:2).",
                "description_generated_at": "2025-07-19 11:49:46"
            },
            {
                "name": "_page_6_Picture_14.jpeg",
                "path": "/home/content/converted_books/images/jemh106/_page_6_Picture_14.jpeg",
                "size_bytes": 20360,
                "description": "This image shows a portrait of Thales, the ancient Greek mathematician who lived from 640-546 B.C., presented in an oval frame with his name and dates below. The image serves to introduce students to the historical figure behind the Basic Proportionality Theorem (also known as Thales Theorem) that is being discussed in this geometry chapter.",
                "description_generated_at": "2025-07-19 11:49:46"
            },
            {
                "name": "_page_6_Figure_15.jpeg",
                "path": "/home/content/converted_books/images/jemh106/_page_6_Figure_15.jpeg",
                "size_bytes": 7931,
                "description": "This diagram shows a geometric construction with angle XAY, where points P, Q, D, R, and B are marked at equal intervals along arm AX, and a line through B intersects arm AY at point C, with another line through D drawn parallel to BC intersecting AC at point E. The figure illustrates the setup for demonstrating the Basic Proportionality Theorem (Thales Theorem), showing how parallel lines create proportional segments in triangles.",
                "description_generated_at": "2025-07-19 11:49:46"
            },
            {
                "name": "_page_8_Figure_6.jpeg",
                "path": "/home/content/converted_books/images/jemh106/_page_8_Figure_6.jpeg",
                "size_bytes": 14640,
                "description": "This diagram shows an angle XAY with equally spaced points marked on both rays (B₁, B₂, B₃, B₄, B on ray AX and C₁, C₂, C₃, C₄, C on ray AY), with lines connecting corresponding points to demonstrate the converse of the basic proportionality theorem. The figure illustrates how when two sides of a triangle are divided in the same ratio, the connecting lines are parallel to the third side.",
                "description_generated_at": "2025-07-19 11:49:46"
            },
            {
                "name": "_page_9_Figure_5.jpeg",
                "path": "/home/content/converted_books/images/jemh106/_page_9_Figure_5.jpeg",
                "size_bytes": 9985,
                "description": "This diagram shows triangle ABC with point D on side AB and two points E and E' on side AC, illustrating the proof of Theorem 6.2 about parallel lines and proportional segments. The diagram includes a dashed line DE (not parallel to BC) and demonstrates how if a line divides two sides of a triangle in the same ratio, it must be parallel to the third side.",
                "description_generated_at": "2025-07-19 11:49:46"
            },
            {
                "name": "_page_9_Figure_6.jpeg",
                "path": "/home/content/converted_books/images/jemh106/_page_9_Figure_6.jpeg",
                "size_bytes": 1858,
                "description": "This diagram (Fig. 6.12) shows a triangle ABC with two lines - DE and D'E' - drawn across it to illustrate the proof of Theorem 6.2 about parallel lines and proportional segments. The figure demonstrates the geometric construction used to prove that if a line divides two sides of a triangle in the same ratio, then it must be parallel to the third side.",
                "description_generated_at": "2025-07-19 11:49:46"
            },
            {
                "name": "_page_10_Figure_1.jpeg",
                "path": "/home/content/converted_books/images/jemh106/_page_10_Figure_1.jpeg",
                "size_bytes": 143744,
                "description": "The image shows Example 2 from a geometry textbook, featuring a trapezium ABCD with parallel lines AB and DC, along with points E and F on the non-parallel sides creating line EF parallel to AB. The example demonstrates how to prove a proportion relationship (AE/ED = BF/FC) using properties of parallel lines and similar triangles, with two accompanying diagrams (Fig. 6.14 and 6.15) illustrating the geometric construction and solution steps.",
                "description_generated_at": "2025-07-19 11:49:46"
            },
            {
                "name": "_page_11_Figure_5.jpeg",
                "path": "/home/content/converted_books/images/jemh106/_page_11_Figure_5.jpeg",
                "size_bytes": 104622,
                "description": "This image shows Exercise 6.2 from a geometry chapter, containing four practice problems with labeled diagrams involving triangles and parallel lines. The problems focus on applying theorems about parallel lines in triangles to find missing lengths, prove relationships between segments, and determine whether lines are parallel using given measurements.",
                "description_generated_at": "2025-07-19 11:49:46"
            },
            {
                "name": "_page_12_Figure_7.jpeg",
                "path": "/home/content/converted_books/images/jemh106/_page_12_Figure_7.jpeg",
                "size_bytes": 10590,
                "description": "This diagram shows triangle PQR with point O inside it, where lines DE and DF are drawn parallel to sides OQ and OR respectively, creating smaller triangles within the main triangle. The figure is used to demonstrate properties of parallel lines in triangles and prove that EF is parallel to QR using geometric theorems.",
                "description_generated_at": "2025-07-19 11:49:46"
            },
            {
                "name": "_page_12_Figure_9.jpeg",
                "path": "/home/content/converted_books/images/jemh106/_page_12_Figure_9.jpeg",
                "size_bytes": 14003,
                "description": "This diagram shows Figure 6.21, which illustrates a geometric configuration with triangle PQR and point O inside it, where points A, B, and C lie on sides OP, OQ, and OR respectively. The figure is used to demonstrate the relationship between parallel lines AB || PQ and AC || PR, and to prove that BC || QR using properties of similar triangles.",
                "description_generated_at": "2025-07-19 11:49:46"
            },
            {
                "name": "_page_13_Figure_7.jpeg",
                "path": "/home/content/converted_books/images/jemh106/_page_13_Figure_7.jpeg",
                "size_bytes": 22725,
                "description": "This diagram shows two triangles (ABC and DEF) constructed with corresponding angles of 60° and 40°, where triangle ABC has a base BC of 3 cm and triangle DEF has a base EF of 5 cm. The image demonstrates an activity to explore triangle similarity by showing that when two triangles have equal corresponding angles, their corresponding sides are proportional (in this case, with a ratio of 3:5 or 0.6).",
                "description_generated_at": "2025-07-19 11:49:46"
            },
            {
                "name": "_page_15_Figure_5.jpeg",
                "path": "/home/content/converted_books/images/jemh106/_page_15_Figure_5.jpeg",
                "size_bytes": 32395,
                "description": "The image shows two triangles ABC and DEF with labeled side lengths (ABC has sides 3 cm, 6 cm, and 8 cm while DEF has sides 4.5 cm, 9 cm, and 12 cm), demonstrating that their corresponding sides are proportional with a ratio of 2:3. This diagram is used to illustrate the SSS similarity criterion, showing that when triangles have proportional sides, their corresponding angles are also equal, making the triangles similar.",
                "description_generated_at": "2025-07-19 11:49:46"
            },
            {
                "name": "_page_16_Figure_1.jpeg",
                "path": "/home/content/converted_books/images/jemh106/_page_16_Figure_1.jpeg",
                "size_bytes": 66173,
                "description": "The image shows two triangles - triangle ABC on the left and triangle DEF on the right, with an additional construction where points P and Q are marked on triangle DEF with a dashed line PQ. This diagram illustrates the geometric proof for the SSS similarity criterion, demonstrating how to construct congruent triangles within similar triangles to prove that proportional sides lead to equal corresponding angles.",
                "description_generated_at": "2025-07-19 11:49:46"
            },
            {
                "name": "_page_17_Figure_1.jpeg",
                "path": "/home/content/converted_books/images/jemh106/_page_17_Figure_1.jpeg",
                "size_bytes": 15115,
                "description": "The image shows two triangles ABC and DEF drawn according to the given specifications, where triangle ABC has sides AB = 2 cm, AC = 4 cm with angle A = 50°, and triangle DEF has sides DE = 3 cm, DF = 6 cm with angle D = 50°. This diagram illustrates the SAS (Side-Angle-Side) similarity criterion by showing two triangles that have proportional sides (ratio 2:3) and equal included angles, demonstrating that such triangles are similar.",
                "description_generated_at": "2025-07-19 11:49:46"
            },
            {
                "name": "_page_17_Figure_2.jpeg",
                "path": "/home/content/converted_books/images/jemh106/_page_17_Figure_2.jpeg",
                "size_bytes": 1890,
                "description": "This image shows two triangles ABC and DEF drawn as part of an activity to demonstrate the SAS (Side-Angle-Side) similarity criterion. Triangle ABC has sides AB = 2 cm, AC = 4 cm with an included angle A = 50°, while triangle DEF has sides DE = 3 cm, DF = 6 cm with an included angle D = 50°, illustrating how triangles can be similar when they have proportional sides and equal included angles.",
                "description_generated_at": "2025-07-19 11:49:46"
            },
            {
                "name": "_page_17_Figure_9.jpeg",
                "path": "/home/content/converted_books/images/jemh106/_page_17_Figure_9.jpeg",
                "size_bytes": 12021,
                "description": "This image shows two triangles - triangle ABC on the left and triangle DEF on the right, with points P and Q marked on the sides of triangle DEF and connected by a dashed line. The diagram illustrates the geometric proof for the SAS (Side-Angle-Side) similarity criterion, demonstrating how cutting equal segments DP = AB and DQ = AC helps prove that triangles ABC and DEF are similar.",
                "description_generated_at": "2025-07-19 11:49:46"
            },
            {
                "name": "_page_17_Figure_10.jpeg",
                "path": "/home/content/converted_books/images/jemh106/_page_17_Figure_10.jpeg",
                "size_bytes": 1906,
                "description": "This diagram illustrates the SAS (Side-Angle-Side) similarity theorem by showing two triangles ABC and DEF where angle A equals angle D, and the sides including these angles are proportional (AB/DE = AC/DF). The figure demonstrates the geometric construction used in the theorem's proof, where a smaller triangle DPQ is created within triangle DEF to establish the similarity relationship.",
                "description_generated_at": "2025-07-19 11:49:46"
            },
            {
                "name": "_page_18_Figure_4.jpeg",
                "path": "/home/content/converted_books/images/jemh106/_page_18_Figure_4.jpeg",
                "size_bytes": 74854,
                "description": "This image shows two geometric diagrams used to demonstrate triangle similarity concepts. Figure 6.29 displays two intersecting triangles (POQ and SOR) with parallel lines PQ and RS, used to prove triangle similarity using the AAA criterion, while Figure 6.30 shows two separate triangles (ABC and PQR) with labeled side lengths and angles to illustrate the SSS similarity criterion.",
                "description_generated_at": "2025-07-19 11:49:46"
            },
            {
                "name": "_page_19_Figure_7.jpeg",
                "path": "/home/content/converted_books/images/jemh106/_page_19_Figure_7.jpeg",
                "size_bytes": 12927,
                "description": "This diagram illustrates a shadow problem where a lamp-post (AB) casts a shadow of a girl (CD) on the ground. The figure shows the geometric relationship between the lamp-post, the girl walking away from it, and her shadow (DE), demonstrating how similar triangles are used to solve real-world problems involving shadows and heights.",
                "description_generated_at": "2025-07-19 11:49:46"
            },
            {
                "name": "_page_19_Figure_8.jpeg",
                "path": "/home/content/converted_books/images/jemh106/_page_19_Figure_8.jpeg",
                "size_bytes": 1871,
                "description": "This diagram illustrates a similar triangles problem involving a lamp-post, a girl, and her shadow, where triangle ABE (formed by the lamp-post, ground, and light ray) is similar to triangle CDE (formed by the girl, her shadow, and the same light ray). The figure shows the geometric setup needed to calculate the length of the girl's shadow using proportional relationships between corresponding sides of similar triangles.",
                "description_generated_at": "2025-07-19 11:49:46"
            },
            {
                "name": "_page_22_Figure_1.jpeg",
                "path": "/home/content/converted_books/images/jemh106/_page_22_Figure_1.jpeg",
                "size_bytes": 76633,
                "description": "This image shows Figure 6.34, which contains six different pairs of triangles labeled (i) through (vi), each with marked angles and side lengths. The figure is designed as an exercise for students to identify which pairs of triangles are similar and determine the similarity criteria (such as AA, SAS, or SSS) that apply to each pair.",
                "description_generated_at": "2025-07-19 11:49:46"
            },
            {
                "name": "_page_22_Figure_5.jpeg",
                "path": "/home/content/converted_books/images/jemh106/_page_22_Figure_5.jpeg",
                "size_bytes": 8861,
                "description": "This geometric diagram shows two parallel lines intersected by two other lines, forming triangles with point O at the intersection. The diagram is labeled with points A, B, C, D, and O, with two marked angles: 70° and 125°, and is used to demonstrate triangle similarity relationships in the context of Exercise 6.3, problem 2.",
                "description_generated_at": "2025-07-19 11:49:46"
            },
            {
                "name": "_page_23_Figure_17.jpeg",
                "path": "/home/content/converted_books/images/jemh106/_page_23_Figure_17.jpeg",
                "size_bytes": 44348,
                "description": "This image shows four geometric diagrams (Fig. 6.36, 6.37, 6.38, and 6.39) featuring triangles with various points, lines, and intersections labeled with letters. These diagrams are used to illustrate problems involving similar triangles, altitudes, angle bisectors, and right triangles in the context of geometric proofs and proportional relationships.",
                "description_generated_at": "2025-07-19 11:49:46"
            },
            {
                "name": "_page_23_Figure_18.jpeg",
                "path": "/home/content/converted_books/images/jemh106/_page_23_Figure_18.jpeg",
                "size_bytes": 1938,
                "description": "This image shows Figure 6.39, which depicts two right triangles ABC and AMP that are right-angled at points B and M respectively. The diagram is used to illustrate a geometry problem about proving triangle similarity and proportional relationships between corresponding sides of the two right triangles.",
                "description_generated_at": "2025-07-19 11:49:46"
            },
            {
                "name": "_page_24_Figure_5.jpeg",
                "path": "/home/content/converted_books/images/jemh106/_page_24_Figure_5.jpeg",
                "size_bytes": 22350,
                "description": "This image shows two geometric diagrams labeled Fig. 6.40 and Fig. 6.41. Fig. 6.40 depicts an isosceles triangle ABC with point E on the extended side CB, and perpendicular lines AD and EF drawn to illustrate triangle similarity, while Fig. 6.41 shows two triangles ABC and PQR with their respective medians AD and PM to demonstrate proportional relationships between corresponding sides and medians.",
                "description_generated_at": "2025-07-19 11:49:46"
            }
        ],
        "exercises": [
            {
                "question": "Fill in the blanks using the correct word given in brackets: (i) All circles are ___. (congruent, similar) (ii) All squares are ___. (similar, congruent) (iii) All ___ triangles are similar. (isosceles, equilateral) (iv) Two polygons of the same number of sides are similar, if (a) their corresponding angles are ___ and (b) their corresponding sides are ___. (equal, proportional)",
                "answer": "(i) similar - All circles have the same shape (round) but different sizes (radii), so they are similar but not congruent. (ii) similar - All squares have the same shape but can have different side lengths, making them similar but not necessarily congruent. (iii) equilateral - All equilateral triangles have the same angles (60° each) and the same shape, making them similar regardless of side length. (iv) (a) equal, (b) proportional - For two polygons to be similar, their corresponding angles must be equal and their corresponding sides must be in the same ratio (proportional)."
            },
            {
                "question": "Give two different examples of pair of (i) similar figures. (ii) non-similar figures.",
                "answer": "(i) Similar figures examples: 1) Two photographs of the same person in different sizes (passport size and poster size), 2) Two equilateral triangles with different side lengths. (ii) Non-similar figures examples: 1) A circle and a square - they have completely different shapes, 2) A rectangle and a rhombus - even if their sides are proportional, their corresponding angles are not equal."
            },
            {
                "question": "State whether the following quadrilaterals are similar or not: [referring to Fig. 6.8]",
                "answer": "Without being able to see the specific measurements in Fig. 6.8, the general approach is: Two quadrilaterals are similar if (i) all corresponding angles are equal and (ii) all corresponding sides are in the same ratio. You need to check both conditions. If the quadrilaterals shown have equal corresponding angles but sides not in proportion, or proportional sides but unequal angles, they are not similar. Both conditions must be satisfied simultaneously for similarity."
            },
            {
                "question": "In Fig. 6.17, POQ = PRQ, then prove that triangles POS and PQR are similar.",
                "answer": "Given: ∠POQ = ∠PRQ. To prove: △POS ~ △PQR. Proof: In triangles POS and PQR: ∠POQ = ∠PRQ (given). ∠P is common to both triangles. Therefore, ∠PSO = ∠PQR (since the sum of angles in a triangle is 180°). By AA similarity criterion (two angles of one triangle are equal to two angles of another triangle), △POS ~ △PQR."
            },
            {
                "question": "In Fig. 6.18, ∠1 = ∠2 and ∠NSQ = ∠MTR, then prove that △PTS ~ △PRQ.",
                "answer": "Given: ∠1 = ∠2 and ∠NSQ = ∠MTR. In triangles PTS and PRQ: ∠1 = ∠2 (given), which means ∠SPT = ∠QPR. ∠P is common to both triangles. Therefore, by AA similarity criterion, △PTS ~ △PRQ. The third angles ∠PTS and ∠PQR are also equal as the sum of angles in both triangles is 180°."
            },
            {
                "question": "In Fig. 6.19, if ∠A = ∠C, then prove that △AOB ~ △COD.",
                "answer": "Given: ∠A = ∠C. To prove: △AOB ~ △COD. Proof: In triangles AOB and COD: ∠A = ∠C (given). ∠AOB = ∠COD (vertically opposite angles). Therefore, by AA similarity criterion, △AOB ~ △COD. The third angles ∠B and ∠D are also equal since corresponding angles of similar triangles are equal."
            },
            {
                "question": "In Fig. 6.20, DE || OQ and DF || OR. Show that EF || QR.",
                "answer": "Given: DE || OQ and DF || OR. In triangle POQ, since DE || OQ, by Basic Proportionality Theorem: PD/DO = PE/EQ. In triangle POR, since DF || OR, by Basic Proportionality Theorem: PD/DO = PF/FR. From these two equations: PE/EQ = PF/FR. By the converse of Basic Proportionality Theorem, since E and F divide sides PQ and PR in the same ratio, EF || QR."
            },
            {
                "question": "In Fig. 6.21, A, B and C are points on OP, OQ and OR respectively such that AB || PQ and AC || PR. Show that BC || QR.",
                "answer": "Given: AB || PQ and AC || PR. Since AB || PQ, by Basic Proportionality Theorem in triangle OPQ: OA/AP = OB/BQ. Since AC || PR, by Basic Proportionality Theorem in triangle OPR: OA/AP = OC/CR. Therefore: OB/BQ = OC/CR. By the converse of Basic Proportionality Theorem, since B and C divide sides OQ and OR in the same ratio, BC || QR."
            },
            {
                "question": "Using Theorem 6.1, prove that a line drawn through the mid-point of one side of a triangle parallel to another side bisects the third side.",
                "answer": "Given: In triangle ABC, D is the midpoint of AB, and DE || BC where E is on AC. To prove: E is the midpoint of AC. Proof: Since D is the midpoint of AB, AD = DB, so AD/DB = 1. Since DE || BC, by Basic Proportionality Theorem: AD/DB = AE/EC. Therefore: AE/EC = 1, which means AE = EC. Hence, E is the midpoint of AC."
            },
            {
                "question": "Using Theorem 6.2, prove that the line joining the mid-points of any two sides of a triangle is parallel to the third side.",
                "answer": "Given: In triangle ABC, D and E are midpoints of sides AB and AC respectively. To prove: DE || BC. Proof: Since D is the midpoint of AB: AD/DB = 1. Since E is the midpoint of AC: AE/EC = 1. Therefore: AD/DB = AE/EC = 1. By Theorem 6.2 (converse of Basic Proportionality Theorem), since D and E divide sides AB and AC in the same ratio, DE || BC."
            },
            {
                "question": "ABCD is a trapezium in which AB || DC and its diagonals intersect each other at the point O. Show that AO/BO = CO/DO.",
                "answer": "Given: ABCD is a trapezium with AB || DC, diagonals AC and BD intersect at O. In triangles AOB and COD: ∠OAB = ∠OCD (alternate angles, since AB || DC). ∠OBA = ∠ODC (alternate angles, since AB || DC). ∠AOB = ∠COD (vertically opposite angles). Therefore, △AOB ~ △COD by AAA similarity. From similar triangles: AO/CO = BO/DO = AB/CD. Cross-multiplying: AO × DO = BO × CO, which gives AO/BO = CO/DO."
            },
            {
                "question": "The diagonals of a quadrilateral ABCD intersect each other at the point O such that AO/BO = CO/DO. Show that ABCD is a trapezium.",
                "answer": "Given: AO/BO = CO/DO. This can be rewritten as AO/CO = BO/DO. In triangles AOB and COD: AO/CO = BO/DO (given). ∠AOB = ∠COD (vertically opposite angles). By SAS similarity criterion, △AOB ~ △COD. Therefore, corresponding angles are equal: ∠OAB = ∠OCD and ∠OBA = ∠ODC. These are alternate angles, which means AB || DC. Hence, ABCD is a trapezium with AB || DC."
            },
            {
                "question": "State which pairs of triangles in Fig. 6.34 are similar. Write the similarity criterion used and write the pairs of similar triangles in symbolic form.",
                "answer": "Without seeing Fig. 6.34, the general approach is: Check each pair of triangles for: (i) AA criterion: If two angles of one triangle equal two angles of another. (ii) SSS criterion: If all corresponding sides are proportional. (iii) SAS criterion: If two sides are proportional and included angles are equal. Write similar triangles ensuring correct correspondence of vertices, e.g., △ABC ~ △DEF means A↔D, B↔E, C↔F."
            },
            {
                "question": "In Fig. 6.35, △ODC ~ △OBA, ∠BOC = 125° and ∠CDO = 70°. Find ∠DOC, ∠DCO and ∠OAB.",
                "answer": "Given: △ODC ~ △OBA, ∠BOC = 125°, ∠CDO = 70°. Since ∠BOC = 125°, ∠DOC = 180° - 125° = 55° (linear pair). In △ODC: ∠CDO = 70°, ∠DOC = 55°. Therefore, ∠DCO = 180° - 70° - 55° = 55°. Since △ODC ~ △OBA, corresponding angles are equal: ∠CDO = ∠BAO, so ∠OAB = 70°. Therefore: ∠DOC = 55°, ∠DCO = 55°, ∠OAB = 70°."
            },
            {
                "question": "Diagonals AC and BD of a trapezium ABCD with AB || DC intersect each other at the point O. Using a similarity criterion for two triangles, show that OA/OC = OB/OD.",
                "answer": "Given: ABCD is a trapezium with AB || DC. In triangles AOB and COD: ∠BAO = ∠DCO (alternate angles, AB || DC). ∠ABO = ∠CDO (alternate angles, AB || DC). By AA similarity criterion, △AOB ~ △COD. From similar triangles, corresponding sides are proportional: AO/CO = BO/DO = AB/CD. Therefore, OA/OC = OB/OD."
            },
            {
                "question": "A vertical pole of length 6 m casts a shadow 4 m long on the ground and at the same time a tower casts a shadow 28 m long. Find the height of the tower.",
                "answer": "Let the height of the tower be h meters. Since both the pole and tower are casting shadows at the same time, the sun's rays make the same angle with the ground for both objects. This creates similar right triangles. For the pole: height/shadow = 6/4 = 3/2. For the tower: height/shadow = h/28. Since the triangles are similar: h/28 = 6/4 = 3/2. Therefore: h = 28 × 3/2 = 42 meters. The height of the tower is 42 meters."
            }
        ],
        "summary": {
            "title": "Triangles - Similarity",
            "key_concepts": [
                "Similar figures have the same shape but not necessarily the same size",
                "Basic Proportionality Theorem (Thales Theorem) - if a line is parallel to one side of a triangle, it divides the other two sides proportionally",
                "AAA/AA Similarity Criterion - triangles are similar if corresponding angles are equal",
                "SSS Similarity Criterion - triangles are similar if corresponding sides are proportional",
                "SAS Similarity Criterion - triangles are similar if one angle is equal and including sides are proportional"
            ],
            "summary": "This chapter introduces the concept of similarity, focusing particularly on similar triangles. Unlike congruence which requires same shape and size, similarity only requires same shape. The chapter establishes the Basic Proportionality Theorem and its converse, which form the foundation for triangle similarity. Three main criteria for triangle similarity are presented: AAA (or AA), SSS, and SAS similarity criteria. The chapter demonstrates practical applications of similarity through examples involving indirect measurement of heights and distances, showing how similarity principles are used in real-world problem solving. The concepts build systematically from basic proportionality to comprehensive similarity criteria, providing students with tools to identify and work with similar triangles in various geometric contexts."
        }
    },
    "statistics": {
        "total_images": 33,
        "text_length": 37526,
        "processing_time": 19.22
    },
    "claude_processing": {
        "processed_at": "2025-07-19 11:06:44",
        "model_used": "claude-sonnet-4-20250514",
        "tasks_completed": [
            "exercises",
            "summary",
            "answers",
            "image_descriptions"
        ],
        "exercises_count": 16,
        "images_processed": 33,
        "last_updated": "2025-07-19 11:49:46",
        "images_reprocessed": 33
    }
}