{
    "id": "1ed496c2-dae8-449f-b2ba-a802b7506589",
    "title": "Real Numbers",
    "source_file": "/home/content/books/maths/jemh101.pdf",
    "filename": "jemh101.pdf",
    "subject": "maths",
    "conversion_timestamp": "2025-07-18T12:03:12.815001",
    "processing_time_seconds": 8.14,
    "metadata": "md",
    "content": {
        "markdown_text": "![](_page_0_Picture_0.jpeg)\n\n# **REAL NUMBERS**\n\n**1**\n\n# **1.1 Introduction**\n\nIn Class IX, you began your exploration of the world of real numbers and encountered irrational numbers. We continue our discussion on real numbers in this chapter. We begin with very important properties of positive integers in Sections 1.2, namely the Euclid's division algorithm and the Fundamental Theorem of Arithmetic.\n\nEuclid's division algorithm, as the name suggests, has to do with divisibility of integers. Stated simply, it says any positive integer *a* can be divided by another positive integer *b* in such a way that it leaves a remainder *r* that is smaller than *b*. Many of you probably recognise this as the usual long division process. Although this result is quite easy to state and understand, it has many applications related to the divisibility properties of integers. We touch upon a few of them, and use it mainly to compute the HCF of two positive integers.\n\nThe Fundamental Theorem of Arithmetic, on the other hand, has to do something with multiplication of positive integers. You already know that every composite number can be expressed as a product of primes in a unique way—this important fact is the Fundamental Theorem of Arithmetic. Again, while it is a result that is easy to state and understand, it has some very deep and significant applications in the field of mathematics. We use the Fundamental Theorem of Arithmetic for two main applications. First, we use it to prove the irrationality of many of the numbers you studied in Class IX, such as 2 , 3 and 5 . Second, we apply this theorem to explore when exactly the decimal expansion of a rational number, say ( 0) *<sup>p</sup> q q* , is terminating and when it is nonterminating repeating. We do so by looking at the prime factorisation of the denominator *<sup>q</sup>* of *<sup>p</sup> q* . You will see that the prime factorisation of *q* will completely reveal the nature of the decimal expansion of *<sup>p</sup> q* .\n\nSo let us begin our exploration.\n\n# **1.2 The Fundamental Theorem of Arithmetic**\n\nIn your earlier classes, you have seen that any natural number can be written as a product of its prime factors. For instance, 2 = 2, 4 = 2 × 2, 253 = 11 × 23, and so on. Now, let us try and look at natural numbers from the other direction. That is, can any natural number be obtained by multiplying prime numbers? Let us see.\n\nTake any collection of prime numbers, say 2, 3, 7, 11 and 23. If we multiply some or all of these numbers, allowing them to repeat as many times as we wish, we can produce a large collection of positive integers (In fact, infinitely many). Let us list a few :\n\n7 × 11 × 23 = 1771 3 × 7 × 11 × 23 = 5313 2 × 3 × 7 × 11 × 23 = 10626 2 3 × 3 × 7<sup>3</sup> = 8232 2 2 × 3 × 7 × 11 × 23 = 21252\n\nand so on.\n\nNow, let us suppose your collection of primes includes all the possible primes. What is your guess about the size of this collection? Does it contain only a finite number of integers, or infinitely many? Infact, there are infinitely many primes. So, if we combine all these primes in all possible ways, we will get an infinite\n\ncollection of numbers, all the primes and all possible products of primes. The question is – can we produce all the composite numbers this way? What do you think? Do you think that there may be a composite number which is not the product of powers of primes? Before we answer this, let us factorise positive integers, that is, do the opposite of what we have done so far.\n\nWe are going to use the factor tree with which you are all familiar. Let us take some large number, say, 32760, and factorise it as shown.\n\n![](_page_1_Figure_9.jpeg)\n\nSo we have factorised 32760 as 2 × 2 × 2 × 3 × 3 × 5 × 7 × 13 as a product of primes, i.e., 32760 = 2<sup>3</sup> × 3<sup>2</sup> × 5 × 7 × 13 as a product of powers of primes. Let us try another number, say, 123456789. This can be written as 3<sup>2</sup> × 3803 × 3607. Of course, you have to check that 3803 and 3607 are primes! (Try it out for several other natural numbers yourself.) This leads us to a conjecture that every composite number can be written as the product of powers of primes. In fact, this statement is true, and is called the **Fundamental Theorem of Arithmetic** because of its basic crucial importance to the study of integers. Let us now formally state this theorem.\n\n**Theorem 1.1 (Fundamental Theorem of Arithmetic) :** *Every composite number can be expressed* (*factorised*) *as a product of primes, and this factorisation is unique, apart from the order in which the prime factors occur.*\n\nAn equivalent version of Theorem 1.2 was probably first recorded as Proposition 14 of Book IX in Euclid's Elements, before it came to be known as the Fundamental Theorem of Arithmetic. However, the first correct proof was given by Carl Friedrich Gauss in his *Disquisitiones Arithmeticae*.\n\nCarl Friedrich Gauss is often referred to as the 'Prince of Mathematicians' and is considered one of the three greatest mathematicians of all time, along with Archimedes and Newton. He has made fundamental contributions to both mathematics and science.\n\n![](_page_2_Picture_5.jpeg)\n\n**(1777 – 1855)**\n\nThe Fundamental Theorem of Arithmetic says that every composite number can be factorised as a product of primes. Actually it says more. It says that given any composite number it can be factorised as a product of prime numbers in a **'unique'** way, except for the order in which the primes occur. That is, given any composite number there is one and only one way to write it as a product of primes, as long as we are not particular about the order in which the primes occur. So, for example, we regard 2 × 3 × 5 × 7 as the same as 3 × 5 × 7 × 2, or any other possible order in which these primes are written. This fact is also stated in the following form:\n\n*The prime factorisation of a natural number is unique, except for the order of its factors*.\n\nIn general, given a composite number *x*, we factorise it as *x* = *p*<sup>1</sup> *p*<sup>2</sup> ... *pn* , where *p*1 , *p*<sup>2</sup> ,..., *pn* are primes and written in ascending order, i.e., *p*<sup>1</sup> *p*<sup>2</sup> . . . *pn .* If we combine the same primes, we will get powers of primes. For example,\n\n32760 = 2 × 2 × 2 × 3 × 3 × 5 × 7 × 13 = 23 × 32 × 5 × 7 × 13\n\nOnce we have decided that the order will be ascending, then the way the number is factorised, is unique.\n\nThe Fundamental Theorem of Arithmetic has many applications, both within mathematics and in other fields. Let us look at some examples.\n\n**Example 1 :** Consider the numbers 4*<sup>n</sup>* , where *n* is a natural number. Check whether there is any value of *n* for which 4*<sup>n</sup>* ends with the digit zero.\n\n**Solution :** If the number 4*<sup>n</sup>* , for any *n*, were to end with the digit zero, then it would be divisible by 5. That is, the prime factorisation of 4*<sup>n</sup>* would contain the prime 5. This is not possible because 4*<sup>n</sup>* = (2)2*<sup>n</sup>* ; so the only prime in the factorisation of 4*<sup>n</sup>* is 2. So, the uniqueness of the Fundamental Theorem of Arithmetic guarantees that there are no other primes in the factorisation of 4*<sup>n</sup> .* So, there is no natural number *n* for which 4*<sup>n</sup>* ends with the digit zero.\n\nYou have already learnt how to find the HCF and LCM of two positive integers using the Fundamental Theorem of Arithmetic in earlier classes, without realising it! This method is also called the *prime factorisation method*. Let us recall this method through an example.\n\n**Example 2 :** Find the LCM and HCF of 6 and 20 by the prime factorisation method. **Solution :** We have : 6 = 21 × 31 and 20 = 2 × 2 × 5 = 22 × 51 .\n\nYou can find HCF(6, 20) = 2 and LCM(6, 20) = 2 × 2 × 3 × 5 = 60, as done in your earlier classes.\n\nNote that HCF(6, 20) = 21 = **Product of the smallest power of each common prime factor in the numbers.**\n\nLCM (6, 20) = 22 × 31 × 51 = **Product of the greatest power of each prime factor**, **involved in the numbers**.\n\nFrom the example above, you might have noticed that HCF(6, 20) × LCM(6, 20) = 6 × 20. In fact, we can verify that **for any two positive integers** *a* **and** *b***, HCF (***a***,** *b***) × LCM (***a***,** *b***) =** *a* **×** *b***.** We can use this result to find the LCM of two positive integers, if we have already found the HCF of the two positive integers.\n\n**Example 3:** Find the HCF of 96 and 404 by the prime factorisation method. Hence, find their LCM.\n\n**Solution :** The prime factorisation of 96 and 404 gives :\n\n$$\n96 = 2^5 \\times 3, \\ 404 = 2^2 \\times 101\n$$\n\nTherefore, the HCF of these two integers is 22 = 4.\n\nAlso, LCM (96, 404) = \n$$\n\\frac{96 \\times 404}{\\text{HCF}(96, 404)} = \\frac{96 \\times 404}{4} = 9696\n$$\n\n**Example 4 :** Find the HCF and LCM of 6, 72 and 120, using the prime factorisation method.\n\n**Solution :** We have :\n\n$$\n6 = 2 \\times 3\n$$\n,  $72 = 2^3 \\times 3^2$ ,  $120 = 2^3 \\times 3 \\times 5$ \n\nHere, 21 and 31 are the smallest powers of the common factors 2 and 3, respectively.\n\nSo, HCF (6, 72, 120) = \n$$\n2^1 \\times 3^1 = 2 \\times 3 = 6\n$$\n\n23 , 32 and 51 are the greatest powers of the prime factors 2, 3 and 5 respectively involved in the three numbers.\n\nSo, LCM (6, 72, 120) = 23 × 32 × 51 = 360\n\n**Remark :** Notice, 6 × 72 × 120 HCF (6, 72, 120) × LCM (6, 72, 120). So, the product of three numbers is not equal to the product of their HCF and LCM.\n\n### **EXERCISE 1.1**\n\n- **1.** Express each number as a product of its prime factors:\n  - (i) 140 (ii) 156 (iii) 3825 (iv) 5005 (v) 7429\n- **2.** Find the LCM and HCF of the following pairs of integers and verify that LCM × HCF = product of the two numbers.\n  - (i) 26 and 91 (ii) 510 and 92 (iii) 336 and 54\n- **3.** Find the LCM and HCF of the following integers by applying the prime factorisation method.\n  - (i) 12, 15 and 21 (ii) 17, 23 and 29 (iii) 8, 9 and 25\n- **4.** Given that HCF (306, 657) = 9, find LCM (306, 657).\n- **5.** Check whether 6*<sup>n</sup>* can end with the digit 0 for any natural number *n*.\n- **6.** Explain why 7 × 11 × 13 + 13 and 7 × 6 × 5 × 4 × 3 × 2 × 1 + 5 are composite numbers.\n- **7.** There is a circular path around a sports field. Sonia takes 18 minutes to drive one round of the field, while Ravi takes 12 minutes for the same. Suppose they both start at the\n\nsame point and at the same time, and go in the same direction. After how many minutes will they meet again at the starting point?\n\n## **1.3 Revisiting Irrational Numbers**\n\nIn Class IX, you were introduced to irrational numbers and many of their properties. You studied about their existence and how the rationals and the irrationals together made up the real numbers. You even studied how to locate irrationals on the number line. However, we did not prove that they were irrationals. In this section, we will prove that 2 , 3 , 5 and, in general, *p* is irrational, where *p* is a prime. One of the theorems, we use in our proof, is the Fundamental Theorem of Arithmetic.\n\nRecall, a number '*s*' is called *irrational* if it cannot be written in the form , *p q* where *p* and *q* are integers and *q* ¹ 0. Some examples of irrational numbers, with which you are already familiar, are :\n\n$$\n\\sqrt{2}, \\sqrt{3}, \\sqrt{15}, \\pi, -\\frac{\\sqrt{2}}{\\sqrt{3}}, 0.10110111011110..., \\text{ etc.}\n$$\n\nBefore we prove that 2 is irrational, we need the following theorem, whose proof is based on the Fundamental Theorem of Arithmetic.\n\n**Theorem 1.2 :** *Let p be a prime number. If p divides a<sup>2</sup> , then p divides a, where a is a positive integer.*\n\n**\\*Proof :** Let the prime factorisation of *a* be as follows :\n\n*a* = *p*<sup>1</sup> *p*2 . . . *p<sup>n</sup>* , where *p*<sup>1</sup> ,*p*2 , . . ., *p<sup>n</sup>* are primes, not necessarily distinct.\n\nTherefore, *a* 2 = ( *p*<sup>1</sup> *p*2 . . . *p<sup>n</sup>* )( *p*<sup>1</sup> *p*2 . . . *p<sup>n</sup>* ) = *p* 2 1 *p* 2 2 . . . *p* 2 *n* .\n\nNow, we are given that *p* divides *a* 2 . Therefore, from the Fundamental Theorem of Arithmetic, it follows that *p* is one of the prime factors of *a* 2 . However, using the uniqueness part of the Fundamental Theorem of Arithmetic, we realise that the only prime factors of *a* 2 are *p*<sup>1</sup> , *p*<sup>2</sup> , . . ., *p<sup>n</sup>* . So *p* is one of *p*<sup>1</sup> , *p*<sup>2</sup> , . . ., *p<sup>n</sup>* .\n\nNow, since *a* = *p*<sup>1</sup> *p*2 . . . *p<sup>n</sup>* , *p* divides *a*.\n\nWe are now ready to give a proof that 2 is irrational.\n\nThe proof is based on a technique called 'proof by contradiction'. (This technique is discussed in some detail in Appendix 1).\n\n**Theorem 1.3 :** 2 *is irrational.*\n\n**Proof :** Let us assume, to the contrary, that 2 is rational.\n\n<sup>\\*</sup> Not from the examination point of view.\n\nSo, we can find integers *r* and *s* (¹ 0) such that 2<sup>=</sup> *r s* .\n\nSuppose *r* and *s* have a common factor other than 1. Then, we divide by the common\n\nfactor to get \n$$\n\\sqrt{2} = \\frac{a}{b}\n$$\n, where *a* and *b* are coprime.\n\nSo, *b* 2 = *a*.\n\nSquaring on both sides and rearranging, we get 2*b* 2 = *a* 2 . Therefore, 2 divides *a* 2 .\n\nNow, by Theorem 1.2, it follows that 2 divides *a*.\n\nSo, we can write *a* = 2*c* for some integer *c*.\n\nSubstituting for *a*, we get 2*b* 2 = 4*c* 2 , that is, *b* 2 = 2*c* 2 .\n\nThis means that 2 divides *b* 2 , and so 2 divides *b* (again using Theorem 1.2 with *p* = 2). Therefore, *a* and *b* have at least 2 as a common factor.\n\nBut this contradicts the fact that *a* and *b* have no common factors other than 1.\n\nThis contradiction has arisen because of our incorrect assumption that 2 is rational.\n\nSo, we conclude that 2 is irrational.\n\n**Example 5 :** Prove that 3 is irrational.\n\n**Solution :** Let us assume, to the contrary, that 3 is rational.\n\nThat is, we can find integers *a* and *b* (¹ 0) such that 3 = *a b*\n\nSuppose *a* and *b* have a common factor other than 1, then we can divide by the common factor, and assume that *a* and *b* are coprime.\n\nSo, *b a* 3\n\nSquaring on both sides, and rearranging, we get 3*b* 2 = *a* 2 .\n\nTherefore, *a* 2 is divisible by 3, and by Theorem 1.2, it follows that *a* is also divisible by 3.\n\nSo, we can write *a* = 3*c* for some integer *c*.\n\nSubstituting for *a*, we get 3*b* 2 = 9*c* 2 , that is, *b* 2 = 3*c* 2 .\n\nThis means that *b* 2 is divisible by 3, and so *b* is also divisible by 3 (using Theorem 1.2 with *p* = 3).\n\nTherefore, *a* and *b* have at least 3 as a common factor.\n\nBut this contradicts the fact that *a* and *b* are coprime.\n\nThis contradiction has arisen because of our incorrect assumption that 3 is rational. So, we conclude that 3 is irrational.\n\nIn Class IX, we mentioned that :\n\n- the sum or difference of a rational and an irrational number is irrational and\n- the product and quotient of a non-zero rational and irrational number is irrational.\n\nWe prove some particular cases here.\n\n**Example 6 :** Show that 5– 3 is irrational.\n\n**Solution :** Let us assume, to the contrary, that 5– 3 is rational.\n\nThat is, we can find coprime *a* and *b* (*<sup>b</sup>* 0) such that 5 3 *<sup>a</sup> <sup>b</sup>*\n\nTherefore, 5 3 *<sup>a</sup> <sup>b</sup>*\n\nRearranging this equation, we get <sup>5</sup> 3 5– *a ba b b*\n\nSince *a* and *b* are integers, we get 5 – *<sup>a</sup> b* is rational, and so 3 is rational. But this contradicts the fact that 3 is irrational.\n\nThis contradiction has arisen because of our incorrect assumption that 5 – 3 is rational.\n\nSo, we conclude that 5 3 is irrational.\n\n**Example 7 :** Show that 3 2 is irrational. **Solution :** Let us assume, to the contrary, that 3 2 is rational.\n\nThat is, we can find coprime *a* and *b* (*b*  0) such that 3 2 *<sup>a</sup> <sup>b</sup>*\n\nRearranging, we get 2 3 *a <sup>b</sup>* Since 3, *a* and *b* are integers, 3 *a <sup>b</sup>* is rational, and so 2 is rational. But this contradicts the fact that 2 is irrational. So, we conclude that 3 2 is irrational.\n\n### **EXERCISE 1.2**\n\n- **1.** Prove that 5 is irrational.\n- **2.** Prove that 3 25 is irrational.\n- **3.** Prove that the following are irrationals :\n\n(i) \n$$\n\\frac{1}{\\sqrt{2}}\n$$\n (ii)  $7\\sqrt{5}$  (iii)  $6 + \\sqrt{2}$ \n\n## **1.4 Summary**\n\nIn this chapter, you have studied the following points:\n\n**1.** The Fundamental Theorem of Arithmetic :\n\nEvery composite number can be expressed (factorised) as a product of primes, and this factorisation is unique, apart from the order in which the prime factors occur.\n\n- **2.** If *p* is a prime and *p* divides *a*<sup>2</sup> , then *p* divides *a*, where *a* is a positive integer.\n- **3.** To prove that 2, 3 are irrationals.\n\n## **A NOTE TO THE READER**\n\nYou have seen that :\n\nHCF ( *p*, *q*, *r*) × LCM (*p*, *q*, *r*) *p* × *q* × *r*, where *p*, *q*, *r* are positive integers (see Example 8). However, the following results hold good for three numbers *p*, *q* and *r* :\n\n$$\nLCM (p, q, r) = \\frac{p \\cdot q \\cdot r \\cdot HCF(p, q, r)}{HCF(p, q) \\cdot HCF(q, r) \\cdot HCF(p, r)}\n$$\n$$\nHCF (p, q, r) = \\frac{p \\cdot q \\cdot r \\cdot LCM(p, q, r)}{LCM(p, q) \\cdot LCM(q, r) \\cdot LCM(p, r)}\n$$",
        "structured_data": {
            "error": "No structured data available"
        },
        "images": [
            {
                "name": "_page_0_Picture_0.jpeg",
                "path": "/home/content/converted_books/images/jemh101/_page_0_Picture_0.jpeg",
                "size_bytes": 14119,
                "description": "The image shows a QR code with the text \"1062CH01\" below it. This QR code likely provides digital access to additional resources, exercises, or supplementary materials related to Chapter 1 on Real Numbers.",
                "description_generated_at": "2025-07-19 11:47:37"
            },
            {
                "name": "_page_1_Figure_9.jpeg",
                "path": "/home/content/converted_books/images/jemh101/_page_1_Figure_9.jpeg",
                "size_bytes": 32744,
                "description": "This image shows a factor tree diagram that systematically breaks down the number 32760 into its prime factors. Starting from 32760 at the top, the tree branches downward showing each step of division (32760 ÷ 2 = 16380, then 16380 ÷ 2 = 8190, etc.) until all the prime factors (2, 2, 2, 3, 3, 5, 7, 13) are identified at the bottom branches.",
                "description_generated_at": "2025-07-19 11:47:37"
            },
            {
                "name": "_page_2_Picture_5.jpeg",
                "path": "/home/content/converted_books/images/jemh101/_page_2_Picture_5.jpeg",
                "size_bytes": 19675,
                "description": "This image shows a portrait of Carl Friedrich Gauss in an oval frame with his name labeled below. The portrait serves to introduce students to the famous mathematician who provided the first correct proof of the Fundamental Theorem of Arithmetic being discussed in the text.",
                "description_generated_at": "2025-07-19 11:47:37"
            }
        ],
        "exercises": [
            {
                "question": "Express each number as a product of its prime factors: (i) 140 (ii) 156 (iii) 3825 (iv) 5005 (v) 7429",
                "answer": "(i) 140 = 4 × 35 = 4 × 5 × 7 = 2² × 5 × 7\n(ii) 156 = 4 × 39 = 4 × 3 × 13 = 2² × 3 × 13\n(iii) 3825 = 25 × 153 = 25 × 9 × 17 = 5² × 3² × 17\n(iv) 5005 = 5 × 1001 = 5 × 7 × 143 = 5 × 7 × 11 × 13\n(v) 7429 = 17 × 437 = 17 × 19 × 23\n\nTo find prime factorization, we repeatedly divide by prime numbers starting from the smallest prime (2) and continue until we get 1. We can use factor trees or division method to systematically break down each number into its prime components."
            },
            {
                "question": "Find the LCM and HCF of the following pairs of integers and verify that LCM × HCF = product of the two numbers: (i) 26 and 91 (ii) 510 and 92 (iii) 336 and 54",
                "answer": "(i) 26 = 2 × 13, 91 = 7 × 13\nHCF(26, 91) = 13 (common factor)\nLCM(26, 91) = 2 × 7 × 13 = 182\nVerification: HCF × LCM = 13 × 182 = 2366 = 26 × 91 ✓\n\n(ii) 510 = 2 × 3 × 5 × 17, 92 = 2² × 23\nHCF(510, 92) = 2\nLCM(510, 92) = 2² × 3 × 5 × 17 × 23 = 23460\nVerification: HCF × LCM = 2 × 23460 = 46920 = 510 × 92 ✓\n\n(iii) 336 = 2⁴ × 3 × 7, 54 = 2 × 3³\nHCF(336, 54) = 2 × 3 = 6\nLCM(336, 54) = 2⁴ × 3³ × 7 = 3024\nVerification: HCF × LCM = 6 × 3024 = 18144 = 336 × 54 ✓"
            },
            {
                "question": "Find the LCM and HCF of the following integers by applying the prime factorisation method: (i) 12, 15 and 21 (ii) 17, 23 and 29 (iii) 8, 9 and 25",
                "answer": "(i) 12 = 2² × 3, 15 = 3 × 5, 21 = 3 × 7\nHCF(12, 15, 21) = 3 (smallest power of common prime factor)\nLCM(12, 15, 21) = 2² × 3 × 5 × 7 = 420\n\n(ii) 17 = 17, 23 = 23, 29 = 29\nSince all three are prime numbers with no common factors:\nHCF(17, 23, 29) = 1\nLCM(17, 23, 29) = 17 × 23 × 29 = 11339\n\n(iii) 8 = 2³, 9 = 3², 25 = 5²\nSince there are no common prime factors:\nHCF(8, 9, 25) = 1\nLCM(8, 9, 25) = 2³ × 3² × 5² = 8 × 9 × 25 = 1800"
            },
            {
                "question": "Given that HCF (306, 657) = 9, find LCM (306, 657).",
                "answer": "Using the relationship: HCF(a, b) × LCM(a, b) = a × b\n\nGiven: HCF(306, 657) = 9\n\nLCM(306, 657) = (306 × 657) / HCF(306, 657)\nLCM(306, 657) = (306 × 657) / 9\nLCM(306, 657) = 201042 / 9\nLCM(306, 657) = 22338\n\nTherefore, LCM(306, 657) = 22338"
            },
            {
                "question": "Check whether 6ⁿ can end with the digit 0 for any natural number n.",
                "answer": "For a number to end with digit 0, it must be divisible by 10, which means it must be divisible by both 2 and 5.\n\n6ⁿ = (2 × 3)ⁿ = 2ⁿ × 3ⁿ\n\nThe prime factorization of 6ⁿ contains only the primes 2 and 3. For 6ⁿ to end with 0, it must contain the prime factor 5 in its factorization.\n\nBy the Fundamental Theorem of Arithmetic, the prime factorization is unique. Since 6ⁿ = 2ⁿ × 3ⁿ contains only powers of 2 and 3, it cannot contain the prime factor 5.\n\nTherefore, 6ⁿ cannot end with the digit 0 for any natural number n."
            },
            {
                "question": "Explain why 7 × 11 × 13 + 13 and 7 × 6 × 5 × 4 × 3 × 2 × 1 + 5 are composite numbers.",
                "answer": "For 7 × 11 × 13 + 13:\n7 × 11 × 13 + 13 = 13(7 × 11 × 1 + 1) = 13(77 + 1) = 13 × 78\nSince this can be written as a product of 13 and 78 (both greater than 1), it is composite.\n\nFor 7 × 6 × 5 × 4 × 3 × 2 × 1 + 5:\n7 × 6 × 5 × 4 × 3 × 2 × 1 + 5 = 7! + 5\nSince 7! = 5040 contains 5 as a factor, we can write:\n7! + 5 = 5 × (some integer) + 5 = 5 × (some integer + 1)\nThis shows the number is divisible by 5 and greater than 5, making it composite.\n\nBoth numbers can be factored into products of integers greater than 1, which is the definition of composite numbers."
            },
            {
                "question": "There is a circular path around a sports field. Sonia takes 18 minutes to drive one round of the field, while Ravi takes 12 minutes for the same. Suppose they both start at the same point and at the same time, and go in the same direction. After how many minutes will they meet again at the starting point?",
                "answer": "To find when they meet again at the starting point, we need to find the LCM of their individual times.\n\nSonia's time = 18 minutes\nRavi's time = 12 minutes\n\nPrime factorization:\n18 = 2 × 3²\n12 = 2² × 3\n\nLCM(18, 12) = 2² × 3² = 4 × 9 = 36\n\nTherefore, they will meet again at the starting point after 36 minutes.\n\nVerification:\n- In 36 minutes, Sonia completes 36/18 = 2 rounds\n- In 36 minutes, Ravi completes 36/12 = 3 rounds\n\nBoth will be at the starting point after 36 minutes."
            },
            {
                "question": "Prove that √5 is irrational.",
                "answer": "Proof by contradiction:\n\nAssume √5 is rational. Then √5 = a/b where a and b are coprime integers and b ≠ 0.\n\nSquaring both sides: 5 = a²/b²\nRearranging: 5b² = a²\n\nThis means a² is divisible by 5.\nBy Theorem 1.2, if a prime p divides a², then p divides a.\nSince 5 is prime and divides a², then 5 divides a.\n\nSo a = 5k for some integer k.\nSubstituting: 5b² = (5k)² = 25k²\nSimplifying: b² = 5k²\n\nThis means b² is divisible by 5, so b is also divisible by 5.\n\nTherefore, both a and b are divisible by 5, contradicting our assumption that a and b are coprime.\n\nThis contradiction arose from assuming √5 is rational.\nTherefore, √5 is irrational."
            },
            {
                "question": "Prove that 3 + √5 is irrational.",
                "answer": "Proof by contradiction:\n\nAssume 3 + √5 is rational. Then 3 + √5 = a/b where a and b are coprime integers and b ≠ 0.\n\nRearranging: √5 = a/b - 3 = (a - 3b)/b\n\nSince a, b, and 3 are integers, (a - 3b) is also an integer.\nTherefore, (a - 3b)/b would be rational (quotient of two integers with b ≠ 0).\n\nThis would mean √5 is rational.\n\nBut we know from previous proofs that √5 is irrational.\n\nThis contradiction arose from our assumption that 3 + √5 is rational.\nTherefore, 3 + √5 is irrational.\n\nThis demonstrates the general principle: the sum of a rational number and an irrational number is always irrational."
            },
            {
                "question": "Prove that the following are irrationals: (i) 1/√2 (ii) 7√5 (iii) 6 + √2",
                "answer": "(i) Prove 1/√2 is irrational:\nAssume 1/√2 is rational, so 1/√2 = a/b where a, b are coprime integers, b ≠ 0.\nThen √2 = b/a, making √2 rational.\nBut √2 is irrational (proven earlier), contradiction.\nTherefore, 1/√2 is irrational.\n\n(ii) Prove 7√5 is irrational:\nAssume 7√5 is rational, so 7√5 = a/b where a, b are coprime integers, b ≠ 0.\nThen √5 = a/(7b), making √5 rational.\nBut √5 is irrational, contradiction.\nTherefore, 7√5 is irrational.\n\n(iii) Prove 6 + √2 is irrational:\nAssume 6 + √2 is rational, so 6 + √2 = a/b where a, b are coprime integers, b ≠ 0.\nThen √2 = a/b - 6 = (a - 6b)/b, making √2 rational.\nBut √2 is irrational, contradiction.\nTherefore, 6 + √2 is irrational.\n\nThese proofs use the principle that if we assume an irrational expression is rational, we can manipulate it to show a known irrational number is rational, creating a contradiction."
            }
        ],
        "summary": {
            "title": "Real Numbers",
            "key_concepts": [
                "Fundamental Theorem of Arithmetic - every composite number has unique prime factorization",
                "Euclid's Division Algorithm for finding HCF and LCM",
                "Proof techniques for establishing irrationality of numbers",
                "Relationship between HCF and LCM: HCF(a,b) × LCM(a,b) = a × b",
                "Applications of prime factorization in solving real-world problems"
            ],
            "summary": "This chapter explores the fundamental properties of real numbers, focusing on two major theorems. The Fundamental Theorem of Arithmetic establishes that every composite number can be uniquely expressed as a product of prime factors, which provides the foundation for finding HCF and LCM using prime factorization methods. The chapter also revisits irrational numbers, using proof by contradiction and the Fundamental Theorem of Arithmetic to prove that numbers like √2, √3, and √5 are irrational. These concepts are applied to solve practical problems involving divisibility, periodicity, and number properties, demonstrating the deep connections between abstract mathematical theory and real-world applications."
        }
    },
    "statistics": {
        "total_images": 3,
        "text_length": 17136,
        "processing_time": 8.15
    },
    "claude_processing": {
        "processed_at": "2025-07-19 10:58:52",
        "model_used": "claude-sonnet-4-20250514",
        "tasks_completed": [
            "exercises",
            "summary",
            "answers",
            "image_descriptions"
        ],
        "exercises_count": 10,
        "images_processed": 3,
        "last_updated": "2025-07-19 11:47:37",
        "images_reprocessed": 3
    }
}