{
  "source_file": "/home/content/books/maths/jemh109.pdf",
  "filename": "jemh109.pdf",
  "subject": "maths",
  "conversion_timestamp": "2025-07-18T12:05:22.411886",
  "processing_time_seconds": 7.85,
  "metadata": "md",
  "content": {
    "markdown_text": "![](_page_0_Picture_0.jpeg)\n\n# **9 SOME APPLICATIONS OF TRIGONOMETRY**\n\n### **9.1 Heights and Distances**\n\nIn the previous chapter, you have studied about trigonometric ratios. In this chapter, you will be studying about some ways in which trigonometry is used in the life around you.\n\nLet us consider Fig. 8.1 of prvious chapter, which is redrawn below in Fig. 9.1.\n\n![](_page_0_Figure_5.jpeg)\n\nIn this figure, the line AC drawn from the eye of the student to the top of the minar is called the *line of sight*. The student is looking at the top of the minar. The angle BAC, so formed by the line of sight with the horizontal, is called the *angle of elevation* of the top of the minar from the eye of the student.\n\nThus, the **line of sight** is the line drawn from the eye of an observer to the point in the object viewed by the observer. The **angle of elevation** of the point viewed is the angle formed by the line of sight with the horizontal when the point being viewed is above the horizontal level, i.e., the case when we raise our head to look at the object (see Fig. 9.2).\n\n![](_page_1_Figure_2.jpeg)\n\nNow, consider the situation given in Fig. 8.2. The girl sitting on the balcony is *looking down* at a flower pot placed on a stair of the temple. In this case, the line of sight is *below* the horizontal level. The angle so formed by the line of sight with the horizontal is called the *angle of depression*.\n\nThus, the **angle of depression** of a point on the object being viewed is the angle formed by the line of sight with the horizontal when the point is below the horizontal level, i.e., the case when we lower our head to look at the point being viewed (see Fig. 9.3).\n\n![](_page_1_Figure_5.jpeg)\n\nNow, you may identify the lines of sight, and the angles so formed in Fig. 8.3. Are they angles of elevation or angles of depression?\n\nLet us refer to Fig. 9.1 again. If you want to find the height CD of the minar without actually measuring it, what information do you need? You would need to know the following:\n\n(i) the distance DE at which the student is standing from the foot of the minar\n\n- (ii) the angle of elevation, BAC, of the top of the minar\n- (iii) the height AE of the student.\n\nAssuming that the above three conditions are known, how can we determine the height of the minar?\n\nIn the figure, CD = CB + BD. Here, BD = AE, which is the height of the student.\n\nTo find BC, we will use trigonometric ratios of BAC or A.\n\nIn ABC, the side BC is the opposite side in relation to the known A. Now, which of the trigonometric ratios can we use? Which one of them has the two values that we have and the one we need to determine? Our search narrows down to using either tan A or cot A, as these ratios involve AB and BC.\n\nTherefore, \n$$\n\\tan A = \\frac{BC}{AB}\n$$\n or  $\\cot A = \\frac{AB}{BC}$ , which on solving would give us BC.\n\nBy adding AE to BC, you will get the height of the minar.\n\nNow let us explain the process, we have just discussed, by solving some problems.\n\n**Example 1 :** A tower stands vertically on the ground. From a point on the ground, which is 15 m away from the foot of the tower, the angle of elevation of the top of the tower is found to be 60°. Find the height of the tower.\n\n**Solution :** First let us draw a simple diagram to represent the problem (see Fig. 9.4). Here AB represents the tower, CB is the distance of the point from the tower and ACB is the angle of elevation. We need to determine the height of the tower, i.e., AB. Also, ACB is a triangle, right-angled at B.\n\nTo solve the problem, we choose the trigonometric ratio tan 60° (or cot 60°), as the ratio involves AB and BC.\n\n> AB BC\n\n15\n\nNow, tan 60° =\n\ni.e., 3 = AB\n\ni.e., \n$$\nAB = 15\\sqrt{3}\n$$\n\nHence, the height of the tower is 15 3 m.\n\n![](_page_2_Figure_17.jpeg)\n\n**Example 2 :** An electrician has to repair an electric fault on a pole of height 5 m. She needs to reach a point 1.3m below the top of the pole to undertake the repair work (see Fig. 9.5). What should be the length of the ladder that she should use which, when inclined at an angle of 60° to the horizontal, would enable her to reach the required position? Also, how far from the foot of the pole should she place the foot of the ladder? (You may take 3 = 1.73)\n\n**Solution :** In Fig. 9.5, the electrician is required to reach the point B on the pole AD.\n\nSo, \n$$\nBD = AD - AB = (5 - 1.3)m = 3.7 m\n$$\n.\n\nHere, BC represents the ladder. We need to find its length, i.e., the hypotenuse of the right triangle BDC.\n\nNow, can you think which trigonometic ratio should we consider? It should be sin 60°.\n\n3.7\n\nSo,\n\n$$\n\\frac{BD}{BC} = \\sin 60^\\circ \\text{ or } \\frac{3.7}{BC} = \\frac{\\sqrt{3}}{2}\n$$\n$$\n3.7 \\times 2\n$$\n\nTherefore, BC =\n\n$$\nBC = \\frac{3.7 \\times 2}{\\sqrt{3}} = 4.28 \\text{ m (approx.)}\n$$\n\ni.e., the length of the ladder should be 4.28 m.\n\nNow, \n$$\n\\frac{DC}{BD} = \\cot 60^\\circ = \\frac{1}{\\sqrt{3}}\n$$\n\ni.e., DC =\n\n![](_page_3_Figure_13.jpeg)\n\nTherefore, she should place the foot of the ladder at a distance of 2.14 m from the pole.\n\n<sup>3</sup> = 2.14 m (approx.)\n\n**Example 3 :** An observer 1.5 m tall is 28.5 m away from a chimney. The angle of elevation of the top of the chimney from her eyes is 45°. What is the height of the chimney?\n\n**Solution :** Here, AB is the chimney, CD the observer and ADE the angle of elevation (see Fig. 9.6). In this case, ADE is a triangle, right-angled at E and we are required to find the height of the chimney.\n\nWe have AB = AE + BE = AE + 1.5\n\nand DE = CB = 28.5 m\n\nTo determine AE, we choose a trigonometric ratio, which involves both AE and DE. Let us choose the tangent of the angle of elevation.\n\nNow, tan 45° = AE DE i.e., 1 = AE\n\nTherefore, AE = 28.5\n\nSo the height of the chimney (AB) = (28.5 + 1.5) m = 30 m.\n\n28.5\n\n**Example 4 :** From a point P on the ground the angle of elevation of the top of a 10 m tall building is 30°. A flag is hoisted at the top of the building and the angle of elevation of the top of the flagstaff from P is 45°. Find the length of the flagstaff and the distance of the building from the point P. (You may take 3 = 1.732)\n\n**Solution :** In Fig. 9.7, AB denotes the height of the building, BD the flagstaff and P the given point. Note that there are two right triangles PAB and PAD. We are required to find the length of the flagstaff, i.e., DB and the distance of the building from the point P, i.e., PA.\n\n![](_page_4_Figure_14.jpeg)\n\n![](_page_5_Figure_1.jpeg)\n\nAD 10 AP 10 3 *<sup>x</sup>*\n\nTherefore, AP = 10 3\n\n1\n\nwill first consider the right PAB.\n\nWe have tan 30° =\n\ni.e., the distance of the building from P is 10 3 m = 17.32 m.\n\n<sup>3</sup><sup>=</sup> <sup>10</sup> AP\n\nAB AP\n\nNext, let us suppose DB = *x* m. Then AD = (10 + *x*) m.\n\nNow, in right PAD, tan 45° =\n\nis 30°.\n\n## 10 *x*\n\nReprint 2025-26\n\ni.e.,\n\n![](_page_5_Figure_11.jpeg)\n\n![](_page_5_Figure_12.jpeg)\n\nSo, DB = (40 + *x*) m\n\nNow, we have two right triangles ABC and ABD.\n\nIn ABC, tan 60° =\n\nor, 3 = *<sup>h</sup>*\n\nIn \n$$\n\\triangle\n$$\n ABD,  $\\tan 30^\\circ = \\frac{AB}{BD}$ \n\ni.e., \n$$\n\\frac{1}{\\sqrt{3}} = \\frac{h}{x + 40}\n$$\n\nFrom (1), we have *h* = *x* 3\n\nPutting this value in (2), we get *x* 3 3 = *x* + 40, i.e., 3*x* = *x* + 40\n\n*h*\n\nAB BC\n\n*x*\n\ni.e., *x* = 20\n\nSo, *h* = 20 3 [From (1)]\n\nTherefore, the height of the tower is 20 3 m.\n\n**Example 6 :** The angles of depression of the top and the bottom of an 8 m tall building from the top of a multi-storeyed building are 30°\n\nand 45°, respectively. Find the height of the multistoreyed building and the distance between the two buildings.\n\n**Solution :** In Fig. 9.9, PC denotes the multistoryed building and AB denotes the 8 m tall building. We are interested to determine the height of the multi-storeyed building, i.e., PC and the distance between the two buildings, i.e., AC.\n\nLook at the figure carefully. Observe that PB is a transversal to the parallel lines PQ and BD. Therefore, QPB and PBD are alternate angles, and so are equal. So PBD = 30°. Similarly, PAC = 45°. In right PBD, we have\n\n![](_page_6_Figure_19.jpeg)\n\n*<sup>x</sup>* (2)\n\n(1)\n\n$$\n\\frac{PD}{BD} = \\tan 30^\\circ = \\frac{1}{\\sqrt{3}} \\text{ or } BD = PD\\sqrt{3}\n$$\n\nIn right PAC, we have\n\nPC AC = tan 45° = 1\n\ni.e., \n$$\nPC = AC\n$$\n  \nAlso,  $PC = PD + DC$ , therefore,  $PD + DC = AC$ .\n\nSince, AC = BD and DC = AB = 8 m, we get PD + 8 = BD = PD 3 (Why?)\n\nThis gives PD = 8 31 <sup>8</sup> 4 3 1 m. 3 1 31 31 \n\nSo, the height of the multi-storeyed building is 4 3 1 8 m=4 3+ 3 m and the distance between the two buildings is also 4 3 3 m.\n\n**Example 7 :** From a point on a bridge across a river, the angles of depression of the banks on opposite sides of the river are 30° and 45°, respectively. If the bridge is at a height of 3 m from the banks, find the width of the river.\n\n**Solution :** In Fig 9.10, A and B represent points on the bank on opposite sides of the river, so that AB is the width of the river. P is a point on the bridge at a height of 3 m, i.e., DP = 3 m. We are interested to determine the width of the river, which is the length of the side AB of the D APB.\n\nNow, AB = AD + DB\n\nPD AD\n\nIn right APD, A = 30°.\n\nSo, tan 30° =\n\n![](_page_7_Figure_14.jpeg)\n\n**Fig. 9.10**\n\ni.e., 1 <sup>3</sup><sup>=</sup> <sup>3</sup> AD or AD = 3 3 m\n\nAlso, in right PBD, B = 45°. So, BD = PD = 3 m.\n\nNow, AB = BD + AD = \n$$\n3 + 3\\sqrt{3} = 3(1 + \\sqrt{3})\n$$\n m.\n\nTherefore, the width of the river is 3 3 1m .\n\n#### **EXERCISE 9.1**\n\n- **1.** A circus artist is climbing a 20 m long rope, which is tightly stretched and tied from the top of a vertical pole to the ground. Find the height of the pole, if the angle made by the rope with the ground level is 30° (see Fig. 9.11).\n- **2.** A tree breaks due to storm and the broken part bends so that the top of the tree touches the ground making an angle 30° with it. The distance between the foot of the tree to the point where the top touches the ground is 8 m. Find the height of the tree.\n\n![](_page_8_Figure_8.jpeg)\n\n- **3.** A contractor plans to install two slides for the children to play in a park. For the children below the age of 5 years, she prefers to have a slide whose top is at a height of 1.5 m, and is inclined at an angle of 30° to the ground, whereas for elder children, she wants to have a steep slide at a height of 3m, and inclined at an angle of 60° to the ground. What should be the length of the slide in each case?\n- **4.** The angle of elevation of the top of a tower from a point on the ground, which is 30 m away from the foot of the tower, is 30°. Find the height of the tower.\n- **5.** A kite is flying at a height of 60 m above the ground. The string attached to the kite is temporarily tied to a point on the ground. The inclination of the string with the ground is 60°. Find the length of the string, assuming that there is no slack in the string.\n- **6.** A 1.5 m tall boy is standing at some distance from a 30 m tall building. The angle of elevation from his eyes to the top of the building increases from 30° to 60° as he walks towards the building. Find the distance he walked towards the building.\n- **7.** From a point on the ground, the angles of elevation of the bottom and the top of a transmission tower fixed at the top of a 20 m high building are 45° and 60° respectively. Find the height of the tower.\n\n- **8.** A statue, 1.6 m tall, stands on the top of a pedestal. From a point on the ground, the angle of elevation of the top of the statue is 60° and from the same point the angle of elevation of the top of the pedestal is 45°. Find the height of the pedestal.\n- **9.** The angle of elevation of the top of a building from the foot of the tower is 30° and the angle of elevation of the top of the tower from the foot of the building is 60°. If the tower is 50 m high, find the height of the building.\n- **10.** Two poles of equal heights are standing opposite each other on either side of the road, which is 80 m wide. From a point between them on the road, the angles of elevation of the top of the poles are 60° and 30°, respectively. Find the height of the poles and the distances of the point from the poles.\n- **11.** A TV tower stands vertically on a bank of a canal. From a point on the other bank directly opposite the tower, the angle of elevation of the top of the tower is 60°. From another point 20 m away from this point on the line joing this point to the foot of the tower, the angle of elevation of the top of the tower is 30° (see Fig. 9.12). Find the height of the tower and the width of the canal.\n\n![](_page_9_Figure_5.jpeg)\n\n- **12.** From the top of a 7 m high building, the angle of elevation of the top of a cable tower is 60° and the angle of depression of its foot is 45°. Determine the height of the tower.\n- **13.** As observed from the top of a 75 m high lighthouse from the sea-level, the angles of depression of two ships are 30° and 45°. If one ship is exactly behind the other on the same side of the lighthouse, find the distance between the two ships.\n- **14.** A 1.2 m tall girl spots a balloon moving with the wind in a horizontal line at a height of 88.2 m from the ground. The angle of elevation of the balloon from the eyes of the girl at any instant is 60°. After some time, the angle of elevation reduces to 30° (see Fig. 9.13). Find the distance travelled by the balloon during the interval.\n\n![](_page_9_Figure_9.jpeg)\n\n**15.** A straight highway leads to the foot of a tower. A man standing at the top of the tower observes a car at an angle of depression of 30°, which is approaching the foot of the tower with a uniform speed. Six seconds later, the angle of depression of the car is found to be 60°. Find the time taken by the car to reach the foot of the tower from this point.\n\n### **9.2 Summary**\n\nIn this chapter, you have studied the following points :\n\n- **1.** (i) The **line of sight** is the line drawn from the eye of an observer to the point in the object viewed by the observer.\n  - (ii) The **angle of elevation** of an object viewed, is the angle formed by the line of sight with the horizontal when it is above the horizontal level, i.e., the case when we raise our head to look at the object.\n  - (iii) The **angle of depression** of an object viewed, is the angle formed by the line of sight with the horizontal when it is below the horizontal level, i.e., the case when we lower our head to look at the object.\n- **2.** The height or length of an object or the distance between two distant objects can be determined with the help of trigonometric ratios.",
    "structured_data": {
      "error": "No structured data available"
    },
    "images": [
      {
        "name": "_page_0_Picture_0.jpeg",
        "path": "/home/content/converted_books/images/jemh109/_page_0_Picture_0.jpeg",
        "size_bytes": 15098,
        "description": "This image shows a QR code with the identifier \"1062CH09\" below it. The QR code likely provides digital access to additional resources, exercises, or supplementary materials related to Chapter 9 on \"Some Applications of Trigonometry\" and the topic of heights and distances.",
        "description_generated_at": "2025-07-19 12:00:37"
      },
      {
        "name": "_page_0_Figure_5.jpeg",
        "path": "/home/content/converted_books/images/jemh109/_page_0_Figure_5.jpeg",
        "size_bytes": 39983,
        "description": "This diagram shows a geometric illustration of trigonometric concepts with a blue minaret (tower) in the center and two observer positions on either side. The diagram demonstrates the \"line of sight\" (dotted lines from points A to C) and \"angle of elevation\" (angles formed between the horizontal line and the line of sight), which are fundamental concepts used in trigonometry to calculate heights and distances of tall objects.",
        "description_generated_at": "2025-07-19 12:00:37"
      },
      {
        "name": "_page_1_Figure_2.jpeg",
        "path": "/home/content/converted_books/images/jemh109/_page_1_Figure_2.jpeg",
        "size_bytes": 18209,
        "description": "This diagram illustrates the concept of angle of elevation, showing a person looking up at an object (appears to be mountains) above the horizontal level. The image clearly labels the \"Line of sight\" (the diagonal line from the observer's eye to the object), the \"Angle of elevation\" (formed between the line of sight and the horizontal), and the \"Horizontal level\" to help students visualize this fundamental trigonometry concept.",
        "description_generated_at": "2025-07-19 12:00:37"
      },
      {
        "name": "_page_1_Figure_5.jpeg",
        "path": "/home/content/converted_books/images/jemh109/_page_1_Figure_5.jpeg",
        "size_bytes": 32026,
        "description": "This diagram illustrates the concept of angle of depression, showing a person on a balcony looking down at an object below the horizontal level. The image clearly labels the horizontal level (dotted line), the line of sight (solid line going downward), and the angle of depression formed between these two lines, demonstrating how we measure angles when looking down at objects.",
        "description_generated_at": "2025-07-19 12:00:37"
      },
      {
        "name": "_page_2_Figure_17.jpeg",
        "path": "/home/content/converted_books/images/jemh109/_page_2_Figure_17.jpeg",
        "size_bytes": 18272,
        "description": "This diagram (Fig. 9.4) illustrates a right triangle formed by a vertical tower, showing the angle of elevation of 60° from point C to the top of the tower A, with the horizontal distance CB labeled as 15 m. The diagram visually represents the trigonometry problem about finding the height of a tower using the tangent ratio and angle of elevation.",
        "description_generated_at": "2025-07-19 12:00:37"
      },
      {
        "name": "_page_3_Figure_13.jpeg",
        "path": "/home/content/converted_books/images/jemh109/_page_3_Figure_13.jpeg",
        "size_bytes": 18769,
        "description": "This diagram (Fig. 9.5) shows a right triangle formed by a vertical pole (AD), a ladder (BC) leaning against it at a 60° angle, and the ground (DC), with an electrician climbing the ladder. The diagram illustrates a practical trigonometry problem where students use sine and cotangent ratios to find the ladder's required length and its distance from the pole's base.",
        "description_generated_at": "2025-07-19 12:00:37"
      },
      {
        "name": "_page_4_Figure_14.jpeg",
        "path": "/home/content/converted_books/images/jemh109/_page_4_Figure_14.jpeg",
        "size_bytes": 17965,
        "description": "This diagram (Fig. 9.6) shows a geometric setup for a trigonometry problem involving angles of elevation, featuring a tall industrial chimney or tower structure with observation points labeled A, B, C, D, and E, and a 45° angle marked at point D. The image illustrates a real-world application of trigonometric concepts where students calculate heights and distances using angle measurements from ground-level observation points.",
        "description_generated_at": "2025-07-19 12:00:37"
      },
      {
        "name": "_page_5_Figure_1.jpeg",
        "path": "/home/content/converted_books/images/jemh109/_page_5_Figure_1.jpeg",
        "size_bytes": 89888,
        "description": "This image shows a geometric diagram (Fig. 9.8) illustrating a trigonometry problem about finding the height of a tower using shadow lengths at different sun angles. The diagram displays a right triangle with a vertical tower AB, two shadow positions (BC and DB) on the ground, and angles of elevation marked as 30° and 60° from points C and D respectively, with the shadow difference labeled as 40 m.",
        "description_generated_at": "2025-07-19 12:00:37"
      },
      {
        "name": "_page_5_Figure_11.jpeg",
        "path": "/home/content/converted_books/images/jemh109/_page_5_Figure_11.jpeg",
        "size_bytes": 41377,
        "description": "This image shows a geometric diagram illustrating a trigonometry problem involving angles of elevation from point P to a building with a flagstaff on top. The diagram displays a building (labeled with points A and B) with a flag at the top (point D), and shows two angles from point P: 30° to the top of the building and 45° to the flagstaff, used to demonstrate how trigonometric ratios can solve real-world height and distance problems.",
        "description_generated_at": "2025-07-19 12:00:37"
      },
      {
        "name": "_page_5_Figure_12.jpeg",
        "path": "/home/content/converted_books/images/jemh109/_page_5_Figure_12.jpeg",
        "size_bytes": 1656,
        "description": "This image shows a geometric diagram (Fig. 9.7) illustrating a trigonometry problem involving angles of elevation from point P to a building with a flagstaff on top. The diagram depicts two right triangles formed by the observer's position P, the building height AB, and the total height AD (including the flagstaff BD), which is used to solve for both the flagstaff height and the horizontal distance using trigonometric ratios.",
        "description_generated_at": "2025-07-19 12:00:37"
      },
      {
        "name": "_page_6_Figure_19.jpeg",
        "path": "/home/content/converted_books/images/jemh109/_page_6_Figure_19.jpeg",
        "size_bytes": 15520,
        "description": "This diagram illustrates a trigonometry problem involving angles of depression from the top of a multi-storeyed building (point P) to the top and bottom of a shorter 8m building. The figure shows two right triangles with angles of depression of 30° and 45°, used to calculate the height of the taller building and the horizontal distance between the two buildings using trigonometric ratios.",
        "description_generated_at": "2025-07-19 12:00:37"
      },
      {
        "name": "_page_7_Figure_14.jpeg",
        "path": "/home/content/converted_books/images/jemh109/_page_7_Figure_14.jpeg",
        "size_bytes": 13371,
        "description": "This diagram illustrates a trigonometry problem showing a bridge at point P, 3 meters above a river, with angles of depression of 30° and 45° to opposite banks at points A and B. The diagram is used to demonstrate how to calculate the width of the river (distance AB) using right triangle trigonometry and tangent ratios.",
        "description_generated_at": "2025-07-19 12:00:37"
      },
      {
        "name": "_page_8_Figure_8.jpeg",
        "path": "/home/content/converted_books/images/jemh109/_page_8_Figure_8.jpeg",
        "size_bytes": 11095,
        "description": "This diagram shows a right triangle labeled as Fig. 9.11, where side AC represents a 20-meter rope stretched from the top of a vertical pole (AB) to the ground, making a 30° angle with the horizontal ground level (BC). This geometric figure illustrates the setup for Exercise 9.1 Problem 1, where students need to use trigonometry to find the height of the pole from the given rope length and angle.",
        "description_generated_at": "2025-07-19 12:00:37"
      },
      {
        "name": "_page_9_Figure_5.jpeg",
        "path": "/home/content/converted_books/images/jemh109/_page_9_Figure_5.jpeg",
        "size_bytes": 18683,
        "description": "This diagram (Fig. 9.12) illustrates a trigonometry problem involving a TV tower standing on one bank of a canal, with two observation points on the opposite bank showing angles of elevation of 30° and 60° to the top of the tower. The diagram shows the tower (AB), the canal width, and the 20m distance between the two observation points, helping students visualize how to use trigonometric ratios to find the tower's height and canal width.",
        "description_generated_at": "2025-07-19 12:00:37"
      },
      {
        "name": "_page_9_Figure_9.jpeg",
        "path": "/home/content/converted_books/images/jemh109/_page_9_Figure_9.jpeg",
        "size_bytes": 16386,
        "description": "This diagram illustrates a trigonometry problem showing a girl observing a balloon at two different positions, with angles of elevation of 60° and 30° marked from her eye level to the balloon's path at a height of 88.2 m above ground. The diagram is used to demonstrate how to calculate the horizontal distance traveled by the balloon using angle of elevation concepts.",
        "description_generated_at": "2025-07-19 12:00:37"
      }
    ],
    "exercises": [
      {
        "question": "A circus artist is climbing a 20 m long rope, which is tightly stretched and tied from the top of a vertical pole to the ground. Find the height of the pole, if the angle made by the rope with the ground level is 30°.",
        "answer": "Let the height of the pole be h meters. The rope forms the hypotenuse of a right triangle where the pole is the opposite side to the 30° angle. Using sin 30° = opposite/hypotenuse = h/20. Since sin 30° = 1/2, we have: 1/2 = h/20, therefore h = 20 × 1/2 = 10 meters. The height of the pole is 10 meters."
      },
      {
        "question": "A tree breaks due to storm and the broken part bends so that the top of the tree touches the ground making an angle 30° with it. The distance between the foot of the tree to the point where the top touches the ground is 8 m. Find the height of the tree.",
        "answer": "Let the original height be h meters, with the tree breaking at height x from ground. The broken part (h-x) bends to touch the ground 8m away. In the right triangle formed: tan 30° = x/8, so x = 8 × tan 30° = 8 × (1/√3) = 8/√3 meters. Also, the broken part forms hypotenuse: (h-x)² = x² + 8². Using cos 30° = 8/(h-x), we get √3/2 = 8/(h-x), so h-x = 16/√3. Therefore, h = x + (h-x) = 8/√3 + 16/√3 = 24/√3 = 8√3 ≈ 13.86 meters."
      },
      {
        "question": "A contractor plans to install two slides for children. For children below 5 years, a slide with top at 1.5 m height inclined at 30° to ground. For elder children, a slide at 3m height inclined at 60° to ground. What should be the length of each slide?",
        "answer": "For the first slide: Using sin 30° = height/length = 1.5/L₁. Since sin 30° = 1/2, we have 1/2 = 1.5/L₁, so L₁ = 3 meters. For the second slide: Using sin 60° = height/length = 3/L₂. Since sin 60° = √3/2, we have √3/2 = 3/L₂, so L₂ = 6/√3 = 2√3 ≈ 3.46 meters. The slides should be 3 meters and 2√3 meters long respectively."
      },
      {
        "question": "The angle of elevation of the top of a tower from a point on the ground, which is 30 m away from the foot of the tower, is 30°. Find the height of the tower.",
        "answer": "Let the height of the tower be h meters. Using tan 30° = height/base = h/30. Since tan 30° = 1/√3, we have: 1/√3 = h/30, therefore h = 30/√3 = 30/√3 × √3/√3 = 30√3/3 = 10√3 ≈ 17.32 meters. The height of the tower is 10√3 meters."
      },
      {
        "question": "A kite is flying at a height of 60 m above the ground. The string is tied to a point on ground with inclination 60°. Find the length of the string.",
        "answer": "Let the length of string be L meters. The string forms the hypotenuse of a right triangle where height is opposite to the 60° angle. Using sin 60° = opposite/hypotenuse = 60/L. Since sin 60° = √3/2, we have: √3/2 = 60/L, therefore L = 60 × 2/√3 = 120/√3 = 120√3/3 = 40√3 ≈ 69.28 meters. The length of the string is 40√3 meters."
      },
      {
        "question": "A 1.5 m tall boy standing at distance from 30 m building. Angle of elevation from his eyes increases from 30° to 60° as he walks towards building. Find distance walked.",
        "answer": "The effective height the boy sees is 30 - 1.5 = 28.5 m. Let initial distance be d₁ and final distance be d₂. From initial position: tan 30° = 28.5/d₁, so 1/√3 = 28.5/d₁, giving d₁ = 28.5√3. From final position: tan 60° = 28.5/d₂, so √3 = 28.5/d₂, giving d₂ = 28.5/√3. Distance walked = d₁ - d₂ = 28.5√3 - 28.5/√3 = 28.5(√3 - 1/√3) = 28.5(3-1)/√3 = 57/√3 = 19√3 ≈ 32.91 meters."
      },
      {
        "question": "From ground point, angles of elevation of bottom and top of transmission tower on 20m building are 45° and 60°. Find tower height.",
        "answer": "Let distance from point to building be d, and tower height be h. For building: tan 45° = 20/d, so d = 20 meters. For total height (building + tower): tan 60° = (20 + h)/d = (20 + h)/20. Since tan 60° = √3, we have: √3 = (20 + h)/20, so 20√3 = 20 + h, therefore h = 20√3 - 20 = 20(√3 - 1) ≈ 20(1.732 - 1) = 14.64 meters. The height of the tower is 20(√3 - 1) meters."
      },
      {
        "question": "A 1.6 m statue on pedestal. From ground point, elevation angles to statue top is 60° and pedestal top is 45°. Find pedestal height.",
        "answer": "Let pedestal height be h and distance be d. For pedestal: tan 45° = h/d, so d = h. For total height: tan 60° = (h + 1.6)/d = (h + 1.6)/h. Since tan 60° = √3, we have: √3 = (h + 1.6)/h, so √3h = h + 1.6, therefore h(√3 - 1) = 1.6, giving h = 1.6/(√3 - 1). Rationalizing: h = 1.6(√3 + 1)/((√3 - 1)(√3 + 1)) = 1.6(√3 + 1)/2 = 0.8(√3 + 1) ≈ 2.19 meters."
      },
      {
        "question": "Angle of elevation of building top from tower foot is 30°, and tower top from building foot is 60°. If tower is 50m high, find building height.",
        "answer": "Let building height be h and distance between them be d. From tower foot to building top: tan 30° = h/d, so 1/√3 = h/d, giving d = h√3. From building foot to tower top: tan 60° = 50/d, so √3 = 50/d, giving d = 50/√3. Equating: h√3 = 50/√3, so h = 50/(√3 × √3) = 50/3 ≈ 16.67 meters. The height of the building is 50/3 meters."
      },
      {
        "question": "Two equal height poles on 80m wide road. From point between them, elevation angles are 60° and 30°. Find pole height and distances.",
        "answer": "Let pole height be h, and distances from point be d₁ and d₂. We have d₁ + d₂ = 80. From first pole: tan 60° = h/d₁, so √3 = h/d₁, giving d₁ = h/√3. From second pole: tan 30° = h/d₂, so 1/√3 = h/d₂, giving d₂ = h√3. Substituting: h/√3 + h√3 = 80, so h(1/√3 + √3) = 80, giving h(1 + 3)/√3 = 80, so h × 4/√3 = 80, therefore h = 20√3 meters. Then d₁ = 20 meters and d₂ = 60 meters."
      },
      {
        "question": "TV tower on canal bank. From opposite bank point, elevation angle is 60°. From point 20m away (towards tower), elevation is 30°. Find tower height and canal width.",
        "answer": "Let tower height be h and canal width be d. From farther point: tan 30° = h/(d + 20), so 1/√3 = h/(d + 20). From nearer point: tan 60° = h/d, so √3 = h/d, giving h = d√3. Substituting: 1/√3 = d√3/(d + 20), so (d + 20) = d√3 × √3 = 3d, therefore d + 20 = 3d, giving 2d = 20, so d = 10 meters. Then h = 10√3 ≈ 17.32 meters. Tower height is 10√3 m and canal width is 10 m."
      },
      {
        "question": "From 7m building top, cable tower top elevation is 60° and foot depression is 45°. Find tower height.",
        "answer": "Let tower height be h and horizontal distance be d. From depression to tower foot: tan 45° = 7/d, so d = 7 meters. From elevation to tower top: tan 60° = (h - 7)/d = (h - 7)/7. Since tan 60° = √3, we have: √3 = (h - 7)/7, so 7√3 = h - 7, therefore h = 7 + 7√3 = 7(1 + √3) ≈ 7(1 + 1.732) = 19.124 meters. The height of the tower is 7(1 + √3) meters."
      },
      {
        "question": "From 75m lighthouse, depression angles to two ships are 30° and 45°. Ships in line on same side. Find distance between ships.",
        "answer": "Let distances of ships from lighthouse base be d₁ and d₂. For nearer ship (45° depression): tan 45° = 75/d₁, so d₁ = 75 meters. For farther ship (30° depression): tan 30° = 75/d₂, so 1/√3 = 75/d₂, giving d₂ = 75√3 meters. Distance between ships = d₂ - d₁ = 75√3 - 75 = 75(√3 - 1) ≈ 75(1.732 - 1) = 54.9 meters."
      },
      {
        "question": "1.2m girl spots balloon at 88.2m height. Elevation angle changes from 60° to 30°. Find distance travelled by balloon.",
        "answer": "Effective height from girl's eyes = 88.2 - 1.2 = 87 meters. At 60° elevation: tan 60° = 87/d₁, so √3 = 87/d₁, giving d₁ = 87/√3 = 29√3 meters. At 30° elevation: tan 30° = 87/d₂, so 1/√3 = 87/d₂, giving d₂ = 87√3 meters. Distance travelled = d₂ - d₁ = 87√3 - 29√3 = 58√3 ≈ 100.46 meters."
      },
      {
        "question": "From tower top, car depression angle is 30°, then 60° after 6 seconds. Car approaches uniformly. Find time to reach tower foot.",
        "answer": "Let tower height be h. At 30° depression, car distance = h√3. At 60° depression, car distance = h/√3. Distance covered in 6 seconds = h√3 - h/√3 = h(√3 - 1/√3) = h(3-1)/√3 = 2h/√3. Speed = (2h/√3)/6 = h/(3√3). Time to cover remaining distance h/√3 = (h/√3) ÷ (h/(3√3)) = (h/√3) × (3√3/h) = 3 seconds. The car will take 3 more seconds to reach the tower foot."
      }
    ],
    "summary": {
      "title": "Some Applications of Trigonometry - Heights and Distances",
      "key_concepts": [
        "Line of sight - the line drawn from observer's eye to the object being viewed",
        "Angle of elevation - angle formed by line of sight with horizontal when looking upward",
        "Angle of depression - angle formed by line of sight with horizontal when looking downward",
        "Using trigonometric ratios (sin, cos, tan) to solve height and distance problems",
        "Application of trigonometry in real-world scenarios involving towers, buildings, and moving objects"
      ],
      "summary": "This chapter demonstrates practical applications of trigonometry in solving problems related to heights and distances. It introduces key concepts like line of sight, angles of elevation and depression, and shows how trigonometric ratios can be used to calculate unknown heights or distances in various real-world scenarios. The chapter provides systematic methods for setting up right triangles and choosing appropriate trigonometric ratios to solve problems involving towers, buildings, ladders, and moving objects, making trigonometry relevant to everyday situations."
    }
  },
  "statistics": {
    "total_images": 15,
    "text_length": 14519,
    "processing_time": 7.87
  },
  "claude_processing": {
    "processed_at": "2025-07-19 12:00:37",
    "model_used": "claude-sonnet-4-20250514",
    "tasks_completed": [
      "exercises",
      "answers",
      "summary",
      "image_descriptions"
    ],
    "exercises_count": 15,
    "images_processed": 15
  }
}