{
    "id": "9e132f28-1086-4120-bbc1-1ff8ef33fd9d",
    "title": "Glimpses of India",
    "source_file": "/home/content/books/english/jeff105.pdf",
    "filename": "jeff105.pdf",
    "subject": "english",
    "conversion_timestamp": "2025-07-18T12:02:21.383587",
    "processing_time_seconds": 10.86,
    "metadata": "md",
    "content": {
        "markdown_text": "![](_page_0_Picture_0.jpeg)\n\n![](_page_0_Picture_1.jpeg)\n\n# BEFORE YOU READ\n\n## Activity\n\nDiscuss in class\n\n- 1. What images of people and of places come to your mind, when you think of our country?\n- 2. What parts of India have you lived in, or visited? Can you name some popular tourist destinations?\n- 3. You may know that apart from the British, the Dutch and the French, the Portuguese have also played a part in the history of our country. Can you say which parts of India show French and Portuguese influences?\n- 4. Can you say which parts of India grow (i) tea, (ii) coffee?\n\n# I A Baker from Goa\n\nThis is a pen-portrait of a traditional Goan village baker who still has an important place in his society.\n\nOUR elders are often heard reminiscing nostalgically about those good old Portuguese days, the Portuguese and their famous loaves of bread. Those eaters of loaves might have vanished but the makers are still there. We still have amongst us the mixers, the moulders and those who bake the loaves. Those age-old, timetested furnaces still exist. The fire in the furnaces has not yet been extinguished. The thud and jingle of\n\nreminiscing nostalgically thinking fondly of the past\n\nthe traditional baker's bamboo, heralding his arrival in the morning, can still be heard in some places. Maybe the father is not alive but the son still carries on the family profession. These bakers are, even today, known as pader in Goa.\n\nDuring our childhood in Goa, the baker used to be our friend, companion and guide. He used to come at least twice a day. Once, when he set out in the morning on his selling round, and then again, when he returned after emptying his huge basket. The jingling thud of his bamboo woke us up from sleep and we ran to meet and greet him. Why was it so? Was it for the love of the loaf? Not at all. The loaves were bought by some Paskine or Bastine, the maid-servant of the house! What we longed for were those bread-bangles which we chose carefully. Sometimes it was sweet bread of special make.\n\nThe baker made his musical entry on the scene with the 'jhang, jhang' sound of his specially made bamboo staff. One hand supported the basket on his head and the other banged the bamboo on the ground. He would greet the lady of the house with \"Good morning\" and then place his basket on the vertical bamboo. We kids would be pushed aside with a mild rebuke and the loaves would be delivered to the servant. But we would not give up. We would climb a bench or the parapet and peep into the basket, somehow. I can still recall the typical fragrance of those loaves. Loaves for the elders and the bangles for the children. Then we did not even care to brush our teeth or wash our mouths properly. And why should we? Who would take the trouble of plucking the mango-leaf for the toothbrush? And why was it necessary at all? The tiger never brushed his teeth. Hot tea could wash and clean up everything so nicely, after all!\n\n#### rebuke\n\nan expression of disapproval; a scolding\n\n#### fragrance scent\n\n## 1. What are the elders in Goa nostalgic about?\n\nFirst Flight\n\n64\n\n- 2. Is bread-making still popular in Goa? How do you know?\n- 3. What is the baker called?\n\nOral Comprehension Check\n\n4. When would the baker come everyday? Why did the children run to meet him?\n\n#### heralding announcing\n\nMarriage gifts are meaningless without the sweet bread known as the bol, just as a party or a feast loses its charm without bread. Not enough can be said to show how important a baker can be for a village. The lady of the house must prepare sandwiches on the occasion of her daughter's engagement. Cakes and bolinhas are a must for Christmas as well as other festivals. Thus, the presence of the baker's furnace in the village is absolutely essential.\n\nThe baker or bread-seller of those days had a peculiar dress known as the kabai. It was a singlepiece long frock reaching down to the knees. In our childhood we saw bakers wearing a shirt and trousers which were shorter than full-length ones and longer than half pants. Even today, anyone who wears a half pant which reaches just below the knees invites the comment that he is dressed like a pader!\n\nThe baker usually collected his bills at the end of the month. Monthly accounts used to be recorded on some wall in pencil. Baking was indeed a profitable profession in the old days. The baker and his family never starved. He, his family and his servants always looked happy and prosperous. Their plump physique was an open testimony to this. Even today any person with a jackfruit-like physical appearance is easily compared to a baker.\n\n### Oral Comprehension Check\n\n| 1. | Match the following. What is a must   |   |                        |\n|----|---------------------------------------|---|------------------------|\n|    | (i)<br>as marriage gifts?             | – | cakes and bolinhas     |\n|    | (ii)<br>for a party or a feast?       | – | sweet bread called bol |\n|    | (iii)<br>for a daughter's engagement? | – | bread                  |\n|    | (iv)<br>for Christmas?                | – | sandwiches             |\n\n- 2. What did the bakers wear: (i) in the Portuguese days? (ii) when the author was young?\n- 3. Who invites the comment \"he is dressed like a pader\"? Why?\n- 4. Where were the monthly accounts of the baker recorded?\n- 5. What does a 'jackfruit-like appearance' mean?\n\nplump physique pleasantly fat body\n\nopen testimony public statement about a character or quality\n\nGlimpses of India\n\n![](_page_3_Picture_0.jpeg)\n\n- 1. Which of these statements are correct?\n  - (i) The pader was an important person in the village in old times.\n  - (ii) Paders still exist in Goan villages.\n  - (iii) The paders went away with the Portuguese.\n  - (iv) The paders continue to wear a single-piece long frock.\n  - (v) Bread and cakes were an integral part of Goan life in the old days.\n  - (vi) Traditional bread-baking is still a very profitable business.\n  - (vii) Paders and their families starve in the present times.\n- 2. Is bread an important part of Goan life? How do you know this?\n- 3. Tick the right answer. What is the tone of the author when he says the following?\n  - (i) The thud and the jingle of the traditional baker's bamboo can still be heard in some places. (nostalgic, hopeful, sad)\n  - (ii) Maybe the father is not alive but the son still carries on the family profession. (nostalgic, hopeful, sad)\n  - (iii) I still recall the typical fragrance of those loaves. (nostalgic, hopeful, naughty)\n  - (iv) The tiger never brushed his teeth. Hot tea could wash and clean up everything so nicely, after all. (naughty, angry, funny)\n  - (v) Cakes and bolinhas are a must for Christmas as well as other festivals. (sad, hopeful, matter-of-fact)\n  - (vi) The baker and his family never starved. They always looked happy and prosperous. (matter-of-fact, hopeful, sad)\n\nI. In this extract, the author talks about traditional bread-baking during his childhood days. Complete the following table with the help of the clues on the left. Then write a paragraph about the author's childhood days.\n\n| Clues                        | Author's childhood days |\n|------------------------------|-------------------------|\n| the way bread was baked      |                         |\n| the way the pader sold bread |                         |\n| what the pader wore          |                         |\n| when the pader was paid      |                         |\n| how the pader looked         |                         |\n\nFirst Flight\n\nII. 1. Compare the piece from the text (on the left below) with the other piece on Goan bakers (on the right). What makes the two texts so different? Are the facts the same? Do both writers give you a picture of the baker?\n\nOur elders are often heard reminiscing nostalgically about those good old Portuguese days, the Portuguese and their famous loaves of bread. Those eaters of loaves might have vanished but the makers are still there. We still have amongst us the mixers, the moulders and those who bake the loaves. Those age-old, time-tested furnaces still exist. The fire in the furnaces had not yet been extinguished. The thud and the jingle of the traditional baker's bamboo, heralding his arrival in the morning, can still be heard in some places.\n\nMay be the father is not alive but the son still carries on the family profession.\n\nAfter Goa's liberation, people used to say nostalgically that the Portuguese bread vanished with the paders. But the paders have managed to survive because they have perfected the art of door-todoor delivery service. The paders pick up the knowledge of breadmaking from traditions in the family. The leavened, oven-baked bread is a gift of the Portuguese to India.\n\n> [Adapted from Nandakumar Kamat's 'The Unsung Lives of Goan Paders']\n\n2. Now find a travel brochure about a place you have visited. Look at the description in the brochure. Then write your own account, adding details from your own experience, to give the reader a picture of the place, rather than an impersonal, factual description.\n\n- 1. In groups, collect information on how bakeries bake bread now and how the process has changed over time.\n- 2. There are a number of craft-based professions which are dying out. Pick one of the crafts below. Make a group presentation to the class about the skills required, and the possible reasons for the decline of the craft. Can you think of ways to revive these crafts?\n\n  - (iii) Dhurri (rug) weaving (vii) Making jute products\n  - (iv) Embroidery (viii) Handloom\n- (i) Pottery (v) Carpentry\n  - (ii) Batik work (vi) Bamboo weaving\n\n# I I\n\n# Coorg\n\n### Coorg is coffee country, famous for its rainforests and spices.\n\nMIDWAY between Mysore and the coastal town of Mangalore sits a piece of heaven that must have drifted from the kingdom of god. This land of rolling hills is inhabited by a proud race of martial men, beautiful women and wild creatures.\n\nCoorg, or Kodagu, the smallest district of Karnataka, is home to evergreen rainforests, spices and coffee plantations. Evergreen rainforests cover thirty per cent of this district. During the monsoons, it pours enough to keep many visitors away. The season of joy commences from September and continues till March. The weather is perfect, with\n\nsome showers thrown in for good measure. The air breathes of invigorating coffee. Coffee estates and colonial bungalows stand tucked under tree canopies in prime corners.\n\nThe fiercely independent people of Coorg are possibly of Greek or Arabic descent. As one story goes, a part of Alexander's army moved south along the coast and settled here when return became impractical. These people married amongst the locals and their culture is apparent in the martial traditions, marriage and religious rites, which are distinct from the Hindu mainstream. The theory of Arab origin draws support\n\nfrom the long, black coat\n\n### drifted from\n\nbeen carried along gently by air\n\n### martial having to do with war\n\n### canopies\n\nroof-like coverings that form shelters\n\nprime here, best\n\nmainstream a tradition which\n\n![](_page_5_Picture_15.jpeg)\n\nFirst Flight\n\nTraditional Coorgi dress most people follow\n\nwith an embroidered waist-belt worn by the Kodavus. Known as kuppia, it resembles the kuffia worn by the Arabs and the Kurds.\n\nCoorgi homes have a tradition of hospitality, and they are more than willing to recount numerous tales of valour related to their sons and fathers. The Coorg Regiment is one of the most decorated in the Indian Army, and the first Chief of the Indian Army, General Cariappa, was a Coorgi. Even now, Kodavus are the only people in India permitted to carry firearms without a licence.\n\nThe river, Kaveri, obtains its water from the hills and forests of Coorg. Mahaseer — a large freshwater fish — abound in these waters. Kingfishers dive for their catch, while squirrels and langurs drop partially eaten fruit for the mischief of enjoying the splash and the ripple effect in the clear water. Elephants enjoy being bathed and scrubbed in the river by their mahouts.\n\nThe most laidback individuals become converts to the life of high-energy adventure with river rafting, canoeing, rappelling, rock climbing and mountain\n\n#### tales of valour\n\nstories of courage and bravery, usually in war\n\n#### most decorated\n\nhaving received the maximum number of awards for bravery in war\n\n#### laidback\n\nrelaxed; not in a hurry\n\n#### rafting\n\ntravelling in a river in a raft ( a floating platform made by tying planks together)\n\n#### canoeing\n\ntravelling in a river in a canoe (a large, narrow boat)\n\n#### rappelling\n\ngoing down a cliff by sliding down a rope\n\nGlimpses of India\n\n69\n\nBasket-seller from Coorg\n\nbiking. Numerous walking trails in this region are a favourite with trekkers.\n\nBirds, bees and butterflies are there to give you company. Macaques, Malabar squirrels, langurs and slender loris keep a watchful eye from the tree canopy. I do, however, prefer to step aside for wild elephants.\n\nThe climb to the Brahmagiri hills brings you into a panoramic view of the entire misty landscape of Coorg. A walk across the rope bridge leads to the sixty-four-acre island of Nisargadhama. Running into Buddhist monks from India's largest Tibetan settlement, at nearby Bylakuppe, is a bonus. The monks, in red, ochre and yellow robes, are amongst the many surprises that wait to be discovered by visitors searching for the heart and soul of India, right here in Coorg.\n\n#### trails\n\npaths created by walking\n\npanoramic view a view of a wide area of land\n\n#### FACT FILE\n\nFirst Flight\n\n70\n\n### How to Reach\n\nMadikeri, the district headquarters, is the only gateway to Coorg. The misty hills, lush forests and coffee plantations will cast a spell on you. Find a resort, coffee estate or stay in a home for a truly Coorgi experience.\n\nBy Air: The nearest airports are Mangalore (135 km) and Bangalore (260 km). There are flights to Mangalore from Mumbai, and to Bangalore from Ahmedabad, Chennai, Delhi, Goa, Hyderabad, Kochi, Kolkata, Mumbai and Pune.\n\nBy Rail: The nearest railheads are at Mysore, Mangalore and Hassan.\n\nBy Road: There are two routes to Coorg from Bangalore. Both are almost the same distance (around 250-260 km). The route via Mysore is the most frequented one. The other route is via Neelamangal, Kunigal, Chanrayanapatna.\n\n- 1. Where is Coorg?\n- 2. What is the story about the Kodavu people's descent?\n- 3. What are some of the things you now know about\n  - (i) the people of Coorg?\n  - (ii) the main crop of Coorg?\n  - (iii) the sports it offers to tourists?\n\n- (iv) the animals you are likely to see in Coorg?\n- (v) its distance from Bangalore, and how to get there?\n- 4. Here are six sentences with some words in italics. Find phrases from the text that have the same meaning. (Look in the paragraphs indicated)\n  - (i) During monsoons it rains so heavily that tourists do not visit Coorg. (para 2)\n  - (ii) Some people say that Alexander's army moved south along the coast and settled there. (para 3)\n  - (iii) The Coorg people are always ready to tell stories of their sons' and fathers' valour. (para 4)\n  - (iv) Even people who normally lead an easy and slow life get smitten by the high-energy adventure sports of Coorg. (para 6)\n  - (v) The theory of the Arab origin is supported by the long coat with embroidered waist-belt they wear. (para 3)\n  - (vi) Macaques, Malabar squirrels observe you carefully from the tree canopy. (para 7)\n\n### Collocations\n\nCertain words 'go together'. Such 'word friends' are called collocations. The collocation of a word is 'the company it keeps'.\n\nFor example, look at the paired sentences and phrases below. Which is a common collocation, and which one is odd? Strike out the odd sentence or phrase.\n\n- (a) 'How old are you?' (b) a pleasant person\n  - 'How young are you?' a pleasant pillow\n\nGlimpses of India\n\n71\n\n1. Here are some nouns from the text.\n\nculture monks surprise experience weather tradition\n\nWork with a partner and discuss which of the nouns can collocate with which of the adjectives given below. The first one has been done for you.\n\nunique terrible unforgettable serious ancient wide sudden\n\n| (i)   | culture:    | unique culture, ancient culture |\n|-------|-------------|---------------------------------|\n| (ii)  | monks:      |                                 |\n| (iii) | surprise:   |                                 |\n| (iv)  | experience: |                                 |\n| (v)   | weather:    |                                 |\n| (vi)  | tradition:  |                                 |\n\n### 2. Complete the following phrases from the text. For each phrase, can you find at least one other word that would fit into the blank?\n\n(i) tales of (ii) coastal\n\n(iii) a piece of (iv) evergreen\n\n(v) plantations (vi) bridge\n\n(vii) wild\n\nYou may add your own examples to this list.\n\n# III\n\n# Tea from Assam\n\nPranjol, a youngster from Assam, is Rajvir's classmate at school in Delhi. Pranjol's father is the manager of a tea-garden in Upper Assam and Pranjol has invited Rajvir to visit his home during the summer vacation.\n\n\"CHAI-GARAM... garam-chai,\" a vendor called out in a high-pitched voice.\n\nHe came up to their window and asked,\"Chai, sa'ab?\" \"Give us two cups,\" Pranjol said.\n\nThey sipped the steaming hot liquid. Almost everyone in their compartment was drinking tea too.\n\n\"Do you know that over eighty crore cups of tea are drunk every day throughout the world?\" Rajvir said.\n\n\"Whew!\" exclaimed Pranjol. \"Tea really is very popular.\"\n\nThe train pulled out of the station. Pranjol buried his nose in his detective book again. Rajvir too was an ardent fan of detective stories, but at the moment he was keener on looking at the beautiful scenery.\n\nIt was green, green everywhere. Rajvir had never seen so much greenery before. Then the soft green paddy fields gave way to tea bushes.\n\nIt was a magnificent view. Against the backdrop of densely wooded hills a sea of tea bushes stretched as far as the eye could see. Dwarfing the tiny tea plants were tall sturdy shade-trees and amidst the orderly rows of bushes busily moved doll-like figures.\n\nFirst Flight\n\nIn the distance was an ugly building with smoke billowing out of tall chimneys.\n\n\"Hey, a tea garden!\" Rajvir cried excitedly.\n\nPranjol, who had been born and brought up on a plantation, didn't share Rajvir's excitement.\n\n\"Oh, this is tea country now,\" he said. \"Assam has the largest concentration of plantations in the world. You will see enough gardens to last you a lifetime!\"\n\n\"I have been reading as much as I could about tea,\" Rajvir said. \"No one really knows who discovered tea but there are many legends.\"\n\n\"What legends?\"\n\n\"Well, there's the one about the Chinese emperor who always boiled water before drinking it. One day a few leaves of the twigs burning under the pot fell into the water giving it a delicious flavour. It is said they were tea leaves.\"\n\n\"Tell me another!\" scoffed Pranjol.\n\n\"We have an Indian legend too. Bodhidharma, an ancient Buddhist ascetic, cut off his eyelids because he felt sleepy during meditations. Ten tea plants grew out of the eyelids. The leaves of these plants when put in hot water and drunk banished sleep.\n\n\"Tea was first drunk in China,\" Rajvir added, \"as far back as 2700 B.C.! In fact words such as tea, 'chai' and 'chini' are from Chinese. Tea came to Europe only in the sixteenth century and was drunk more as medicine than as beverage.\"\n\nThe train clattered into Mariani junction. The boys collected their luggage and pushed their way to the crowded platform.\n\nPranjol's parents were waiting for them.\n\nSoon they were driving towards Dhekiabari, the tea-garden managed by Pranjol's father .\n\nAn hour later the car veered sharply off the main road. They crossed a cattle-bridge and entered Dhekiabari Tea Estate.\n\nOn both sides of the gravel-road were acre upon acre of tea bushes, all neatly pruned to the same height. Groups of tea-pluckers, with bamboo baskets on their backs, wearing plastic aprons, were plucking the newly sprouted leaves.\n\nPranjol's father slowed down to allow a tractor, pulling a trailer-load of tea leaves, to pass.\n\n\"This is the second-flush or sprouting period, isn't it, Mr Barua?\" Rajvir asked. \"It lasts from May to July and yields the best tea.\"\n\n\"You seem to have done your homework before coming,\" Pranjol's father said in surprise.\n\n\"Yes, Mr Barua,\" Rajvir admitted. \"But I hope to learn much more while I'm here.\"\n\nFirst Flight\n\n74\n\nI. 1. Look at these words: upkeep, downpour, undergo, dropout, walk-in. They are built up from a verb (keep, pour, go, drop, walk) and an adverb or a particle (up, down, under, out, in).\n\n### Use these words appropriately in the sentences below. You may consult a dictionary.\n\n- (i) A heavy has been forecast due to low pressure in the Bay of Bengal.\n- (ii) Rakesh will major surgery tomorrow morning.\n- (iii) My brother is responsible for the of our family property.\n- (iv) The rate for this accountancy course is very high.\n- (v) She went to the Enterprise Company to attend a interview.\n- 2. Now fill in the blanks in the sentences given below by combining the verb given in brackets with one of the words from the box as appropriate.\n\nover by through out up down\n\n- (i) The Army attempted unsuccessfully to the Government. (throw)\n- (ii) Scientists are on the brink of a major in cancer research. (break)\n- (iii) The State Government plans to build a for Bhubaneswar to speed up traffic on the main highway. (pass)\n- (iv) Gautama's on life changed when he realised that the world is full of sorrow. (look)\n- (v) Rakesh seemed unusually after the game. (cast)\n\n- II. Notice how these -ing and -ed adjectives are used.\n  - (a) Chess is an interesting game. I am very interested in chess.\n  - (b) Going trekking in the Himalayas We are very excited about the this summer is an exciting idea. trek.\n\n(c) Are all your school books this He was bored as he had no boring? friends there.\n\nGlimpses of India\n\n75\n\nThe -ing adjectives show the qualities that chess, trekking, or these books have: they cause interest, excitement, or boredom in you. The —ed/—en adjectives show your mental state, or your physical state: how you feel in response to ideas, events or things.\n\n1. Think of suitable -ing or -ed adjectives to answer the following questions. You may also use words from those given above.\n\nHow would you describe\n\n- (i) a good detective serial on television?\n- (ii) a debate on your favourite topic 'Homework Should Be Banned'?\n- (iii) how you feel when you stay indoors due to incessant rain?\n- (iv) how you feel when you open a present?\n- (v) how you feel when you watch your favourite programme on television?\n- (vi) the look on your mother's face as you waited in a queue?\n- (vii) how you feel when tracking a tiger in a tiger reserve forest?\n- (viii) the story you have recently read, or a film you have seen?\n- 2. Now use the adjectives in the exercise above, as appropriate, to write a paragraph about Coorg.\n\n1. Read the following passage about tea.\n\nIndia and tea are so intertwined together that life without the brew is unimaginable. Tea entered our life only in the mid-nineteenth century when the British started plantations in Assam and Darjeeling! In the beginning though, Indians shunned the drink as they thought it was a poison that led to umpteen diseases. Ironically, tea colonised Britain where it became a part of their social diary and also led to the establishment of numerous tea houses.\n\nToday, scientific research across the world has attempted to establish the beneficial qualities of tea — a fact the Japanese and the Chinese knew anyway from ancient times, attributing to it numerous medicinal properties.\n\n### [Source: 'History: Tea Anytime' by Ranjit Biswas from Literary Review, The Hindu, 1 October 2006]\n\nCollect information about tea, e.g. its evolution as a drink, its beneficial qualities. You can consult an encyclopedia or visit Internet websites. Then form groups of five and play the following roles: Imagine a meeting of a tea planter, a sales agent, a tea lover (consumer), a physician and a tea-shop owner. Each person in the group has to put forward his/her views about tea. You may use the following words and phrases.\n\n- I disagree with you ... I think that tea ...\n- I would like you to know ... I agree with ...\n- It is my feeling ... I suggest ...\n- May I know why you ... I am afraid ...\n- I feel ... It is important to know ...\n- 2. You are the sales executive of a famous tea company and you have been asked to draft an advertisement for the product. Draft the advertisement using the information you collected for the role play. You can draw pictures or add photographs and make your advertisement colourful.\n\n### WHAT WE HAVE DONE\n\nGiven a picture of three different regions of India, giving an idea of how varied and charming and beautiful our country is.\n\n### WHAT YOU CAN D<sup>O</sup>\n\nGet your students to arrange an exhibition of photographs of different places in India — good sources are travel articles in Sunday newspapers, or in travel magazines, or in brochures available at travel agents. Ask students to bring in two or three pictures each, accompanied by a short, neatly hand-written write-up on the place shown in the pictures. Arrange them on your classroom walls. Let the students study them. They can then discuss, and later vote on the place they would most like to see.\n\n# The Trees\n\nCan there be a forest without trees? Where are the trees in this poem, and where do they go?\n\nThe trees inside are moving out into the forest, the forest that was empty all these days where no bird could sit no insect hide no sun bury its feet in shadow the forest that was empty all these nights will be full of trees by morning.\n\nAll night the roots work to disengage themselves from the cracks in the veranda floor. The leaves strain toward the glass small twigs stiff with exertion long-cramped boughs shuffling under the roof like newly discharged patients half-dazed, moving to the clinic doors.\n\nI sit inside, doors open to the veranda writing long letters in which I scarcely mention the departure of the forest from the house. The night is fresh, the whole moon shines in a sky still open the smell of leaves and lichen still reaches like a voice into the rooms.\n\nMy head is full of whispers which tomorrow will be silent. Listen. The glass is breaking. The trees are stumbling forward into the night. Winds rush to meet them. The moon is broken like a mirror, its pieces flash now in the crown of the tallest oak.\n\n# ADRIENNE RICH\n\nAdrienne Rich was born in Baltimore, Maryland, U.S.A. in 1929. She is the author of nearly twenty volumes of poetry, and has been called a feminist and a radical poet.\n\nFirst Flight\n\n78\n\nto disengage themselves: to separate themselves\n\nstrain: make efforts to move\n\nbough: branch\n\nshuffling: moving repeatedly from one position to another\n\nlichen: crusty patches or bushy growth on tree trunks/bare ground formed by association of fungus and alga.\n\n- 1. (i) Find, in the first stanza, three things that cannot happen in a treeless forest.\n  - (ii) What picture do these words create in your mind: \"… sun bury its feet in shadow…\"? What could the poet mean by the sun's 'feet'?\n- 2. (i) Where are the trees in the poem? What do their roots, their leaves, and their twigs do?\n  - (ii) What does the poet compare their branches to?\n- 3. (i) How does the poet describe the moon: (a) at the beginning of the third stanza, and (b) at its end? What causes this change?\n  - (ii) What happens to the house when the trees move out of it?\n  - (iii) Why do you think the poet does not mention \"the departure of the forest from the house\" in her letters? (Could it be that we are often silent about important happenings that are so unexpected that they embarrass us? Think about this again when you answer the next set of questions.)\n\n- 4. Now that you have read the poem in detail, we can begin to ask what the poem might mean. Here are two suggestions. Can you think of others?\n  - (i) Does the poem present a conflict between man and nature? Compare it with A Tiger in the Zoo. Is the poet suggesting that plants and trees, used for 'interior decoration' in cities while forests are cut down, are 'imprisoned', and need to 'break out'?\n  - (ii) On the other hand, Adrienne Rich has been known to use trees as a metaphor for human beings; this is a recurrent image in her poetry. What new meanings emerge from the poem if you take its trees to be symbolic of this particular meaning?\n- 5. You may read the poem 'On Killing a Tree' by Gieve Patel (Beehive Textbook in English for Class IX, NCERT). Compare and contrast it with the poem you have just read.\n\n### Homophones\n\nCan you find the words below that are spelt similarly, and sometimes even pronounced similarly, but have very different meanings? Check their pronunciation and meaning in a dictionary.\n\n- The dump was so full that it had to refuse more refuse.\n- When shot at, the dove dove into the bushes.\n\nThe Trees\n\n79\n\n• The insurance was invalid for the invalid.",
        "structured_data": {
            "error": "No structured data available"
        },
        "images": [
            {
                "name": "_page_0_Picture_0.jpeg",
                "path": "/home/content/converted_books/images/jeff105/_page_0_Picture_0.jpeg",
                "size_bytes": 16999,
                "description": "This image shows the chapter title page for \"Glimpses of India\" with a large blue number \"5\" indicating this is Chapter 5 of the English textbook. The title appears in elegant black lettering against a striped background, introducing a chapter that will explore different aspects and regions of India through various stories and perspectives.",
                "description_generated_at": "2025-07-19 11:45:16"
            },
            {
                "name": "_page_0_Picture_1.jpeg",
                "path": "/home/content/converted_books/images/jeff105/_page_0_Picture_1.jpeg",
                "size_bytes": 10353,
                "description": "This image shows a QR code that appears to be linked to supplementary digital content for the English textbook chapter about \"A Baker from Goa.\" The QR code likely provides students with additional multimedia resources, audio content, or interactive materials related to the story about traditional Goan village life and Portuguese colonial influences in India.",
                "description_generated_at": "2025-07-19 11:45:16"
            },
            {
                "name": "_page_3_Picture_0.jpeg",
                "path": "/home/content/converted_books/images/jeff105/_page_3_Picture_0.jpeg",
                "size_bytes": 1338,
                "description": "This image appears to be a simple illustration or diagram related to the \"Glimpses of India\" chapter about traditional Goan bakers (paders). The image likely shows a visual element connected to the text's discussion of bread-making traditions, baker's attire, or daily life in Goa, serving to help students visualize the cultural practices described in this English literature lesson.",
                "description_generated_at": "2025-07-19 11:45:16"
            },
            {
                "name": "_page_5_Picture_15.jpeg",
                "path": "/home/content/converted_books/images/jeff105/_page_5_Picture_15.jpeg",
                "size_bytes": 33125,
                "description": "This black and white photograph shows a person wearing traditional Coorgi dress, including the distinctive kuppia (a long, black coat with an embroidered waist-belt) mentioned in the text. The image serves to illustrate the unique cultural attire of the Kodavu people discussed in this chapter about Coorg, helping students visualize the traditional clothing that reflects their distinct heritage and customs.",
                "description_generated_at": "2025-07-19 11:45:16"
            }
        ],
        "exercises": [
            {
                "question": "What images of people and of places come to your mind, when you think of our country?",
                "answer": "This is a personal reflection question. Students might think of diverse images such as: bustling markets, colorful festivals, various traditional clothing styles, different languages being spoken, monuments like the Taj Mahal, diverse landscapes from mountains to beaches, farmers in fields, busy cities, peaceful villages, different cuisines, and the rich cultural diversity that defines India's unity in diversity."
            },
            {
                "question": "What parts of India have you lived in, or visited? Can you name some popular tourist destinations?",
                "answer": "This is a personal experience question. Popular tourist destinations include: Kerala (backwaters), Goa (beaches), Rajasthan (palaces and forts), Kashmir (mountains and lakes), Tamil Nadu (temples), Delhi (historical monuments), Mumbai (Bollywood and business hub), Agra (Taj Mahal), Himachal Pradesh (hill stations), and Karnataka (Mysore Palace, Coorg)."
            },
            {
                "question": "You may know that apart from the British, the Dutch and the French, the Portuguese have also played a part in the history of our country. Can you say which parts of India show French and Portuguese influences?",
                "answer": "Portuguese influences are prominently seen in Goa (architecture, cuisine, Christianity), parts of Kerala (Fort Kochi), and Daman and Diu. French influences are visible in Puducherry (formerly Pondicherry), Mahe in Kerala, Yanam in Andhra Pradesh, and Karaikal in Tamil Nadu. These places show European colonial architecture, cuisine, and cultural practices."
            },
            {
                "question": "Can you say which parts of India grow (i) tea, (ii) coffee?",
                "answer": "(i) Tea is primarily grown in: Assam (largest producer), West Bengal (Darjeeling), Tamil Nadu (Nilgiris), Kerala (Munnar), Himachal Pradesh, and Uttarakhand. (ii) Coffee is mainly grown in: Karnataka (largest producer - Coorg, Chikmagalur), Kerala (Wayanad, Idukki), Tamil Nadu (Nilgiris, Yercaud), and parts of Andhra Pradesh and Odisha."
            },
            {
                "question": "What are the elders in Goa nostalgic about?",
                "answer": "The elders in Goa are nostalgic about the good old Portuguese days, particularly the Portuguese and their famous loaves of bread. They remember the traditional bread-making culture that was an integral part of Goan life during Portuguese rule, including the quality of bread and the important role bakers played in society."
            },
            {
                "question": "Is bread-making still popular in Goa? How do you know?",
                "answer": "Yes, bread-making is still popular in Goa. We know this because the text mentions that 'the makers are still there' - the mixers, moulders, and bakers still exist. The traditional furnaces still exist, the fire hasn't been extinguished, and the sound of the baker's bamboo can still be heard. The family profession continues as sons carry on their fathers' work, and bakers are still known as 'pader' in Goa."
            },
            {
                "question": "What is the baker called?",
                "answer": "The baker is called 'pader' in Goa. This traditional term has been used for generations and continues to be used even today to refer to the bread-makers and sellers in Goan villages."
            },
            {
                "question": "When would the baker come everyday? Why did the children run to meet him?",
                "answer": "The baker used to come at least twice a day - once in the morning when he set out on his selling round, and again when he returned after emptying his huge basket. Children ran to meet him not for the regular loaves (which were bought by the maid-servants), but because they longed for the bread-bangles and sometimes sweet bread of special make that the baker carried for them."
            },
            {
                "question": "Match the following. What is a must: (i) as marriage gifts? (ii) for a party or a feast? (iii) for a daughter's engagement? (iv) for Christmas?",
                "answer": "(i) as marriage gifts - sweet bread called bol; (ii) for a party or a feast - bread; (iii) for a daughter's engagement - sandwiches; (iv) for Christmas - cakes and bolinhas. This shows how integral bread and baked goods were to all important occasions in Goan life."
            },
            {
                "question": "What did the bakers wear: (i) in the Portuguese days? (ii) when the author was young?",
                "answer": "(i) In the Portuguese days, bakers wore a peculiar dress called 'kabai' - a single-piece long frock reaching down to the knees. (ii) When the author was young, bakers wore a shirt and trousers which were shorter than full-length ones and longer than half pants (similar to three-quarter pants)."
            },
            {
                "question": "Who invites the comment 'he is dressed like a pader'? Why?",
                "answer": "Anyone who wears half pants that reach just below the knees invites this comment. This is because the traditional dress of bakers (paders) included trousers that were shorter than full-length but longer than half pants, creating this distinctive length that became associated with the pader's appearance."
            },
            {
                "question": "Where were the monthly accounts of the baker recorded?",
                "answer": "The monthly accounts of the baker were recorded on some wall in pencil. This was a simple but effective system of keeping track of credit given to customers, which the baker would collect at the end of each month."
            },
            {
                "question": "What does a 'jackfruit-like appearance' mean?",
                "answer": "A 'jackfruit-like appearance' refers to a plump, round, and well-fed physical appearance. Just as a jackfruit is large and bulky, this phrase describes someone who is pleasantly fat or has a robust physique. The text suggests that bakers typically had this appearance because their profession was profitable and they never starved, indicating their prosperity and good health."
            },
            {
                "question": "Which of these statements are correct? (Multiple choice about paders)",
                "answer": "The correct statements are: (i) The pader was an important person in the village in old times - TRUE, as bread was essential for all occasions; (ii) Paders still exist in Goan villages - TRUE, as mentioned in the text; (v) Bread and cakes were an integral part of Goan life in the old days - TRUE, required for all festivals and occasions. The incorrect statements are: (iii) Paders went away with Portuguese - FALSE, they still exist; (iv) Paders continue to wear single-piece long frock - FALSE, they now wear shirt and trousers; (vi) Traditional bread-baking is still very profitable - NOT MENTIONED as current status; (vii) Paders and families starve in present times - NOT MENTIONED."
            },
            {
                "question": "Is bread an important part of Goan life? How do you know this?",
                "answer": "Yes, bread is an extremely important part of Goan life. We know this because: bread is essential for all major occasions (marriages, parties, festivals), marriage gifts are meaningless without sweet bread (bol), parties lose charm without bread, sandwiches are a must for engagements, cakes and bolinhas are required for Christmas and festivals, and the text states 'not enough can be said to show how important a baker can be for a village.'"
            },
            {
                "question": "What is the tone of the author in various statements? (Multiple choice about tone)",
                "answer": "(i) 'The thud and jingle...' - nostalgic (remembering fondly); (ii) 'Maybe the father is not alive...' - hopeful (tradition continues); (iii) 'I still recall the typical fragrance...' - nostalgic (fond memories); (iv) 'The tiger never brushed his teeth...' - naughty (playful childhood logic); (v) 'Cakes and bolinhas are a must...' - matter-of-fact (stating facts); (vi) 'The baker and his family never starved...' - matter-of-fact (describing their condition)."
            },
            {
                "question": "Complete the table about author's childhood days with clues about bread-baking.",
                "answer": "The way bread was baked: In traditional, age-old, time-tested furnaces that still existed. The way the pader sold bread: Door-to-door with a bamboo staff, carrying a large basket on his head, making 'jhang, jhang' sounds. What the pader wore: Shirt and trousers shorter than full-length but longer than half pants. When the pader was paid: At the end of the month, with accounts recorded on walls in pencil. How the pader looked: Happy, prosperous, with plump physique - well-fed and healthy appearance."
            },
            {
                "question": "Where is Coorg?",
                "answer": "Coorg (or Kodagu) is the smallest district of Karnataka, located midway between Mysore and the coastal town of Mangalore. It is described as 'a piece of heaven' with rolling hills, and is famous for its coffee plantations, rainforests, and spices."
            },
            {
                "question": "What is the story about the Kodavu people's descent?",
                "answer": "There are two theories about Kodavu people's descent: (1) Greek origin - A part of Alexander's army moved south along the coast and settled in Coorg when return became impractical. These people married locals, and their culture is apparent in martial traditions and religious rites distinct from Hindu mainstream. (2) Arabic origin - Supported by the long black coat with embroidered waist-belt (kuppia) worn by Kodavus, which resembles the kuffia worn by Arabs and Kurds."
            },
            {
                "question": "What are some things you now know about (i) the people of Coorg? (ii) the main crop of Coorg? (iii) the sports it offers to tourists? (iv) the animals you are likely to see in Coorg? (v) its distance from Bangalore, and how to get there?",
                "answer": "(i) People of Coorg: Fiercely independent, possibly of Greek/Arabic descent, martial traditions, hospitable, known for valour, Coorg Regiment is highly decorated, only people in India permitted to carry firearms without license. (ii) Main crop: Coffee, along with spices. (iii) Sports for tourists: River rafting, canoeing, rappelling, rock climbing, mountain biking, trekking. (iv) Animals: Wild elephants, macaques, Malabar squirrels, langurs, slender loris, kingfishers, mahaseer fish. (v) Distance and access: 250-260 km from Bangalore, accessible by air (via Mangalore 135km or Bangalore 260km), rail (via Mysore, Mangalore, Hassan), road (two routes via Mysore or via Neelamangal)."
            },
            {
                "question": "Find phrases from the text that have the same meaning as given sentences.",
                "answer": "(i) 'it pours enough to keep many visitors away' (para 2); (ii) 'a part of Alexander's army moved south along the coast and settled here' (para 3); (iii) 'they are more than willing to recount numerous tales of valour' (para 4); (iv) 'The most laidback individuals become converts to the life of high-energy adventure' (para 6); (v) 'The theory of Arab origin draws support from the long, black coat with an embroidered waist-belt' (para 3); (vi) 'keep a watchful eye from the tree canopy' (para 7)."
            },
            {
                "question": "Work with collocations - which adjectives go with which nouns?",
                "answer": "(i) culture: unique culture, ancient culture; (ii) monks: serious monks; (iii) surprise: sudden surprise; (iv) experience: unforgettable experience, terrible experience; (v) weather: terrible weather; (vi) tradition: ancient tradition, unique tradition. These collocations show how certain adjectives naturally pair with specific nouns to create meaningful expressions."
            },
            {
                "question": "Complete phrases from the text and find alternatives.",
                "answer": "(i) tales of valour/courage; (ii) coastal town/area; (iii) a piece of heaven/land; (iv) evergreen rainforests/trees; (v) coffee plantations/estates; (vi) rope bridge/suspension bridge; (vii) wild elephants/animals. Alternative words could include: stories of bravery, seaside region, slice of paradise, dense forests, tea gardens, wooden bridge, jungle creatures."
            },
            {
                "question": "Use upkeep, downpour, undergo, dropout, walk-in appropriately in sentences.",
                "answer": "(i) A heavy downpour has been forecast due to low pressure in the Bay of Bengal. (ii) Rakesh will undergo major surgery tomorrow morning. (iii) My brother is responsible for the upkeep of our family property. (iv) The dropout rate for this accountancy course is very high. (v) She went to the Enterprise Company to attend a walk-in interview."
            },
            {
                "question": "Fill in blanks by combining verbs with particles (over, by, through, out, up, down).",
                "answer": "(i) The Army attempted unsuccessfully to overthrow the Government. (ii) Scientists are on the brink of a major breakthrough in cancer research. (iii) The State Government plans to build a bypass for Bhubaneswar to speed up traffic on the main highway. (iv) Gautama's outlook on life changed when he realised that the world is full of sorrow. (v) Rakesh seemed unusually downcast after the game."
            },
            {
                "question": "Think of suitable -ing or -ed adjectives to describe various situations.",
                "answer": "(i) a good detective serial: exciting/thrilling; (ii) a debate on 'Homework Should Be Banned': interesting/engaging; (iii) staying indoors due to rain: bored/frustrated; (iv) opening a present: excited/delighted; (v) watching favourite TV programme: entertained/pleased; (vi) mother's face while waiting in queue: tired/annoyed; (vii) tracking a tiger: excited/thrilled; (viii) a recently read story/film: interesting/boring (depending on quality)."
            },
            {
                "question": "Find three things that cannot happen in a treeless forest and explain the sun's 'feet' imagery.",
                "answer": "Three things that cannot happen in a treeless forest: (1) no bird could sit, (2) no insect hide, (3) no sun bury its feet in shadow. The phrase 'sun bury its feet in shadow' creates a personified image where the sun is given human characteristics. The sun's 'feet' could refer to its rays reaching the ground, and 'burying feet in shadow' suggests the sun's rays creating dappled light and shadow patterns through tree canopy - something impossible without trees."
            },
            {
                "question": "Where are the trees in the poem? What do their roots, leaves, and twigs do? What does the poet compare their branches to?",
                "answer": "The trees are inside the house/building, apparently as indoor plants or decorations. Their roots work all night to disengage themselves from cracks in the veranda floor, their leaves strain toward the glass, and small twigs are stiff with exertion. The poet compares their branches (long-cramped boughs) to 'newly discharged patients half-dazed, moving to the clinic doors,' suggesting they are like patients leaving a hospital, weak but determined to reach freedom."
            },
            {
                "question": "How does the poet describe the moon at the beginning and end of the third stanza? What causes this change?",
                "answer": "At the beginning of the third stanza, the moon is described as 'the whole moon shines in a sky still open.' At the end, 'The moon is broken like a mirror, its pieces flash now in the crown of the tallest oak.' The change is caused by the trees moving out and their branches/leaves breaking up the moonlight, creating a fragmented reflection. The trees' movement from inside to outside changes how the moonlight appears - from whole and clear to broken and scattered through the tree canopy."
            },
            {
                "question": "Does the poem present a conflict between man and nature? What new meanings emerge if trees are symbolic of human beings?",
                "answer": "Yes, the poem presents a conflict between man and nature, suggesting that plants and trees used for 'interior decoration' are 'imprisoned' and need to 'break out' to return to their natural habitat - the forest. If trees symbolize human beings, new meanings emerge: the poem could represent people breaking free from confinement (social, psychological, or physical), the need for humans to reconnect with nature, or individuals escaping from oppressive situations to find their true place. The 'departure' could symbolize liberation, self-discovery, or the human need for freedom and authentic existence."
            },
            {
                "question": "Find homophones that are spelt similarly but have different meanings.",
                "answer": "The homophones in the given examples are: (1) 'refuse' (verb: to decline) and 'refuse' (noun: garbage/waste) - pronounced differently; (2) 'dove' (noun: bird) and 'dove' (past tense of dive) - same spelling, different meanings; (3) 'invalid' (adjective: not valid) and 'invalid' (noun: sick person) - pronounced differently. These demonstrate how English words can have identical spelling but different pronunciations and meanings depending on context."
            }
        ],
        "summary": {
            "title": "Glimpses of India",
            "key_concepts": [
                "Cultural diversity and regional traditions of India",
                "Traditional occupations and their social significance",
                "Geographic and cultural characteristics of different Indian regions",
                "The impact of colonial history on local cultures",
                "Preservation of traditional practices in modern times"
            ],
            "summary": "This chapter presents three distinct glimpses of India through 'A Baker from Goa,' 'Coorg,' and 'Tea from Assam,' showcasing the country's rich cultural and geographical diversity. The first section nostalgically describes the traditional Goan baker (pader) and the integral role of bread-making in Goan society, reflecting Portuguese colonial influence. The second section explores Coorg (Kodagu), Karnataka's smallest district, highlighting its coffee plantations, natural beauty, and the unique martial culture of the Kodavu people with their possibly Greek or Arabic origins. The final section follows two students traveling through Assam's tea country, revealing the legends and history of tea cultivation while showcasing the region's lush green landscapes. Together, these pieces illustrate how India's diverse regions maintain their distinct identities while contributing to the nation's collective cultural heritage, emphasizing themes of tradition, natural beauty, and the enduring influence of historical interactions with various cultures."
        }
    },
    "statistics": {
        "total_images": 4,
        "text_length": 29062,
        "processing_time": 10.87
    },
    "claude_processing": {
        "processed_at": "2025-07-19 10:42:40",
        "model_used": "claude-sonnet-4-20250514",
        "tasks_completed": [
            "exercises",
            "summary",
            "answers",
            "image_descriptions"
        ],
        "exercises_count": 31,
        "images_processed": 4,
        "last_updated": "2025-07-19 11:45:16",
        "images_reprocessed": 4
    }
}